# -*- coding: utf-8 -*-
#import pandas as pd
#import numpy as np
from numpy import nan
from numpy import NaN
from pandas import notnull
from pandas import isnull
from pandas import read_json
from pandas import DataFrame
from pandas import to_datetime
from pandas import ExcelWriter
from pandas import Timedelta
from datetime import timedelta
from pandas import Series
from io import BytesIO
from collections import OrderedDict
import urllib.request
import re
import json
import dc.APIMapping
import dc.APISettings
from pandas.io.common import _is_url, _urlopen, get_filepath_or_buffer

# Character Translation Table
charTranslateTable = {
#    ord("哋") : "地",
#    ord("喺") : "係",
#    ord("嚟") : "黎",
#    ord("噏") : "說",
#    ord("咗") : "左",
#    ord("嗰") : "果",
#    ord("嘢") : "野",
#    ord("嘅") : "既",
#    ord("吖") : "丫",
#    ord("喇") : "啦",
#    ord("啫") : "o者",
#    ord("啲") : "的",
#    ord("啩") : "卦",
#    ord("啱") : "岩",
#    ord("晒") : "曬",
#    ord("嗌") : "叫",
#    ord("冇") : "無",
#    ord("喰") : "食",
#    ord("哎") : "艾",
#    ord("啪") : "o拍",
#    ord("滙") : "匯",
#    ord("綫") : "線",
    
    #"凤":"鳳",
    ord("肶"):"脾",
#    ord("嘅"):"既",
    ord("\t") : " ",
    ord("\n") : " ",
    ord("\r") : " ",
    ord("\xa0") : " ",
    ord("\xa1") : " ",
    ord("\xa9") : "(c)",   # ©
    ord("\xaa") : "a",
    ord("\xab") : "<<",    # «
    ord("\xac") : "",
    ord("\xad") : "-",     # soft hyphen
    ord("\xae") : "(R)",   # register sign
    ord("\xb4") : "'", # ´
    ord("\xb9") : "1",    # 1
    ord("\xbb") : ">>",    # »
    ord("\xbc") : "1/4",     # ¼
    ord("\xbf") : "",     # ¿
    ord("\xba") : "",     # º
    ord("\xbd") : "1/2",  # ½
    ord("\xc2") : "",
    ord("\xde") : "",
    ord("\x80") : None,
    ord("\x90") : None,
    ord("\x92") : "'",
    ord("\x94") : None,   #\x94
    ord("\x96") : None,
    ord("\x98") : None,
    ord("\x99") : None,
    ord("\xa0") : " ",
    ord("\xee") : "i",    #
    ord("\u02bc") : "'",    # ʼ
    ord("\u02dc") : "~",    # ˜
    ord("\ufb01") : "fi",   # ﬁ
    ord("\ufffd") : "",
    ord("\u200b") : "",     # zero width space
    ord("\u200e") : "",     # LEFT-TO-RIGHT MARK
    ord("\u2027") : ".",    # hyphenation point
    ord("\u202d") : "",     # left to right override
    ord("\u2017") : "_",    # ‗ DOUBLE LOW LINE
    ord("\u2010") : "-",
    ord("\u201e") : "\"",    # „ DOUBLE LOW-9 QUOTATION MARK
    ord("\u201f") : "\"",    # ‟ DOUBLE HIGH-REVERSED-9 QUOTATION MARK
    ord("\u201a") : "\'",    # , SINGLE LOW-9 QUOTATION MARK
    ord("\u2028") : " ",   # Line Separator
    ord("\u202a") : "",    # LEFT-TO-RIGHT EMBEDDING
    ord("\u22ef") : "...",    # ⋯
    ord("\u2665") : "",      # ♥
    ord("\u266a") : "",      # ♪
    ord("\u30fb") : "．",     # ・
    ord("\u3a02") : "揀",    # 㨂
    ord("\ufe51") : "、",
    ord("’") : "'",
    ord("\u403b") : "聘",    # 䀻
    ord("\u5c80") : "出",    # 岀
    ord("\u635c") : "搜",    # 捜
    ord("\u64b5") : "攆",    # 撵
    ord("\u6768") : "楊",    # 杨
    ord("\u7232") : "為",    # 爲
    ord("\u7589") : "疊",    # 疉
    ord("\u7ed3") : "結",    # 结
    ord("\u8f89") : "輝",    # 辉
#    ord("吓") : "o下",
#	ord("駡") : "罵",
#    ord("衆") : "眾",
#    ord("麽") : "麼",
    ord("\u5c19") : "尚",    # 尙
    ord("\u8aac") : "說",    # 説
    ord("\u5239") : "剎",    # 刹
    ord("\u5fb3") : "德",	# 徳
    ord("\u570f") : "圈",	# 圏
    ord("\u9795") : "鞭",	# 鞕
    ord("\u56d8") : "回",	# 囘
    ord("\u622f") : "戲",	# 戯
    ord("\U0010dfa8") : "", 
    ord("\u51ea") : "芷",    # 凪
    ord("\u96eb") : "霞",    # 雫
    ord("\u8181") : "賺",    # 膁
    ord("\u817e") : "騰",    # 腾
    ord("\u7af8") : "競",    # 竸
    ord("\u52d4") : "勉",    # 勔
    ord("\u951c") : "錡",    # 锜
    ord("\u551d") : "嗊",    # 唝
    ord("\u6483") : "擊",    # 撃
    ord("\uff62") : "\u300c", # 「
    ord("\uff63") : "\u300d", # 」
    ord("\u596c") : "\u734e", # 獎
    ord("\u5204") : "\u5203", # 刃
    ord("\u5e77") : "\u5e76", # 并
    ord("\u9854") : "顏", # 顔
    ord("\uff5e") : "~", # full width tilde
    ord("\u2015") : "—",
    ord("\u58de") : "壞",
    ord("\u63a6") : "揚", 
    ord("\u9039") : "達", # 逹
    ord("\u9cef") : "鳳",
    ord("\u9cc0") : "鯷", # 鳀
    ord("\u74f9") : "捐", # 瓹
    ord("\u7d76") : "絕", # 絶 
    ord("\u7ea6") : "約", # 约
    ord("\u8c8e") : "貌",
    ord("\u4050") : "映", # 䁐
#    ord("\u88cf") : "裡", # 裏
    ord("\u5bdb") : "寛", 
    ord("\ub2e4") : "", # 다
    ord("\u732f") : "", # 猯
    ord("优") : "優",
    ord("墙") : "牆",
    ord("€") : "E",
#    ord("™") : "(TM)",
    ord("³") : "3",
    ord("¦") : "|",
    ord("À") : "A",
    ord("Á") : "A",
    ord("Â") : "A",
    ord("Ã") : "A",
    ord("Ä") : "AE",
    ord("Å") : "AA",
    ord("Æ") : "AE",
    ord("Ç") : "C",
    ord("È") : "E",
    ord("É") : "E",
    ord("Ê") : "E",
    ord("Ë") : "E",
    ord("Ѐ") : "E",
    ord("Ì") : "I",
    ord("Í") : "I",
    ord("Î") : "I",
    ord("Ï") : "I",
    ord("Ð") : "D",
    ord("Ñ") : "N",
    ord("Ò") : "O",
    ord("Ó") : "O",
    ord("Ô") : "O",
    ord("Õ") : "O",
    ord("Ö") : "OE",
    ord("Ø") : "OE",
    ord("Œ") : "OE",
    ord("Ù") : "U",
    ord("Ú") : "U",
    ord("Û") : "U",
    ord("Ü") : "U",
    ord("Ý") : "Y",
    ord("Ÿ") : "Y",
    ord("à") : "a",
    ord("á") : "a",
    ord("â") : "a",
    ord("ã") : "a",
    ord("ä") : "ae",
    ord("å") : "aa",
    ord("æ") : "ae",
    ord("ç") : "c",
    ord("è") : "e",
    ord("é") : "e",
    ord("ê") : "e",
    ord("ë") : "e",
    ord("ẻ") : "e",
    ord("ì") : "i",
    ord("í") : "i",
    ord("î") : "i",
    ord("ï") : "i",
    ord("ð") : "d",
    ord("ñ") : "n",
    ord("ò") : "o",
    ord("ó") : "o",
    ord("ô") : "o",
    ord("õ") : "o",
    ord("ö") : "oe",
    ord("ø") : "oe",
    ord("œ") : "oe",
    ord("ß") : "ss",
    ord("þ") : "th",
    ord("ù") : "u",
    ord("ú") : "u",
    ord("û") : "u",
    ord("ü") : "u",
    ord("ý") : "y",
    ord("ÿ") : "y",
    ord("ž") : "z", #\u071e
    ord("š") : "s", #\u0161
    ord("：") : ": ", 
    ord("，") : ", ",
    ord("？") : "?",
    ord("…") : "...",
    ord("！") : "!",
    ord("—") : "-",
    ord("（") : " (",
    ord("）") : ") ",
    ord("／") : "/",
    
    # Simplified Chinese characters which are not encodable in Big 5
    ord("\u439b") : "考", # 䎛
    ord("\u4e13") : "專", # 专
    ord("\u4e1b") : "叢", # 丛
    ord("\u4e1d") : "絲", # 丝
    ord("\u4e22") : "丟", # 丢
    ord("\u4e25") : "嚴", # 严
    ord("\u4e27") : "喪", # 丧
    ord("\u4e34") : "臨", # 临
    ord("\u4e3a") : "為", # 为
    ord("\u4e3e") : "舉", # 举
    ord("\u4e4c") : "烏", # 乌
    ord("\u4e50") : "樂", # 乐
    ord("\u4e54") : "喬", # 乔
    ord("\u4e60") : "習", # 习
    ord("\u4e61") : "鄉", # 乡
    ord("\u4e66") : "書", # 书
    ord("\u4e70") : "買", # 买
    ord("\u4e71") : "亂", # 乱
    ord("\u4e8f") : "虧", # 亏
    ord("\u4e9a") : "亞", # 亚
    ord("\u4ea7") : "產", # 产
    ord("\u4ea9") : "畝", # 亩
    ord("\u4eb2") : "親", # 亲
    ord("\u4eb5") : "褻", # 亵
    ord("\u4ec5") : "僅", # 仅
    ord("\u4ed1") : "侖", # 仑
    ord("\u4ed3") : "倉", # 仓
    ord("\u4eec") : "們", # 们
    ord("\u4f1b") : "傴", # 伛
    ord("\u4f1e") : "傘", # 伞
    ord("\u4f1f") : "偉", # 伟
    ord("\u4f20") : "傳", # 传
    ord("\u4f24") : "傷", # 伤
    ord("\u4f25") : "倀", # 伥
    ord("\u4f26") : "倫", # 伦
    ord("\u4f27") : "傖", # 伧
    ord("\u4f2a") : "偽", # 伪
    ord("\u4f2b") : "佇", # 伫
    ord("\u4f65") : "僉", # 佥
    ord("\u4fa0") : "俠", # 侠
    ord("\u4fa3") : "侶", # 侣
    ord("\u4fa5") : "僥", # 侥
    ord("\u4fa6") : "偵", # 侦
    ord("\u4fa7") : "側", # 侧
    ord("\u4fa9") : "儈", # 侩
    ord("\u4faa") : "儕", # 侪
    ord("\u4fac") : "儂", # 侬
    ord("\u4fe3") : "俁", # 俣
    ord("\u4fe6") : "儔", # 俦
    ord("\u4fe8") : "儼", # 俨
    ord("\u4fe9") : "倆", # 俩
    ord("\u4fea") : "儷", # 俪
    ord("\u4fed") : "儉", # 俭
    ord("\u503a") : "債", # 债
    ord("\u503e") : "傾", # 倾
    ord("\u507b") : "僂", # 偻
    ord("\u507e") : "僨", # 偾
    ord("\u507f") : "償", # 偿
    ord("\u50a5") : "儻", # 傥
    ord("\u50a7") : "儐", # 傧
    ord("\u50a8") : "儲", # 储
    ord("\u50a9") : "儺", # 傩
    ord("\u50de") : "偽", # 僞
    ord("\u5151") : "兌", # 兑
    ord("\u5170") : "蘭", # 兰
    ord("\u5173") : "關", # 关
    ord("\u517b") : "養", # 养
    ord("\u517d") : "獸", # 兽
    ord("\u5181") : "囅", # 冁
    ord("\u5185") : "內", # 内
    ord("\u5188") : "岡", # 冈
    ord("\u518c") : "冊", # 册
    ord("\u5199") : "寫", # 写
    ord("\u519b") : "軍", # 军
    ord("\u51af") : "馮", # 冯
    ord("\u51bb") : "凍", # 冻
    ord("\u51b2") : "沖", # 冲
    ord("\u51c0") : "凈", # 净
    ord("\u51eb") : "鳧", # 凫
    ord("\u51ef") : "凱", # 凯
    ord("\u51e4") : "鳳", # 凤       
    ord("\u51fb") : "擊", # 击
    ord("\u51ff") : "鑿", # 凿
    ord("\u520d") : "芻", # 刍
    ord("\u5218") : "劉", # 刘
    ord("\u5219") : "則", # 则
    ord("\u521a") : "剛", # 刚
    ord("\u521b") : "創", # 创
    ord("\u522b") : "別", # 别
    ord("\u522d") : "剄", # 刭
    ord("\u5239") : "剎", # 刹
    ord("\u523d") : "劊", # 刽
    ord("\u523f") : "劌", # 刿
    ord("\u5240") : "剴", # 剀
    ord("\u5242") : "劑", # 剂
    ord("\u5250") : "剮", # 剐
    ord("\u5251") : "劍", # 剑
    ord("\u5265") : "剝", # 剥
    ord("\u5267") : "劇", # 剧
    ord("\u529d") : "勸", # 劝
    ord("\u529e") : "辦", # 办
    ord("\u52a2") : "勱", # 劢
    ord("\u52b1") : "勵", # 励
    ord("\u52b2") : "勁", # 劲
    ord("\u52b3") : "勞", # 劳
    ord("\u52bf") : "勢", # 势
    ord("\u52cb") : "勛", # 勋
    ord("\u5300") : "勻", # 匀
    ord("\u5326") : "匭", # 匦
    ord("\u532e") : "匱", # 匮
    ord("\u533a") : "區", # 区
    ord("\u534f") : "協", # 协
    ord("\u5355") : "單", # 单
    ord("\u5356") : "賣", # 卖
    ord("\u5362") : "盧", # 卢
    ord("\u536b") : "衛", # 卫
    ord("\u537a") : "巹", # 卺
    ord("\u5385") : "廳", # 厅
    ord("\u5386") : "歷", # 历
    ord("\u5389") : "厲", # 厉
    ord("\u538b") : "壓", # 压
    ord("\u538c") : "厭", # 厌
    ord("\u538d") : "厙", # 厍
    ord("\u5395") : "廁", # 厕
    ord("\u53a3") : "厴", # 厣
    ord("\u53bf") : "縣", # 县
    ord("\u53f9") : "嘆", # 叹
    ord("\u53f6") : "葉", # 叶
    ord("\u53fd") : "嘰", # 叽
    ord("\u5415") : "呂", # 吕
    ord("\u5417") : "嗎", # 吗
    ord("\u5450") : "吶", # 呐
    ord("\u5452") : "嘸", # 呒
    ord("\u5453") : "囈", # 呓
    ord("\u5455") : "嘔", # 呕
    ord("\u5456") : "嚦", # 呖
    ord("\u5457") : "唄", # 呗
    ord("\u5458") : "員", # 员
    ord("\u5459") : "咼", # 呙
    ord("\u545b") : "嗆", # 呛
    ord("\u545c") : "嗚", # 呜
    ord("\u5499") : "嚨", # 咙
    ord("\u549b") : "嚀", # 咛
    ord("\u549d") : "噝", # 咝
    ord("\u54d1") : "啞", # 哑
    ord("\u54d2") : "噠", # 哒
    ord("\u54d3") : "嘵", # 哓
    ord("\u54d4") : "嗶", # 哔
    ord("\u54d5") : "噦", # 哕
    ord("\u54d7") : "嘩", # 哗
    ord("\u54d9") : "噲", # 哙
    ord("\u54dc") : "嚌", # 哜
    ord("\u54dd") : "噥", # 哝
    ord("\u54df") : "喲", # 哟
    ord("\u551b") : "嘜", # 唛
    ord("\u5520") : "嘮", # 唠
    ord("\u5522") : "嗩", # 唢
    ord("\u5524") : "喚", # 唤
    ord("\u5567") : "嘖", # 啧
    ord("\u556c") : "嗇", # 啬
    ord("\u556d") : "囀", # 啭
    ord("\u556e") : "嚙", # 啮
    ord("\u5578") : "嘯", # 啸
    ord("\u55b7") : "噴", # 喷
    ord("\u55bd") : "嘍", # 喽
    ord("\u55be") : "嚳", # 喾
    ord("\u55eb") : "囁", # 嗫
    ord("\u55f3") : "噯", # 嗳
    ord("\u5618") : "噓", # 嘘
    ord("\u5624") : "嚶", # 嘤
    ord("\u5631") : "囑", # 嘱
    ord("\u565c") : "嚕", # 噜
    ord("\u56a3") : "囂", # 嚣
    ord("\u56f4") : "圍", # 围
    ord("\u56f5") : "圇", # 囵
    ord("\u56fe") : "圖", # 图
    ord("\u5706") : "圓", # 圆
    ord("\u5739") : "壙", # 圹
    ord("\u573a") : "場", # 场
    ord("\u5742") : "阪", # 坂
    ord("\u575a") : "堅", # 坚
    ord("\u575c") : "壢", # 坜
    ord("\u575d") : "壩", # 坝
    ord("\u575e") : "塢", # 坞
    ord("\u5760") : "墜", # 坠
    ord("\u5784") : "壟", # 垄
    ord("\u5785") : "壟", # 垅
    ord("\u5786") : "壚", # 垆
    ord("\u5792") : "壘", # 垒
    ord("\u57a6") : "墾", # 垦
    ord("\u57a9") : "堊", # 垩
    ord("\u57ab") : "墊", # 垫
    ord("\u57ad") : "埡", # 垭
    ord("\u57b2") : "塏", # 垲
    ord("\u57d8") : "塒", # 埘
    ord("\u57d9") : "塤", # 埙
    ord("\u57da") : "堝", # 埚
    ord("\u5811") : "塹", # 堑
    ord("\u5815") : "墮", # 堕
    ord("\u58ee") : "壯", # 壮
    ord("\u58f6") : "壺", # 壶
    ord("\u5939") : "夾", # 夹
    ord("\u593a") : "奪", # 夺
    ord("\u5941") : "奩", # 奁
    ord("\u5942") : "奐", # 奂
    ord("\u594b") : "奮", # 奋
    ord("\u5956") : "獎", # 奖
    ord("\u5986") : "妝", # 妆
    ord("\u5987") : "婦", # 妇
    ord("\u5988") : "媽", # 妈
    ord("\u59a9") : "嫵", # 妩
    ord("\u59aa") : "嫗", # 妪
    ord("\u59ab") : "媯", # 妫
    ord("\u59d7") : "姍", # 姗
    ord("\u5a04") : "婁", # 娄
    ord("\u5a05") : "婭", # 娅
    ord("\u5a06") : "嬈", # 娆
    ord("\u5a07") : "嬌", # 娇
    ord("\u5a08") : "孌", # 娈
    ord("\u5a31") : "娛", # 娱
    ord("\u5a32") : "媧", # 娲
    ord("\u5a34") : "嫻", # 娴
    ord("\u5a74") : "嬰", # 婴
    ord("\u5a75") : "嬋", # 婵
    ord("\u5a76") : "嬸", # 婶
    ord("\u5aaa") : "媼", # 媪
    ord("\u5ad2") : "嬡", # 嫒
    ord("\u5ad4") : "嬪", # 嫔
    ord("\u5af1") : "嬙", # 嫱
    ord("\u5b37") : "嬤", # 嬷
    ord("\u5b59") : "孫", # 孙
    ord("\u5b6a") : "孿", # 孪
    ord("\u5ba0") : "寵", # 宠
    ord("\u5ba1") : "審", # 审
    ord("\u5bab") : "宮", # 宫
    ord("\u5bec") : "寬", # 宽
    ord("\u5bbd") : "寬", # 宽
    ord("\u5bbe") : "賓", # 宾
    ord("\u5bdd") : "寢", # 寝
    ord("\u5bf9") : "對", # 对
    ord("\u5bfb") : "尋", # 寻
    ord("\u5bfc") : "導", # 导
    ord("\u5c06") : "將", # 将
    ord("\u5c14") : "爾", # 尔
    ord("\u5c18") : "塵", # 尘
    ord("\u5c1d") : "嘗", # 尝
    ord("\u5c27") : "堯", # 尧
    ord("\u5c34") : "尷", # 尴
    ord("\u5c3d") : "盡", # 尽
    ord("\u5c42") : "層", # 层
    ord("\u5c61") : "屢", # 屡
    ord("\u5c66") : "屨", # 屦
    ord("\u5c7f") : "嶼", # 屿
    ord("\u5c81") : "歲", # 岁
    ord("\u5c82") : "豈", # 岂
    ord("\u5c96") : "嶇", # 岖
    ord("\u5c97") : "崗", # 岗
    ord("\u5c98") : "峴", # 岘
    ord("\u5c9b") : "島", # 岛
    ord("\u5cbd") : "崠", # 岽
    ord("\u5cbf") : "巋", # 岿
    ord("\u5cc4") : "嶧", # 峄
    ord("\u5ce1") : "峽", # 峡
    ord("\u5ce4") : "嶠", # 峤
    ord("\u5ce6") : "巒", # 峦
    ord("\u5d02") : "嶗", # 崂
    ord("\u5d03") : "崍", # 崃
    ord("\u5d2d") : "嶄", # 崭
    ord("\u5d58") : "嶸", # 嵘
    ord("\u5d5d") : "嶁", # 嵝
    ord("\u5dc5") : "巔", # 巅
    ord("\u5de9") : "鞏", # 巩
    ord("\u5def") : "巰", # 巯
    ord("\u5e01") : "幣", # 币
    ord("\u5e05") : "帥", # 帅
    ord("\u5e08") : "師", # 师
    ord("\u5e0f") : "幃", # 帏
    ord("\u5e10") : "帳", # 帐
    ord("\u5e1c") : "幟", # 帜
    ord("\u5e26") : "帶", # 带
    ord("\u5e27") : "幀", # 帧
    ord("\u5e31") : "幬", # 帱
    ord("\u5e3b") : "幘", # 帻
    ord("\u5e3c") : "幗", # 帼
    ord("\u5e7f") : "廣", # 广
    ord("\u5e90") : "廬", # 庐
    ord("\u5e91") : "廡", # 庑
    ord("\u5e93") : "庫", # 库
    ord("\u5e94") : "應", # 应
    ord("\u5e9e") : "龐", # 庞
    ord("\u5e9f") : "廢", # 废
    ord("\u5eea") : "廩", # 廪
    ord("\u5f00") : "開", # 开
    ord("\u5f03") : "棄", # 弃
    ord("\u5f11") : "弒", # 弑
    ord("\u5f20") : "張", # 张
    ord("\u5f25") : "彌", # 弥
    ord("\u5f2a") : "弳", # 弪
    ord("\u5f2f") : "彎", # 弯
    ord("\u5f39") : "彈", # 弹
    ord("\u5f52") : "歸", # 归
    ord("\u5f53") : "當", # 当
    ord("\u5f55") : "錄", # 录
    ord("\u5f66") : "彥", # 彦
    ord("\u5f84") : "徑", # 径
    ord("\u5f95") : "徠", # 徕
    ord("\u5fc6") : "憶", # 忆
    ord("\u5fe7") : "憂", # 忧
    ord("\u5ffe") : "愾", # 忾
    ord("\u6001") : "態", # 态
    ord("\u6002") : "慫", # 怂
    ord("\u6003") : "憮", # 怃
    ord("\u6004") : "慪", # 怄
    ord("\u6005") : "悵", # 怅
    ord("\u6006") : "愴", # 怆
    ord("\u603c") : "懟", # 怼
    ord("\u603f") : "懌", # 怿
    ord("\u604b") : "戀", # 恋
    ord("\u6073") : "懇", # 恳
    ord("\u6076") : "惡", # 恶
    ord("\u6078") : "慟", # 恸
    ord("\u6079") : "懨", # 恹
    ord("\u607a") : "愷", # 恺
    ord("\u607b") : "惻", # 恻
    ord("\u607c") : "惱", # 恼
    ord("\u607d") : "惲", # 恽
    ord("\u60a6") : "悅", # 悦
    ord("\u60ab") : "愨", # 悫
    ord("\u60ac") : "懸", # 悬
    ord("\u60ad") : "慳", # 悭
    ord("\u60af") : "憫", # 悯
    ord("\u60eb") : "憊", # 惫
    ord("\u60ec") : "愜", # 惬
    ord("\u60ed") : "慚", # 惭
    ord("\u60ee") : "憚", # 惮
    ord("\u60ef") : "慣", # 惯
    ord("\u6120") : "慍", # 愠
    ord("\u6124") : "憤", # 愤
    ord("\u6126") : "憒", # 愦
    ord("\u6151") : "懾", # 慑
    ord("\u61d1") : "懣", # 懑
    ord("\u61d2") : "懶", # 懒
    ord("\u61d4") : "懍", # 懔
    ord("\u6206") : "戇", # 戆
    ord("\u620b") : "戔", # 戋
    ord("\u620f") : "戲", # 戏
    ord("\u6217") : "戧", # 戗
    ord("\u6218") : "戰", # 战
    ord("\u6267") : "執", # 执
    ord("\u6269") : "擴", # 扩
    ord("\u626a") : "捫", # 扪
    ord("\u626b") : "掃", # 扫
    ord("\u626c") : "揚", # 扬
    ord("\u629a") : "撫", # 抚
    ord("\u629b") : "拋", # 抛
    ord("\u629f") : "摶", # 抟
    ord("\u62a0") : "摳", # 抠
    ord("\u62a1") : "掄", # 抡
    ord("\u62a2") : "搶", # 抢
    ord("\u62a5") : "報", # 报
    ord("\u62e2") : "攏", # 拢
    ord("\u62e3") : "揀", # 拣
    ord("\u62e6") : "攔", # 拦
    ord("\u62e7") : "擰", # 拧
    ord("\u62e8") : "撥", # 拨
    ord("\u62e9") : "擇", # 择
    ord("\u631a") : "摯", # 挚
    ord("\u631b") : "攣", # 挛
    ord("\u631d") : "撾", # 挝
    ord("\u631e") : "撻", # 挞
    ord("\u631f") : "挾", # 挟
    ord("\u6320") : "撓", # 挠
    ord("\u6321") : "擋", # 挡
    ord("\u6322") : "撟", # 挢
    ord("\u6323") : "掙", # 挣
    ord("\u6324") : "擠", # 挤
    ord("\u6325") : "揮", # 挥
    ord("\u635e") : "撈", # 捞
    ord("\u635f") : "損", # 损
    ord("\u6361") : "撿", # 捡
    ord("\u6362") : "換", # 换
    ord("\u6363") : "搗", # 捣
    ord("\u63b2") : "揭", # 掳
    ord("\u63b3") : "擄", # 掳
    ord("\u63b4") : "摑", # 掴
    ord("\u63b7") : "擲", # 掷
    ord("\u63b8") : "撣", # 掸
    ord("\u63ba") : "摻", # 掺
    ord("\u63bc") : "摜", # 掼
    ord("\u63fd") : "攬", # 揽
    ord("\u63ff") : "撳", # 揿
    ord("\u6400") : "攙", # 搀
    ord("\u6401") : "擱", # 搁
    ord("\u6402") : "摟", # 搂
    ord("\u6405") : "攪", # 搅
    ord("\u6444") : "攝", # 摄
    ord("\u6445") : "攄", # 摅
    ord("\u6446") : "擺", # 摆
    ord("\u6447") : "搖", # 摇
    ord("\u6448") : "擯", # 摈
    ord("\u644a") : "攤", # 摊
    ord("\u6484") : "攖", # 撄
    ord("\u64b5") : "攆", # 撵
    ord("\u64b7") : "擷", # 撷
    ord("\u64b8") : "擼", # 撸
    ord("\u64ba") : "攛", # 撺
    ord("\u64de") : "擻", # 擞
    ord("\u6512") : "攢", # 攒
    ord("\u654c") : "敵", # 敌
    ord("\u654e") : "教", # 敎
    ord("\u655b") : "斂", # 敛
    ord("\u6570") : "數", # 数
    ord("\u6593") : "斕", # 斓
    ord("\u65a9") : "斬", # 斩
    ord("\u65ad") : "斷", # 断
    ord("\u65e7") : "舊", # 旧
    ord("\u65f6") : "時", # 时
    ord("\u65f7") : "曠", # 旷
    ord("\u6619") : "曇", # 昙
    ord("\u663c") : "晝", # 昼
    ord("\u663e") : "顯", # 显
    ord("\u6654") : "曄", # 晔
    ord("\u6655") : "暈", # 晕
    ord("\u6656") : "暉", # 晖
    ord("\u6682") : "暫", # 暂
    ord("\u66a7") : "曖", # 暧
    ord("\u672f") : "術", # 术
    ord("\u6740") : "殺", # 杀
    ord("\u6742") : "雜", # 杂
    ord("\u6743") : "權", # 权
    ord("\u6765") : "來", # 来
    ord("\u6768") : "楊", # 杨
    ord("\u6769") : "榪", # 杩
    ord("\u679e") : "樅", # 枞
    ord("\u67a2") : "樞", # 枢
    ord("\u67a3") : "棗", # 枣
    ord("\u67a5") : "櫪", # 枥
    ord("\u67a7") : "梘", # 枧
    ord("\u67a8") : "棖", # 枨
    ord("\u67aa") : "槍", # 枪
    ord("\u67ab") : "楓", # 枫
    ord("\u67ad") : "梟", # 枭
    ord("\u67e0") : "檸", # 柠
    ord("\u67fd") : "檉", # 柽
    ord("\u6805") : "柵", # 栅
    ord("\u6807") : "標", # 标
    ord("\u6808") : "棧", # 栈
    ord("\u6809") : "櫛", # 栉
    ord("\u680a") : "櫳", # 栊
    ord("\u680b") : "棟", # 栋
    ord("\u680c") : "櫨", # 栌
    ord("\u680e") : "櫟", # 栎
    ord("\u680f") : "欄", # 栏
    ord("\u6811") : "樹", # 树
    ord("\u6860") : "椏", # 桠
    ord("\u6861") : "橈", # 桡
    ord("\u6862") : "楨", # 桢
    ord("\u6863") : "檔", # 档
    ord("\u6864") : "榿", # 桤
    ord("\u6866") : "樺", # 桦
    ord("\u6867") : "檜", # 桧
    ord("\u6868") : "槳", # 桨
    ord("\u6869") : "樁", # 桩
    ord("\u68c0") : "檢", # 检
    ord("\u68c2") : "欞", # 棂
    ord("\u691f") : "櫝", # 椟
    ord("\u6920") : "槧", # 椠
    ord("\u6924") : "欏", # 椤
    ord("\u692d") : "橢", # 椭
    ord("\u697c") : "樓", # 楼
    ord("\u6984") : "欖", # 榄
    ord("\u6987") : "櫬", # 榇
    ord("\u6988") : "櫚", # 榈
    ord("\u6989") : "櫸", # 榉
    ord("\u69db") : "檻", # 槛
    ord("\u69df") : "檳", # 槟
    ord("\u69e0") : "櫧", # 槠
    ord("\u6a2a") : "橫", # 横
    ord("\u6a2f") : "檣", # 樯
    ord("\u6a31") : "櫻", # 樱
    ord("\u6a79") : "櫓", # 橹
    ord("\u6a7c") : "櫞", # 橼
    ord("\u6aa9") : "檁", # 檩
    ord("\u6b22") : "歡", # 欢
    ord("\u6b24") : "歟", # 欤
    ord("\u6b27") : "歐", # 欧
    ord("\u6b7c") : "殲", # 歼
    ord("\u6b87") : "殤", # 殇
    ord("\u6b8b") : "殘", # 残
    ord("\u6b92") : "殞", # 殒
    ord("\u6b93") : "殮", # 殓
    ord("\u6b9a") : "殫", # 殚
    ord("\u6ba1") : "殯", # 殡
    ord("\u6bb4") : "毆", # 殴
    ord("\u6bc2") : "轂", # 毂
    ord("\u6bd5") : "畢", # 毕
    ord("\u6bd9") : "斃", # 毙
    ord("\u6bf5") : "毿", # 毵
    ord("\u6c07") : "氌", # 氇
    ord("\u6c22") : "氫", # 氢
    ord("\u6c29") : "氬", # 氩
    ord("\u6c32") : "氳", # 氲
    ord("\u6c47") : "匯", # 汇
    ord("\u6c64") : "湯", # 汤
    ord("\u6ca1") : "沒", # 没
    ord("\u6ca3") : "灃", # 沣
    ord("\u6ca4") : "漚", # 沤
    ord("\u6ca5") : "瀝", # 沥
    ord("\u6ca6") : "淪", # 沦
    ord("\u6ca7") : "滄", # 沧
    ord("\u6ca9") : "溈", # 沩
    ord("\u6cf6") : "澩", # 泶
    ord("\u6cf7") : "瀧", # 泷
    ord("\u6cf8") : "瀘", # 泸
    ord("\u6cfa") : "濼", # 泺
    ord("\u6cfb") : "瀉", # 泻
    ord("\u6cfc") : "潑", # 泼
    ord("\u6cfd") : "澤", # 泽
    ord("\u6cfe") : "涇", # 泾
    ord("\u6d43") : "浹", # 浃
    ord("\u6d45") : "淺", # 浅
    ord("\u6d46") : "漿", # 浆
    ord("\u6d47") : "澆", # 浇
    ord("\u6d48") : "湞", # 浈
    ord("\u6d4a") : "濁", # 浊
    ord("\u6d4b") : "測", # 测
    ord("\u6d4d") : "澮", # 浍
    ord("\u6d4f") : "瀏", # 浏
    ord("\u6d51") : "渾", # 浑
    ord("\u6d52") : "滸", # 浒
    ord("\u6d53") : "濃", # 浓
    ord("\u6d54") : "潯", # 浔
    ord("\u6d9b") : "濤", # 涛
    ord("\u6d9d") : "澇", # 涝
    ord("\u6d9e") : "淶", # 涞
    ord("\u6d9f") : "漣", # 涟
    ord("\u6da0") : "潿", # 涠
    ord("\u6da1") : "渦", # 涡
    ord("\u6da3") : "渙", # 涣
    ord("\u6da6") : "潤", # 润
    ord("\u6da7") : "澗", # 涧
    ord("\u6da8") : "漲", # 涨
    ord("\u6da9") : "澀", # 涩
    ord("\u6e0c") : "淥", # 渌
    ord("\u6e0d") : "漬", # 渍
    ord("\u6e0e") : "瀆", # 渎
    ord("\u6e10") : "漸", # 渐
    ord("\u6e11") : "澠", # 渑
    ord("\u6e14") : "漁", # 渔
    ord("\u6e16") : "瀋", # 渖
    ord("\u6e17") : "滲", # 渗
    ord("\u6e7e") : "灣", # 湾
    ord("\u6e7f") : "濕", # 湿
    ord("\u6e83") : "潰", # 溃
    ord("\u6e85") : "濺", # 溅
    ord("\u6ed7") : "潷", # 滗
    ord("\u6ede") : "滯", # 滞
    ord("\u6edf") : "灩", # 滟
    ord("\u6ee0") : "灄", # 滠
    ord("\u6ee1") : "滿", # 满
    ord("\u6ee4") : "濾", # 滤
    ord("\u6ee5") : "濫", # 滥
    ord("\u6ee6") : "灤", # 滦
    ord("\u6f46") : "瀠", # 潆
    ord("\u6f47") : "瀟", # 潇
    ord("\u6f4b") : "瀲", # 潋
    ord("\u6f4d") : "濰", # 潍
    ord("\u6f9c") : "瀾", # 澜
    ord("\u6fd1") : "瀨", # 濑
    ord("\u6fd2") : "瀕", # 濒
    ord("\u704f") : "灝", # 灏
    ord("\u706d") : "滅", # 灭
    ord("\u7080") : "煬", # 炀
    ord("\u709c") : "煒", # 炜
    ord("\u709d") : "熗", # 炝
    ord("\u70c1") : "爍", # 烁
    ord("\u70c2") : "爛", # 烂
    ord("\u70c3") : "烴", # 烃
    ord("\u70db") : "燭", # 烛
    ord("\u70e6") : "煩", # 烦
    ord("\u70e7") : "燒", # 烧
    ord("\u70e8") : "燁", # 烨
    ord("\u70e9") : "燴", # 烩
    ord("\u70eb") : "燙", # 烫
    ord("\u70ec") : "燼", # 烬
    ord("\u70ed") : "熱", # 热
    ord("\u7115") : "煥", # 焕
    ord("\u7116") : "燜", # 焖
    ord("\u7118") : "燾", # 焘
    ord("\u7231") : "愛", # 爱
    ord("\u7237") : "爺", # 爷
    ord("\u724d") : "牘", # 牍
    ord("\u7275") : "牽", # 牵
    ord("\u727a") : "犧", # 牺
    ord("\u728a") : "犢", # 犊
    ord("\u72b6") : "狀", # 状
    ord("\u72b7") : "獷", # 犷
    ord("\u72b8") : "獁", # 犸
    ord("\u72b9") : "猶", # 犹
    ord("\u72c8") : "狽", # 狈
    ord("\u72de") : "獰", # 狞
    ord("\u72ec") : "獨", # 独
    ord("\u72ed") : "狹", # 狭
    ord("\u72ee") : "獅", # 狮
    ord("\u72ef") : "獪", # 狯
    ord("\u72f0") : "猙", # 狰
    ord("\u72f1") : "獄", # 狱
    ord("\u72f2") : "猻", # 狲
    ord("\u7303") : "獫", # 猃
    ord("\u730e") : "獵", # 猎
    ord("\u7315") : "獼", # 猕
    ord("\u7321") : "玀", # 猡
    ord("\u736d") : "獺", # 獭
    ord("\u7391") : "璣", # 玑
    ord("\u739b") : "瑪", # 玛
    ord("\u73ae") : "瑋", # 玮
    ord("\u73af") : "環", # 环
    ord("\u73b0") : "現", # 现                      
    ord("\u73d1") : "瓏", # 珑
    ord("\u73f2") : "琿", # 珲
    ord("\u740f") : "璉", # 琏
    ord("\u7410") : "瑣", # 琐
    ord("\u7460") : "瑠", # 瑠
    ord("\u7477") : "璦", # 瑷
    ord("\u748e") : "瓔", # 璎
    ord("\u74d2") : "瓚", # 瓒
    ord("\u74ef") : "甌", # 瓯
    ord("\u7545") : "暢", # 畅
    ord("\u7574") : "疇", # 畴
    ord("\u7596") : "癤", # 疖
    ord("\u7597") : "療", # 疗
    ord("\u759f") : "瘧", # 疟
    ord("\u75a0") : "癘", # 疠
    ord("\u75a1") : "瘍", # 疡
    ord("\u75ac") : "癧", # 疬
    ord("\u75ae") : "瘡", # 疮
    ord("\u75af") : "瘋", # 疯
    ord("\u75c9") : "痙", # 痉
    ord("\u75d6") : "瘂", # 痖
    ord("\u75e8") : "癆", # 痨
    ord("\u75ea") : "瘓", # 痪
    ord("\u75eb") : "癇", # 痫
    ord("\u7605") : "癉", # 瘅
    ord("\u7617") : "瘞", # 瘗
    ord("\u7618") : "瘺", # 瘘
    ord("\u762a") : "癟", # 瘪
    ord("\u762b") : "癱", # 瘫
    ord("\u763e") : "癮", # 瘾
    ord("\u763f") : "癭", # 瘿
    ord("\u765e") : "癩", # 癞
    ord("\u7663") : "癬", # 癣
    ord("\u766b") : "癲", # 癫
    ord("\u7691") : "皚", # 皑
    ord("\u76b1") : "皺", # 皱
    ord("\u76b2") : "皸", # 皲
    ord("\u76cf") : "盞", # 盏
    ord("\u76d0") : "鹽", # 盐
    ord("\u76d1") : "監", # 监
    ord("\u76d7") : "盜", # 盗
    ord("\u76d8") : "盤", # 盘
    ord("\u770d") : "瞘", # 眍
    ord("\u7741") : "睜", # 睁
    ord("\u7750") : "睞", # 睐
    ord("\u7751") : "瞼", # 睑
    ord("\u7792") : "瞞", # 瞒
    ord("\u77a9") : "矚", # 瞩
    ord("\u77eb") : "矯", # 矫
    ord("\u77f6") : "磯", # 矶
    ord("\u77ff") : "礦", # 矿
    ord("\u7800") : "碭", # 砀
    ord("\u7801") : "碼", # 码
    ord("\u7816") : "磚", # 砖
    ord("\u7817") : "硨", # 砗
    ord("\u781a") : "硯", # 砚
    ord("\u783a") : "礪", # 砺
    ord("\u783b") : "礱", # 砻
    ord("\u783e") : "礫", # 砾
    ord("\u7840") : "礎", # 础
    ord("\u7855") : "碩", # 硕
    ord("\u7856") : "硤", # 硖
    ord("\u7857") : "磽", # 硗
    ord("\u7877") : "鹼", # 硷
    ord("\u789b") : "磧", # 碛
    ord("\u789c") : "磣", # 碜
    ord("\u78d9") : "滾", # 磙
    ord("\u796f") : "禎", # 祯
    ord("\u7977") : "禱", # 祷
    ord("\u7978") : "禍", # 祸
    ord("\u7984") : "祿", # 禄
    ord("\u7985") : "禪", # 禅
    ord("\u79c3") : "禿", # 秃
    ord("\u79ef") : "積", # 积
    ord("\u79f0") : "稱", # 称
    ord("\u79fd") : "穢", # 秽
    ord("\u7a0e") : "稅", # 税
    ord("\u7a23") : "穌", # 稣
    ord("\u7a33") : "穩", # 稳
    ord("\u7a51") : "穡", # 穑
    ord("\u7a77") : "窮", # 穷
    ord("\u7a8d") : "竅", # 窍
    ord("\u7a9c") : "竄", # 窜
    ord("\u7a9d") : "窩", # 窝
    ord("\u7aa5") : "窺", # 窥
    ord("\u7aa6") : "竇", # 窦
    ord("\u7aad") : "窶", # 窭
    ord("\u7ad6") : "豎", # 竖
    ord("\u7ade") : "競", # 竞
    ord("\u7b03") : "篤", # 笃
    ord("\u7b15") : "筧", # 笕
    ord("\u7b3a") : "箋", # 笺
    ord("\u7b3c") : "籠", # 笼
    ord("\u7b3e") : "籩", # 笾
    ord("\u7b5a") : "篳", # 筚
    ord("\u7b5b") : "篩", # 筛
    ord("\u7b5d") : "箏", # 筝
    ord("\u7b79") : "籌", # 筹
    ord("\u7b7e") : "簽", # 签
    ord("\u7b80") : "簡", # 简
    ord("\u7ba6") : "簀", # 箦
    ord("\u7ba7") : "篋", # 箧
    ord("\u7ba8") : "籜", # 箨
    ord("\u7ba9") : "籮", # 箩
    ord("\u7baa") : "簞", # 箪
    ord("\u7bab") : "簫", # 箫
    ord("\u7bd1") : "簣", # 篑
    ord("\u7bd3") : "簍", # 篓
    ord("\u7bee") : "籃", # 篮
    ord("\u7c16") : "籪", # 簖
    ord("\u7c41") : "籟", # 籁
    ord("\u7c9d") : "糲", # 粝
    ord("\u7ca4") : "粵", # 粤
    ord("\u7caa") : "糞", # 粪
    ord("\u7cc1") : "糝", # 糁
    ord("\u7d27") : "緊", # 紧
    ord("\u7d77") : "縶", # 絷
    ord("\u7dd1") : "綠", # 絷
    ord("\u7e04") : "繩", # 縄
    ord("\u7ea0") : "糾", # 纠
    ord("\u7ea1") : "紆", # 纡
    ord("\u7ea2") : "紅", # 红
    ord("\u7ea3") : "紂", # 纣
    ord("\u7ea5") : "紇", # 纥
    ord("\u7ea6") : "約", # 约
    ord("\u7ea7") : "級", # 级
    ord("\u7ea8") : "紈", # 纨
    ord("\u7ea9") : "纊", # 纩
    ord("\u7eaa") : "紀", # 纪
    ord("\u7eab") : "紉", # 纫
    ord("\u7ead") : "紜", # 纭
    ord("\u7eaf") : "純", # 纯
    ord("\u7eb0") : "紕", # 纰
    ord("\u7eb1") : "紗", # 纱
    ord("\u7eb2") : "綱", # 纲
    ord("\u7eb3") : "納", # 纳
    ord("\u7eb5") : "縱", # 纵
    ord("\u7eb6") : "綸", # 纶
    ord("\u7eb7") : "紛", # 纷
    ord("\u7eb8") : "紙", # 纸
    ord("\u7eb9") : "紋", # 纹
    ord("\u7ebd") : "紐", # 纽
    ord("\u7ebe") : "紓", # 纾
    ord("\u7ebf") : "線", # 线
    ord("\u7ec0") : "紺", # 绀
    ord("\u7ec1") : "紲", # 绁
    ord("\u7ec2") : "紱", # 绂
    ord("\u7ec3") : "練", # 练
    ord("\u7ec4") : "組", # 组
    ord("\u7ec5") : "紳", # 绅
    ord("\u7ec6") : "細", # 细
    ord("\u7ec8") : "終", # 终
    ord("\u7ec9") : "縐", # 绉
    ord("\u7eca") : "絆", # 绊
    ord("\u7ecb") : "紼", # 绋
    ord("\u7ecc") : "絀", # 绌
    ord("\u7ecd") : "紹", # 绍
    ord("\u7ece") : "繹", # 绎
    ord("\u7ed0") : "紿", # 绐
    ord("\u7ed1") : "綁", # 绑
    ord("\u7ed2") : "絨", # 绒
    ord("\u7ed3") : "結", # 结
    ord("\u7ed4") : "絝", # 绔
    ord("\u7ed5") : "繞", # 绕
    ord("\u7ed7") : "絎", # 绗
    ord("\u7ed8") : "繪", # 绘
    ord("\u7ed9") : "給", # 给
    ord("\u7eda") : "絢", # 绚
    ord("\u7edb") : "絳", # 绛
    ord("\u7edc") : "絡", # 络
    ord("\u7edd") : "絕", # 绝
    ord("\u7ede") : "絞", # 绞
    ord("\u7ee0") : "綆", # 绠
    ord("\u7ee1") : "綃", # 绡
    ord("\u7ee2") : "絹", # 绢
    ord("\u7ee3") : "繡", # 绣
    ord("\u7ee5") : "綏", # 绥
    ord("\u7ee6") : "絳", # 绦
    ord("\u7ee7") : "繼", # 继
    ord("\u7ee8") : "綈", # 绨
    ord("\u7ee9") : "績", # 绩
    ord("\u7eea") : "緒", # 绪
    ord("\u7eeb") : "綾", # 绫
    ord("\u7eed") : "續", # 续
    ord("\u7eee") : "綺", # 绮
    ord("\u7eef") : "緋", # 绯
    ord("\u7ef0") : "綽", # 绰
    ord("\u7ef1") : "緔", # 绱
    ord("\u7ef2") : "緄", # 绲
    ord("\u7ef3") : "繩", # 绳
    ord("\u7ef4") : "維", # 维
    ord("\u7ef5") : "綿", # 绵
    ord("\u7ef6") : "綬", # 绶
    ord("\u7ef7") : "繃", # 绷
    ord("\u7ef8") : "綢", # 绸
    ord("\u7efa") : "綹", # 绺
    ord("\u7efb") : "綣", # 绻
    ord("\u7efc") : "綜", # 综
    ord("\u7efd") : "綻", # 绽
    ord("\u7efe") : "綰", # 绾
    ord("\u7eff") : "綠", # 绿
    ord("\u7f00") : "綴", # 缀
    ord("\u7f01") : "緇", # 缁
    ord("\u7f02") : "緙", # 缂
    ord("\u7f03") : "緗", # 缃
    ord("\u7f04") : "緘", # 缄
    ord("\u7f05") : "緬", # 缅
    ord("\u7f07") : "緹", # 缇
    ord("\u7f08") : "緲", # 缈
    ord("\u7f09") : "緝", # 缉
    ord("\u7f0b") : "繢", # 缋
    ord("\u7f0c") : "緦", # 缌
    ord("\u7f0d") : "綞", # 缍
    ord("\u7f0e") : "緞", # 缎
    ord("\u7f0f") : "緶", # 缏
    ord("\u7f11") : "緱", # 缑
    ord("\u7f12") : "縋", # 缒
    ord("\u7f13") : "緩", # 缓
    ord("\u7f14") : "締", # 缔
    ord("\u7f15") : "縷", # 缕
    ord("\u7f16") : "編", # 编
    ord("\u7f17") : "緡", # 缗
    ord("\u7f18") : "緣", # 缘
    ord("\u7f19") : "縉", # 缙
    ord("\u7f1a") : "縛", # 缚
    ord("\u7f1b") : "縟", # 缛
    ord("\u7f1c") : "縝", # 缜
    ord("\u7f1d") : "縫", # 缝
    ord("\u7f1f") : "縞", # 缟
    ord("\u7f20") : "纏", # 缠
    ord("\u7f21") : "縭", # 缡
    ord("\u7f22") : "縊", # 缢
    ord("\u7f23") : "縑", # 缣
    ord("\u7f24") : "繽", # 缤
    ord("\u7f25") : "縹", # 缥
    ord("\u7f26") : "縵", # 缦
    ord("\u7f27") : "縲", # 缧
    ord("\u7f28") : "纓", # 缨
    ord("\u7f29") : "縮", # 缩
    ord("\u7f2a") : "繆", # 缪
    ord("\u7f2b") : "繅", # 缫
    ord("\u7f2c") : "纈", # 缬
    ord("\u7f2d") : "繚", # 缭
    ord("\u7f2e") : "繕", # 缮
    ord("\u7f2f") : "繒", # 缯
    ord("\u7f30") : "韁", # 缰
    ord("\u7f31") : "繾", # 缱
    ord("\u7f32") : "繰", # 缲
    ord("\u7f33") : "繯", # 缳
    ord("\u7f34") : "繳", # 缴
    ord("\u7f35") : "纘", # 缵
    ord("\u7f42") : "罌", # 罂
    ord("\u7f57") : "羅", # 罗
    ord("\u7f5a") : "罰", # 罚
    ord("\u7f62") : "罷", # 罢
    ord("\u7f74") : "羆", # 罴
    ord("\u7f81") : "羈", # 羁
    ord("\u7f9f") : "羥", # 羟
    ord("\u7fd8") : "翹", # 翘
    ord("\u8022") : "耮", # 耢
    ord("\u8027") : "耬", # 耧
    ord("\u8038") : "聳", # 耸
    ord("\u8042") : "聶", # 聂
    ord("\u804b") : "聾", # 聋
    ord("\u804c") : "職", # 职
    ord("\u804d") : "聹", # 聍
    ord("\u8069") : "聵", # 聩
    ord("\u806a") : "聰", # 聪
    ord("\u8083") : "肅", # 肃
    ord("\u80a0") : "腸", # 肠
    ord("\u80a4") : "膚", # 肤
    ord("\u80be") : "腎", # 肾
    ord("\u80bf") : "腫", # 肿
    ord("\u80c0") : "脹", # 胀
    ord("\u80c1") : "脅", # 胁
    ord("\u80e7") : "朧", # 胧
    ord("\u80e8") : "腖", # 胨
    ord("\u80ea") : "臚", # 胪
    ord("\u80eb") : "脛", # 胫
    ord("\u810d") : "膾", # 脍
    ord("\u810f") : "臟", # 脏
    ord("\u8110") : "臍", # 脐
    ord("\u8111") : "腦", # 脑
    ord("\u8113") : "膿", # 脓
    ord("\u8131") : "脫", # 脱
    ord("\u8136") : "腡", # 脶
    ord("\u8138") : "臉", # 脸
    ord("\u817b") : "膩", # 腻
    ord("\u817d") : "膃", # 腽
    ord("\u817e") : "騰", # 腾
    ord("\u8191") : "臏", # 膑
    ord("\u8206") : "輿", # 舆
    ord("\u8223") : "艤", # 舣
    ord("\u8230") : "艦", # 舰
    ord("\u8231") : "艙", # 舱
    ord("\u823b") : "艫", # 舻
    ord("\u8270") : "艱", # 艰
    ord("\u8273") : "艷", # 艳
    ord("\u8282") : "節", # 节
    ord("\u8288") : "羋", # 芈
    ord("\u8297") : "薌", # 芗
    ord("\u829c") : "蕪", # 芜
    ord("\u82c1") : "蓯", # 苁
    ord("\u82c7") : "葦", # 苇
    ord("\u82c8") : "藶", # 苈
    ord("\u82cb") : "莧", # 苋
    ord("\u82cc") : "萇", # 苌
    ord("\u82cd") : "蒼", # 苍
    ord("\u82ce") : "苧", # 苎
    ord("\u830e") : "莖", # 茎
    ord("\u830f") : "蘢", # 茏
    ord("\u8311") : "蔦", # 茑
    ord("\u8314") : "塋", # 茔
    ord("\u8315") : "煢", # 茕
    ord("\u8346") : "荊", # 荆
    ord("\u835a") : "莢", # 荚
    ord("\u835b") : "蕘", # 荛
    ord("\u835c") : "蓽", # 荜
    ord("\u835e") : "蕎", # 荞
    ord("\u835f") : "薈", # 荟
    ord("\u8360") : "薺", # 荠
    ord("\u8361") : "蕩", # 荡
    ord("\u8364") : "葷", # 荤
    ord("\u8365") : "滎", # 荥
    ord("\u8367") : "熒", # 荧
    ord("\u8368") : "蕁", # 荨
    ord("\u8369") : "藎", # 荩
    ord("\u836a") : "蓀", # 荪
    ord("\u836b") : "蔭", # 荫
    ord("\u836c") : "蕒", # 荬
    ord("\u836d") : "葒", # 荭
    ord("\u836e") : "葤", # 荮
    ord("\u83b1") : "萊", # 莱
    ord("\u83b2") : "蓮", # 莲
    ord("\u83b3") : "蒔", # 莳
    ord("\u83b4") : "萵", # 莴
    ord("\u83b6") : "薟", # 莶
    ord("\u83b7") : "獲", # 获
    ord("\u83b8") : "蕕", # 莸
    ord("\u83ba") : "鶯", # 莺
    ord("\u83bc") : "蒓", # 莼
    ord("\u841d") : "蘿", # 萝
    ord("\u8425") : "營", # 营
    ord("\u8427") : "蕭", # 萧
    ord("\u8428") : "薩", # 萨
    ord("\u8487") : "蕆", # 蒇
    ord("\u8489") : "蕢", # 蒉
    ord("\u848b") : "蔣", # 蒋
    ord("\u848c") : "蔞", # 蒌
    ord("\u84dd") : "藍", # 蓝
    ord("\u84df") : "薊", # 蓟
    ord("\u84e0") : "蘺", # 蓠
    ord("\u84e3") : "蕷", # 蓣
    ord("\u84e6") : "驀", # 蓦
    ord("\u8537") : "薔", # 蔷
    ord("\u8539") : "蘞", # 蔹
    ord("\u853a") : "藺", # 蔺
    ord("\u853c") : "藹", # 蔼
    ord("\u8572") : "蘄", # 蕲
    ord("\u8574") : "蘊", # 蕴
    ord("\u85ae") : "藪", # 薮
    ord("\u85d3") : "蘚", # 藓
    ord("\u85f4") : "蘊", # 藴
    ord("\u864f") : "虜", # 虏
    ord("\u8651") : "慮", # 虑
    ord("\u865a") : "虛", # 虚
    ord("\u867d") : "雖", # 虽
    ord("\u867f") : "蠆", # 虿
    ord("\u8680") : "蝕", # 蚀
    ord("\u8681") : "蟻", # 蚁
    ord("\u8682") : "螞", # 蚂
    ord("\u86ac") : "蜆", # 蚬
    ord("\u86ca") : "蠱", # 蛊
    ord("\u86ce") : "蠣", # 蛎
    ord("\u86cf") : "蟶", # 蛏
    ord("\u86ee") : "蠻", # 蛮
    ord("\u86f0") : "蟄", # 蛰
    ord("\u86f1") : "蛺", # 蛱
    ord("\u86f2") : "蟯", # 蛲
    ord("\u86f3") : "螄", # 蛳
    ord("\u86f4") : "蠐", # 蛴
    ord("\u8715") : "蛻", # 蜕
    ord("\u8717") : "蝸", # 蜗
    ord("\u8747") : "蠅", # 蝇
    ord("\u8748") : "蟈", # 蝈
    ord("\u8749") : "蟬", # 蝉
    ord("\u877c") : "螻", # 蝼
    ord("\u877e") : "蠑", # 蝾
    ord("\u87a8") : "蟎", # 螨
    ord("\u8854") : "銜", # 衔
    ord("\u886c") : "襯", # 衬
    ord("\u8885") : "裊", # 袅
    ord("\u88ad") : "襲", # 袭
    ord("\u88c6") : "襠", # 裆
    ord("\u88e2") : "褳", # 裢
    ord("\u88e3") : "襝", # 裣
    ord("\u88e4") : "褲", # 裤
    ord("\u88e5") : "襇", # 裥
    ord("\u891b") : "褸", # 褛
    ord("\u8934") : "襤", # 褴
    ord("\u89c2") : "觀", # 观
    ord("\u89c4") : "規", # 规
    ord("\u89c5") : "覓", # 觅
    ord("\u89c7") : "覘", # 觇
    ord("\u89c8") : "覽", # 览
    ord("\u89c9") : "覺", # 觉
    ord("\u89ca") : "覬", # 觊
    ord("\u89cb") : "覡", # 觋
    ord("\u89cc") : "覿", # 觌
    ord("\u89ce") : "覦", # 觎
    ord("\u89cf") : "覯", # 觏
    ord("\u89d0") : "覲", # 觐
    ord("\u89d1") : "覷", # 觑
    ord("\u89de") : "觴", # 觞
    ord("\u89ef") : "觶", # 觯
    ord("\u8a89") : "譽", # 誉
    ord("\u8a8a") : "謄", # 誊
    ord("\u8ba1") : "計", # 计
    ord("\u8ba2") : "訂", # 订
    ord("\u8ba3") : "訃", # 讣
    ord("\u8ba4") : "認", # 认
    ord("\u8ba5") : "譏", # 讥
    ord("\u8ba6") : "訐", # 讦
    ord("\u8ba7") : "訌", # 讧
    ord("\u8ba8") : "討", # 讨
    ord("\u8ba9") : "讓", # 让
    ord("\u8baa") : "訕", # 讪
    ord("\u8bab") : "訖", # 讫
    ord("\u8bad") : "訓", # 训
    ord("\u8bae") : "議", # 议
    ord("\u8baf") : "訊", # 讯
    ord("\u8bb0") : "記", # 记
    ord("\u8bb2") : "講", # 讲
    ord("\u8bb3") : "諱", # 讳
    ord("\u8bb4") : "謳", # 讴
    ord("\u8bb5") : "詎", # 讵
    ord("\u8bb6") : "訝", # 讶
    ord("\u8bb7") : "訥", # 讷
    ord("\u8bb8") : "許", # 许
    ord("\u8bb9") : "訛", # 讹
    ord("\u8bba") : "論", # 论
    ord("\u8bbc") : "訟", # 讼
    ord("\u8bbd") : "諷", # 讽
    ord("\u8bbf") : "訪", # 访
    ord("\u8bc0") : "訣", # 诀
    ord("\u8bc1") : "證", # 证
    ord("\u8bc2") : "詁", # 诂
    ord("\u8bc3") : "訶", # 诃
    ord("\u8bc4") : "評", # 评
    ord("\u8bc5") : "詛", # 诅
    ord("\u8bc6") : "識", # 识
    ord("\u8bc8") : "詐", # 诈
    ord("\u8bc9") : "訴", # 诉
    ord("\u8bca") : "診", # 诊
    ord("\u8bcb") : "詆", # 诋
    ord("\u8bcc") : "謅", # 诌
    ord("\u8bcd") : "詞", # 词
    ord("\u8bce") : "詘", # 诎
    ord("\u8bcf") : "詔", # 诏
    ord("\u8bd1") : "譯", # 译
    ord("\u8bd2") : "詒", # 诒
    ord("\u8bd3") : "誆", # 诓
    ord("\u8bd4") : "誄", # 诔
    ord("\u8bd5") : "試", # 试
    ord("\u8bd6") : "詿", # 诖
    ord("\u8bd7") : "詩", # 诗
    ord("\u8bd8") : "詰", # 诘
    ord("\u8bd9") : "詼", # 诙
    ord("\u8bda") : "誠", # 诚
    ord("\u8bdb") : "誅", # 诛
    ord("\u8bdc") : "詵", # 诜
    ord("\u8bdd") : "話", # 话
    ord("\u8bde") : "誕", # 诞
    ord("\u8bdf") : "詬", # 诟
    ord("\u8be0") : "詮", # 诠
    ord("\u8be1") : "詭", # 诡
    ord("\u8be3") : "詣", # 诣
    ord("\u8be4") : "諍", # 诤
    ord("\u8be5") : "該", # 该
    ord("\u8be6") : "詳", # 详
    ord("\u8be7") : "詫", # 诧
    ord("\u8be8") : "諢", # 诨
    ord("\u8be9") : "詡", # 诩
    ord("\u8beb") : "誡", # 诫
    ord("\u8bec") : "誣", # 诬
    ord("\u8bed") : "語", # 语
    ord("\u8bee") : "誚", # 诮
    ord("\u8bef") : "誤", # 误
    ord("\u8bf0") : "誥", # 诰
    ord("\u8bf1") : "誘", # 诱
    ord("\u8bf2") : "誨", # 诲
    ord("\u8bf3") : "誑", # 诳
    ord("\u8bf4") : "說", # 说
    ord("\u8bf5") : "誦", # 诵
    ord("\u8bf6") : "誒", # 诶
    ord("\u8bf7") : "請", # 请
    ord("\u8bf8") : "諸", # 诸
    ord("\u8bf9") : "諏", # 诹
    ord("\u8bfa") : "諾", # 诺
    ord("\u8bfb") : "讀", # 读
    ord("\u8bfc") : "諑", # 诼
    ord("\u8bfd") : "誹", # 诽
    ord("\u8bfe") : "課", # 课
    ord("\u8bff") : "諉", # 诿
    ord("\u8c00") : "諛", # 谀
    ord("\u8c01") : "誰", # 谁
    ord("\u8c02") : "諗", # 谂
    ord("\u8c03") : "調", # 调
    ord("\u8c04") : "諂", # 谄
    ord("\u8c05") : "諒", # 谅
    ord("\u8c06") : "諄", # 谆
    ord("\u8c07") : "誶", # 谇
    ord("\u8c08") : "談", # 谈
    ord("\u8c0a") : "誼", # 谊
    ord("\u8c0b") : "謀", # 谋
    ord("\u8c0c") : "諶", # 谌
    ord("\u8c0d") : "諜", # 谍
    ord("\u8c0e") : "謊", # 谎
    ord("\u8c0f") : "諫", # 谏
    ord("\u8c10") : "諧", # 谐
    ord("\u8c11") : "謔", # 谑
    ord("\u8c12") : "謁", # 谒
    ord("\u8c13") : "謂", # 谓
    ord("\u8c14") : "諤", # 谔
    ord("\u8c15") : "諭", # 谕
    ord("\u8c16") : "諼", # 谖
    ord("\u8c17") : "讒", # 谗
    ord("\u8c18") : "諮", # 谘
    ord("\u8c19") : "諳", # 谙
    ord("\u8c1a") : "諺", # 谚
    ord("\u8c1b") : "諦", # 谛
    ord("\u8c1c") : "謎", # 谜
    ord("\u8c1d") : "諞", # 谝
    ord("\u8c1f") : "謨", # 谟
    ord("\u8c20") : "讜", # 谠
    ord("\u8c21") : "謖", # 谡
    ord("\u8c22") : "謝", # 谢
    ord("\u8c23") : "謠", # 谣
    ord("\u8c24") : "謗", # 谤
    ord("\u8c25") : "謚", # 谥
    ord("\u8c26") : "謙", # 谦
    ord("\u8c27") : "謐", # 谧
    ord("\u8c28") : "謹", # 谨
    ord("\u8c29") : "謾", # 谩
    ord("\u8c2a") : "謫", # 谪
    ord("\u8c2b") : "譾", # 谫
    ord("\u8c2c") : "謬", # 谬
    ord("\u8c2d") : "譚", # 谭
    ord("\u8c2e") : "譖", # 谮
    ord("\u8c2f") : "譙", # 谯
    ord("\u8c30") : "讕", # 谰
    ord("\u8c31") : "譜", # 谱
    ord("\u8c32") : "譎", # 谲
    ord("\u8c33") : "讞", # 谳
    ord("\u8c34") : "譴", # 谴
    ord("\u8c35") : "譫", # 谵
    ord("\u8c36") : "讖", # 谶
    ord("\u8d1e") : "貞", # 贞
    ord("\u8d1f") : "負", # 负
    ord("\u8d21") : "貢", # 贡
    ord("\u8d22") : "財", # 财
    ord("\u8d23") : "責", # 责
    ord("\u8d24") : "賢", # 贤
    ord("\u8d25") : "敗", # 败
    ord("\u8d26") : "賬", # 账
    ord("\u8d27") : "貨", # 货
    ord("\u8d28") : "質", # 质
    ord("\u8d29") : "販", # 贩
    ord("\u8d2a") : "貪", # 贪
    ord("\u8d2b") : "貧", # 贫
    ord("\u8d2c") : "貶", # 贬
    ord("\u8d2d") : "購", # 购
    ord("\u8d2e") : "貯", # 贮
    ord("\u8d2f") : "貫", # 贯
    ord("\u8d30") : "貳", # 贰
    ord("\u8d31") : "賤", # 贱
    ord("\u8d32") : "賁", # 贲
    ord("\u8d33") : "貰", # 贳
    ord("\u8d34") : "貼", # 贴
    ord("\u8d35") : "貴", # 贵
    ord("\u8d36") : "貺", # 贶
    ord("\u8d37") : "貸", # 贷
    ord("\u8d38") : "貿", # 贸
    ord("\u8d39") : "費", # 费
    ord("\u8d3a") : "賀", # 贺
    ord("\u8d3b") : "貽", # 贻
    ord("\u8d3c") : "賊", # 贼
    ord("\u8d3d") : "贄", # 贽
    ord("\u8d3e") : "賈", # 贾
    ord("\u8d3f") : "賄", # 贿
    ord("\u8d40") : "貲", # 赀
    ord("\u8d41") : "賃", # 赁
    ord("\u8d42") : "賂", # 赂
    ord("\u8d43") : "贓", # 赃
    ord("\u8d44") : "資", # 资
    ord("\u8d45") : "賅", # 赅
    ord("\u8d46") : "贐", # 赆
    ord("\u8d47") : "賕", # 赇
    ord("\u8d48") : "賑", # 赈
    ord("\u8d49") : "賚", # 赉
    ord("\u8d4a") : "賒", # 赊
    ord("\u8d4b") : "賦", # 赋
    ord("\u8d4c") : "賭", # 赌
    ord("\u8d4d") : "賫", # 赍
    ord("\u8d4e") : "贖", # 赎
    ord("\u8d4f") : "賞", # 赏
    ord("\u8d50") : "賜", # 赐
    ord("\u8d53") : "賡", # 赓
    ord("\u8d54") : "賠", # 赔
    ord("\u8d55") : "賧", # 赕
    ord("\u8d56") : "賴", # 赖
    ord("\u8d58") : "贅", # 赘
    ord("\u8d59") : "賻", # 赙
    ord("\u8d5a") : "賺", # 赚
    ord("\u8d5b") : "賽", # 赛
    ord("\u8d5c") : "賾", # 赜
    ord("\u8d5d") : "贗", # 赝
    ord("\u8d5e") : "贊", # 赞
    ord("\u8d60") : "贈", # 赠
    ord("\u8d61") : "贍", # 赡
    ord("\u8d62") : "贏", # 赢
    ord("\u8d63") : "贛", # 赣
    ord("\u8d75") : "趙", # 赵
    ord("\u8d8b") : "趨", # 趋
    ord("\u8db1") : "趲", # 趱
    ord("\u8db8") : "躉", # 趸
    ord("\u8dc4") : "蹌", # 跄
    ord("\u8dde") : "躒", # 跞
    ord("\u8df5") : "踐", # 践
    ord("\u8df7") : "蹺", # 跷
    ord("\u8df8") : "蹕", # 跸
    ord("\u8df9") : "躚", # 跹
    ord("\u8dfb") : "躋", # 跻
    ord("\u8e0c") : "躊", # 踌
    ord("\u8e2c") : "躓", # 踬
    ord("\u8e2f") : "躑", # 踯
    ord("\u8e51") : "躡", # 蹑
    ord("\u8e52") : "蹣", # 蹒
    ord("\u8e70") : "躕", # 蹰
    ord("\u8e7f") : "躥", # 蹿
    ord("\u8e8f") : "躪", # 躏
    ord("\u8e9c") : "躦", # 躜
    ord("\u8eaf") : "軀", # 躯
    ord("\u8f68") : "軌", # 轨
    ord("\u8f69") : "軒", # 轩
    ord("\u8f6b") : "軔", # 轫
    ord("\u8f6c") : "轉", # 转
    ord("\u8f6d") : "軛", # 轭
    ord("\u8f6f") : "軟", # 软
    ord("\u8f70") : "轟", # 轰
    ord("\u8f71") : "軲", # 轱
    ord("\u8f72") : "軻", # 轲
    ord("\u8f73") : "轤", # 轳
    ord("\u8f74") : "軸", # 轴
    ord("\u8f75") : "軹", # 轵
    ord("\u8f76") : "軼", # 轶
    ord("\u8f77") : "軤", # 轷
    ord("\u8f78") : "軫", # 轸
    ord("\u8f79") : "轢", # 轹
    ord("\u8f7a") : "軺", # 轺
    ord("\u8f7b") : "輕", # 轻
    ord("\u8f7c") : "軾", # 轼
    ord("\u8f7d") : "載", # 载
    ord("\u8f7e") : "輊", # 轾
    ord("\u8f7f") : "轎", # 轿
    ord("\u8f81") : "輇", # 辁
    ord("\u8f82") : "輅", # 辂
    ord("\u8f83") : "較", # 较
    ord("\u8f84") : "輒", # 辄
    ord("\u8f85") : "輔", # 辅
    ord("\u8f86") : "輛", # 辆
    ord("\u8f87") : "輦", # 辇
    ord("\u8f88") : "輩", # 辈
    ord("\u8f89") : "輝", # 辉
    ord("\u8f8a") : "輥", # 辊
    ord("\u8f8b") : "輞", # 辋
    ord("\u8f8d") : "輟", # 辍
    ord("\u8f8e") : "輜", # 辎
    ord("\u8f8f") : "輳", # 辏
    ord("\u8f90") : "輻", # 辐
    ord("\u8f91") : "輯", # 辑
    ord("\u8f94") : "轡", # 辔
    ord("\u8f95") : "轅", # 辕
    ord("\u8f96") : "轄", # 辖
    ord("\u8f97") : "輾", # 辗
    ord("\u8f98") : "轆", # 辘
    ord("\u8f99") : "轍", # 辙
    ord("\u8f9a") : "轔", # 辚
    ord("\u8f9e") : "辭", # 辞
    ord("\u8fa9") : "辯", # 辩
    ord("\u8fab") : "辮", # 辫
    ord("\u8fbd") : "遼", # 辽
    ord("\u8fc7") : "過", # 过
    ord("\u8fc8") : "邁", # 迈
    ord("\u8fd8") : "還", # 还
    ord("\u8fd9") : "這", # 这
    ord("\u8fdb") : "進", # 进
    ord("\u8fdc") : "遠", # 远
    ord("\u8fdd") : "違", # 违
    ord("\u8fde") : "連", # 连
    ord("\u8fdf") : "遲", # 迟
    ord("\u8fe9") : "邇", # 迩
    ord("\u8ff3") : "逕", # 迳
    ord("\u9009") : "選", # 选
    ord("\u900a") : "遜", # 逊
    ord("\u9026") : "邐", # 逦
    ord("\u903b") : "邏", # 逻
    ord("\u9057") : "遺", # 遗
    ord("\u9065") : "遙", # 遥
    ord("\u9093") : "鄧", # 邓
    ord("\u909d") : "鄺", # 邝
    ord("\u90ac") : "鄔", # 邬
    ord("\u90b9") : "鄒", # 邹
    ord("\u90ba") : "鄴", # 邺
    ord("\u90cf") : "郟", # 郏
    ord("\u90d0") : "鄶", # 郐
    ord("\u90d1") : "鄭", # 郑
    ord("\u90d3") : "鄆", # 郓
    ord("\u90e6") : "酈", # 郦
    ord("\u90e7") : "鄖", # 郧
    ord("\u90f8") : "鄲", # 郸
    ord("\u915d") : "醞", # 酝
    ord("\u9171") : "醬", # 酱
    ord("\u917d") : "釅", # 酽
    ord("\u917e") : "釃", # 酾
    ord("\u917f") : "釀", # 酿
    ord("\u91ca") : "釋", # 释
    ord("\u9274") : "鑒", # 鉴
    ord("\u933e") : "鏨", # 錾
    ord("\u9486") : "釓", # 钆
    ord("\u9487") : "釔", # 钇
    ord("\u9488") : "針", # 针
    ord("\u9489") : "釘", # 钉
    ord("\u948a") : "釗", # 钊
    ord("\u948b") : "釙", # 钋
    ord("\u948c") : "釕", # 钌
    ord("\u948d") : "釷", # 钍
    ord("\u948e") : "釬", # 钎
    ord("\u948f") : "釧", # 钏
    ord("\u9490") : "釤", # 钐
    ord("\u9492") : "釩", # 钒
    ord("\u9493") : "釣", # 钓
    ord("\u9494") : "鍆", # 钔
    ord("\u9495") : "釹", # 钕
    ord("\u9497") : "釵", # 钗
    ord("\u9499") : "鈣", # 钙
    ord("\u949a") : "鈈", # 钚
    ord("\u949b") : "鈦", # 钛
    ord("\u949c") : "鉅", # 钜
    ord("\u949d") : "鈍", # 钝
    ord("\u949e") : "鈔", # 钞
    ord("\u94a0") : "鈉", # 钠
    ord("\u94a1") : "鋇", # 钡
    ord("\u94a3") : "鈑", # 钣
    ord("\u94a4") : "鈐", # 钤
    ord("\u94a5") : "鑰", # 钥
    ord("\u94a6") : "欽", # 钦
    ord("\u94a7") : "鈞", # 钧
    ord("\u94a8") : "鎢", # 钨
    ord("\u94a9") : "鉤", # 钩
    ord("\u94aa") : "鈧", # 钪
    ord("\u94ab") : "鈁", # 钫
    ord("\u94ac") : "鈥", # 钬
    ord("\u94ad") : "鈄", # 钭
    ord("\u94ae") : "鈕", # 钮
    ord("\u94af") : "鈀", # 钯
    ord("\u94b0") : "鈺", # 钰
    ord("\u94b1") : "錢", # 钱
    ord("\u94b2") : "鉦", # 钲
    ord("\u94b3") : "鉗", # 钳
    ord("\u94b4") : "鈷", # 钴
    ord("\u94b5") : "缽", # 钵
    ord("\u94b6") : "鈳", # 钶
    ord("\u94b7") : "鉕", # 钷
    ord("\u94b8") : "鈽", # 钸
    ord("\u94b9") : "鈸", # 钹
    ord("\u94ba") : "鉞", # 钺
    ord("\u94bb") : "鉆", # 钻
    ord("\u94bc") : "鉬", # 钼
    ord("\u94bd") : "鉭", # 钽
    ord("\u94be") : "鉀", # 钾
    ord("\u94bf") : "鈿", # 钿
    ord("\u94c0") : "鈾", # 铀
    ord("\u94c2") : "鉑", # 铂
    ord("\u94c4") : "鑠", # 铄
    ord("\u94c5") : "鉛", # 铅
    ord("\u94c6") : "鉚", # 铆
    ord("\u94c8") : "鈰", # 铈
    ord("\u94c9") : "鉉", # 铉
    ord("\u94ca") : "鉈", # 铊
    ord("\u94cb") : "鉍", # 铋
    ord("\u94cc") : "鈮", # 铌
    ord("\u94cd") : "鈹", # 铍
    ord("\u94ce") : "鐸", # 铎
    ord("\u94d0") : "銬", # 铐
    ord("\u94d1") : "銠", # 铑
    ord("\u94d2") : "鉺", # 铒
    ord("\u94d5") : "銪", # 铕
    ord("\u94d6") : "鋮", # 铖
    ord("\u94d7") : "鋏", # 铗
    ord("\u94d8") : "鋣", # 铘
    ord("\u94d9") : "鐃", # 铙
    ord("\u94db") : "鐺", # 铛
    ord("\u94dd") : "鋁", # 铝
    ord("\u94de") : "銱", # 铞
    ord("\u94df") : "銦", # 铟
    ord("\u94e0") : "鎧", # 铠
    ord("\u94e1") : "鍘", # 铡
    ord("\u94e2") : "銖", # 铢
    ord("\u94e3") : "銑", # 铣
    ord("\u94e4") : "鋌", # 铤
    ord("\u94e5") : "銩", # 铥
    ord("\u94e7") : "鏵", # 铧
    ord("\u94e8") : "銓", # 铨
    ord("\u94e9") : "鎩", # 铩
    ord("\u94ea") : "鉿", # 铪
    ord("\u94eb") : "銚", # 铫
    ord("\u94ec") : "鉻", # 铬
    ord("\u94ed") : "銘", # 铭
    ord("\u94ee") : "錚", # 铮
    ord("\u94ef") : "銫", # 铯
    ord("\u94f0") : "鉸", # 铰
    ord("\u94f1") : "銥", # 铱
    ord("\u94f2") : "鏟", # 铲
    ord("\u94f3") : "銃", # 铳
    ord("\u94f4") : "鐋", # 铴
    ord("\u94f5") : "銨", # 铵
    ord("\u94f7") : "銣", # 铷
    ord("\u94f8") : "鑄", # 铸
    ord("\u94f9") : "鐒", # 铹
    ord("\u94fa") : "鋪", # 铺
    ord("\u94fc") : "錸", # 铼
    ord("\u94fd") : "鋱", # 铽
    ord("\u94fe") : "鏈", # 链
    ord("\u94ff") : "鏗", # 铿
    ord("\u9500") : "銷", # 销
    ord("\u9501") : "鎖", # 锁
    ord("\u9502") : "鋰", # 锂
    ord("\u9503") : "鋥", # 锃
    ord("\u9504") : "鋤", # 锄
    ord("\u9505") : "鍋", # 锅
    ord("\u9506") : "鋯", # 锆
    ord("\u9507") : "鋨", # 锇
    ord("\u9508") : "銹", # 锈
    ord("\u9509") : "銼", # 锉
    ord("\u950a") : "鋝", # 锊
    ord("\u950b") : "鋒", # 锋
    ord("\u950c") : "鋅", # 锌
    ord("\u950d") : "鋶", # 锍
    ord("\u950e") : "鐦", # 锎
    ord("\u950f") : "鐧", # 锏
    ord("\u9510") : "銳", # 锐
    ord("\u9511") : "銻", # 锑
    ord("\u9512") : "鋃", # 锒
    ord("\u9513") : "鋟", # 锓
    ord("\u9514") : "鋦", # 锔
    ord("\u9515") : "錒", # 锕
    ord("\u9516") : "錆", # 锖
    ord("\u9517") : "鍺", # 锗
    ord("\u9518") : "鍩", # 锘
    ord("\u9519") : "錯", # 错
    ord("\u951a") : "錨", # 锚
    ord("\u951b") : "錛", # 锛
    ord("\u951d") : "鍀", # 锝
    ord("\u951e") : "錁", # 锞
    ord("\u951f") : "錕", # 锟
    ord("\u9521") : "錫", # 锡
    ord("\u9522") : "錮", # 锢
    ord("\u9523") : "鑼", # 锣
    ord("\u9524") : "錘", # 锤
    ord("\u9525") : "錐", # 锥
    ord("\u9526") : "錦", # 锦
    ord("\u9528") : "鍁", # 锨
    ord("\u9529") : "錈", # 锩
    ord("\u952a") : "鍃", # 锪
    ord("\u952b") : "錇", # 锫
    ord("\u952c") : "錟", # 锬
    ord("\u952e") : "鍵", # 键
    ord("\u952f") : "鋸", # 锯
    ord("\u9530") : "錳", # 锰
    ord("\u9531") : "錙", # 锱
    ord("\u9532") : "鍥", # 锲
    ord("\u9534") : "鍇", # 锴
    ord("\u9535") : "鏘", # 锵
    ord("\u9536") : "鍶", # 锶
    ord("\u9537") : "鍔", # 锷
    ord("\u9538") : "鍤", # 锸
    ord("\u9539") : "鍬", # 锹
    ord("\u953a") : "鍾", # 锺
    ord("\u953b") : "鍛", # 锻
    ord("\u953c") : "鎪", # 锼
    ord("\u953e") : "鍰", # 锾
    ord("\u953f") : "鎄", # 锿
    ord("\u9540") : "鍍", # 镀
    ord("\u9541") : "鎂", # 镁
    ord("\u9542") : "鏤", # 镂
    ord("\u9544") : "鐨", # 镄
    ord("\u9545") : "鎇", # 镅
    ord("\u9546") : "鏌", # 镆
    ord("\u9549") : "鎘", # 镉
    ord("\u954a") : "鑷", # 镊
    ord("\u954c") : "鐫", # 镌
    ord("\u954d") : "鎳", # 镍
    ord("\u954e") : "鎿", # 镎
    ord("\u954f") : "鎦", # 镏
    ord("\u9550") : "鎬", # 镐
    ord("\u9551") : "鎊", # 镑
    ord("\u9552") : "鎰", # 镒
    ord("\u9553") : "鎵", # 镓
    ord("\u9554") : "鑌", # 镔
    ord("\u9556") : "鏢", # 镖
    ord("\u9557") : "鏜", # 镗
    ord("\u9558") : "鏝", # 镘
    ord("\u9559") : "鏍", # 镙
    ord("\u955b") : "鏞", # 镛
    ord("\u955c") : "鏡", # 镜
    ord("\u955d") : "鏑", # 镝
    ord("\u955e") : "鏃", # 镞
    ord("\u955f") : "鏇", # 镟
    ord("\u9561") : "鐔", # 镡
    ord("\u9562") : "鐝", # 镢
    ord("\u9563") : "鐐", # 镣
    ord("\u9564") : "鏷", # 镤
    ord("\u9565") : "鑥", # 镥
    ord("\u9566") : "鐓", # 镦
    ord("\u9567") : "鑭", # 镧
    ord("\u9568") : "鐠", # 镨
    ord("\u9569") : "鑹", # 镩
    ord("\u956a") : "鏹", # 镪
    ord("\u956b") : "鐙", # 镫
    ord("\u956c") : "鑊", # 镬
    ord("\u956d") : "鐳", # 镭
    ord("\u956f") : "鐲", # 镯
    ord("\u9570") : "鐮", # 镰
    ord("\u9571") : "鐿", # 镱
    ord("\u9572") : "鑔", # 镲
    ord("\u9573") : "鑣", # 镳
    ord("\u9576") : "鑲", # 镶
    ord("\u95e9") : "閂", # 闩
    ord("\u95ea") : "閃", # 闪
    ord("\u95eb") : "閆", # 闫
    ord("\u95ed") : "閉", # 闭
    ord("\u95ee") : "問", # 问
    ord("\u95ef") : "闖", # 闯
    ord("\u95f0") : "閏", # 闰
    ord("\u95f1") : "闈", # 闱
    ord("\u95f2") : "閑", # 闲
    ord("\u95f3") : "閎", # 闳
    ord("\u95f5") : "閔", # 闵
    ord("\u95f6") : "閌", # 闶
    ord("\u95f7") : "悶", # 闷
    ord("\u95f8") : "閘", # 闸
    ord("\u95f9") : "鬧", # 闹
    ord("\u95fa") : "閨", # 闺
    ord("\u95fb") : "聞", # 闻
    ord("\u95fc") : "闥", # 闼
    ord("\u95fd") : "閩", # 闽
    ord("\u95fe") : "閭", # 闾
    ord("\u9600") : "閥", # 阀
    ord("\u9601") : "閣", # 阁
    ord("\u9602") : "閡", # 阂
    ord("\u9603") : "閫", # 阃
    ord("\u9604") : "鬮", # 阄
    ord("\u9605") : "閱", # 阅
    ord("\u9606") : "閬", # 阆
    ord("\u9608") : "閾", # 阈
    ord("\u9609") : "閹", # 阉
    ord("\u960a") : "閶", # 阊
    ord("\u960b") : "鬩", # 阋
    ord("\u960c") : "閿", # 阌
    ord("\u960d") : "閽", # 阍
    ord("\u960e") : "閻", # 阎
    ord("\u960f") : "閼", # 阏
    ord("\u9610") : "闡", # 阐
    ord("\u9611") : "闌", # 阑
    ord("\u9612") : "闃", # 阒
    ord("\u9614") : "闊", # 阔
    ord("\u9615") : "闋", # 阕
    ord("\u9616") : "闔", # 阖
    ord("\u9617") : "闐", # 阗
    ord("\u9619") : "闕", # 阙
    ord("\u961a") : "闞", # 阚
    ord("\u961f") : "隊", # 队
    ord("\u9634") : "陰", # 阴
    ord("\u9635") : "陣", # 阵
    ord("\u9636") : "階", # 阶
    ord("\u9646") : "陸", # 陆
    ord("\u9647") : "隴", # 陇
    ord("\u9648") : "陳", # 陈
    ord("\u9649") : "陘", # 陉
    ord("\u9655") : "陜", # 陕
    ord("\u9667") : "隉", # 陧
    ord("\u9668") : "隕", # 陨
    ord("\u9690") : "隱", # 隐
    ord("\u96be") : "難", # 难
    ord("\u96cf") : "雛", # 雏
    ord("\u96e0") : "讎", # 雠
    ord("\u96f3") : "靂", # 雳
    ord("\u96fe") : "霧", # 雾
    ord("\u9701") : "霽", # 霁
    ord("\u972d") : "靄", # 霭
    ord("\u9753") : "靚", # 靓
    ord("\u9759") : "靜", # 静
    ord("\u9765") : "靨", # 靥
    ord("\u9791") : "韃", # 鞑
    ord("\u9792") : "鞽", # 鞒
    ord("\u97af") : "韉", # 鞯
    ord("\u97e7") : "韌", # 韧
    ord("\u97e9") : "韓", # 韩
    ord("\u97ea") : "韙", # 韪
    ord("\u97eb") : "韞", # 韫
    ord("\u97ec") : "韜", # 韬
    ord("\u9876") : "頂", # 顶
    ord("\u9877") : "頃", # 顷
    ord("\u9878") : "頇", # 顸
    ord("\u9879") : "項", # 项
    ord("\u987a") : "順", # 顺
    ord("\u987b") : "須", # 须
    ord("\u987c") : "頊", # 顼
    ord("\u987d") : "頑", # 顽
    ord("\u987e") : "顧", # 顾
    ord("\u987f") : "頓", # 顿
    ord("\u9880") : "頎", # 颀
    ord("\u9881") : "頒", # 颁
    ord("\u9882") : "頌", # 颂
    ord("\u9883") : "頏", # 颃
    ord("\u9884") : "預", # 预
    ord("\u9885") : "顱", # 颅
    ord("\u9886") : "領", # 领
    ord("\u9887") : "頗", # 颇
    ord("\u9888") : "頸", # 颈
    ord("\u9889") : "頡", # 颉
    ord("\u988a") : "頰", # 颊
    ord("\u988c") : "頜", # 颌
    ord("\u988d") : "潁", # 颍
    ord("\u988f") : "頦", # 颏
    ord("\u9890") : "頤", # 颐
    ord("\u9891") : "頻", # 频
    ord("\u9893") : "頹", # 颓
    ord("\u9894") : "頷", # 颔
    ord("\u9896") : "穎", # 颖
    ord("\u9897") : "顆", # 颗
    ord("\u9898") : "題", # 题
    ord("\u989a") : "顎", # 颚
    ord("\u989b") : "顓", # 颛
    ord("\u989c") : "顏", # 颜
    ord("\u989d") : "額", # 额
    ord("\u989e") : "顳", # 颞
    ord("\u989f") : "顢", # 颟
    ord("\u98a0") : "顛", # 颠
    ord("\u98a1") : "顙", # 颡
    ord("\u98a2") : "顥", # 颢
    ord("\u98a4") : "顫", # 颤
    ord("\u98a5") : "顬", # 颥
    ord("\u98a6") : "顰", # 颦
    ord("\u98a7") : "顴", # 颧
    ord("\u98d1") : "颮", # 飑
    ord("\u98d2") : "颯", # 飒
    ord("\u98d3") : "颶", # 飓
    ord("\u98d5") : "颼", # 飕
    ord("\u98d8") : "飄", # 飘
    ord("\u98d9") : "飆", # 飙
    ord("\u98da") : "飈", # 飚
    ord("\u98e8") : "饗", # 飨
    ord("\u990d") : "饜", # 餍
    ord("\u9965") : "饑", # 饥
    ord("\u9967") : "餳", # 饧
    ord("\u9968") : "飩", # 饨
    ord("\u9969") : "餼", # 饩
    ord("\u996a") : "飪", # 饪
    ord("\u996b") : "飫", # 饫
    ord("\u996c") : "飭", # 饬
    ord("\u996d") : "飯", # 饭
    ord("\u996e") : "飲", # 饮
    ord("\u996f") : "餞", # 饯
    ord("\u9970") : "飾", # 饰
    ord("\u9971") : "飽", # 饱
    ord("\u9972") : "飼", # 饲
    ord("\u9974") : "飴", # 饴
    ord("\u9975") : "餌", # 饵
    ord("\u9976") : "饒", # 饶
    ord("\u9977") : "餉", # 饷
    ord("\u997a") : "餃", # 饺
    ord("\u997c") : "餅", # 饼
    ord("\u997d") : "餑", # 饽
    ord("\u997f") : "餓", # 饿
    ord("\u9980") : "餘", # 馀
    ord("\u9981") : "餒", # 馁
    ord("\u9984") : "餛", # 馄
    ord("\u9985") : "餡", # 馅
    ord("\u9986") : "館", # 馆
    ord("\u9987") : "餷", # 馇
    ord("\u9988") : "饋", # 馈
    ord("\u998a") : "餿", # 馊
    ord("\u998b") : "饞", # 馋
    ord("\u998d") : "饃", # 馍
    ord("\u998f") : "餾", # 馏
    ord("\u9990") : "饈", # 馐
    ord("\u9991") : "饉", # 馑
    ord("\u9992") : "饅", # 馒
    ord("\u9993") : "饊", # 馓
    ord("\u9994") : "饌", # 馔
    ord("\u9995") : "饢", # 馕
    ord("\u9a6c") : "馬", # 马
    ord("\u9a6d") : "馭", # 驭
    ord("\u9a6e") : "馱", # 驮
    ord("\u9a6f") : "馴", # 驯
    ord("\u9a70") : "馳", # 驰
    ord("\u9a71") : "驅", # 驱
    ord("\u9a73") : "駁", # 驳
    ord("\u9a74") : "驢", # 驴
    ord("\u9a75") : "駔", # 驵
    ord("\u9a76") : "駛", # 驶
    ord("\u9a77") : "駟", # 驷
    ord("\u9a78") : "駙", # 驸
    ord("\u9a79") : "駒", # 驹
    ord("\u9a7a") : "騶", # 驺
    ord("\u9a7b") : "駐", # 驻
    ord("\u9a7c") : "駝", # 驼
    ord("\u9a7d") : "駑", # 驽
    ord("\u9a7e") : "駕", # 驾
    ord("\u9a7f") : "驛", # 驿
    ord("\u9a80") : "駘", # 骀
    ord("\u9a81") : "驍", # 骁
    ord("\u9a82") : "罵", # 骂
    ord("\u9a84") : "驕", # 骄
    ord("\u9a85") : "驊", # 骅
    ord("\u9a86") : "駱", # 骆
    ord("\u9a87") : "駭", # 骇
    ord("\u9a88") : "駢", # 骈
    ord("\u9a8a") : "驪", # 骊
    ord("\u9a8b") : "騁", # 骋
    ord("\u9a8c") : "驗", # 验
    ord("\u9a90") : "騏", # 骐
    ord("\u9a91") : "騎", # 骑
    ord("\u9a92") : "騍", # 骒
    ord("\u9a93") : "騅", # 骓
    ord("\u9a96") : "驂", # 骖
    ord("\u9a97") : "騙", # 骗
    ord("\u9a98") : "騭", # 骘
    ord("\u9a9a") : "騷", # 骚
    ord("\u9a9b") : "騖", # 骛
    ord("\u9a9c") : "驁", # 骜
    ord("\u9a9d") : "騮", # 骝
    ord("\u9a9e") : "騫", # 骞
    ord("\u9a9f") : "騸", # 骟
    ord("\u9aa0") : "驃", # 骠
    ord("\u9aa1") : "騾", # 骡
    ord("\u9aa2") : "驄", # 骢
    ord("\u9aa3") : "驏", # 骣
    ord("\u9aa4") : "驟", # 骤
    ord("\u9aa5") : "驥", # 骥
    ord("\u9aa7") : "驤", # 骧
    ord("\u9ac5") : "髏", # 髅
    ord("\u9acb") : "髖", # 髋
    ord("\u9acc") : "髕", # 髌
    ord("\u9b13") : "鬢", # 鬓
    ord("\u9b47") : "魘", # 魇
    ord("\u9b49") : "魎", # 魉
    ord("\u9b84") : "弗", # 鮄
    ord("\u9c7f") : "魷", # 鱿
    ord("\u9c81") : "魯", # 鲁
    ord("\u9c82") : "魴", # 鲂
    ord("\u9c85") : "鮁", # 鲅
    ord("\u9c86") : "鮃", # 鲆
    ord("\u9c87") : "鮎", # 鲇
    ord("\u9c88") : "鱸", # 鲈
    ord("\u9c8b") : "鮒", # 鲋
    ord("\u9c8d") : "鮑", # 鲍
    ord("\u9c8e") : "鱟", # 鲎
    ord("\u9c90") : "鮐", # 鲐
    ord("\u9c91") : "鮭", # 鲑
    ord("\u9c92") : "鮚", # 鲒
    ord("\u9c94") : "鮪", # 鲔
    ord("\u9c95") : "鮞", # 鲕
    ord("\u9c9a") : "鱭", # 鲚
    ord("\u9c9b") : "鮫", # 鲛
    ord("\u9c9c") : "鮮", # 鲜
    ord("\u9c9e") : "鯗", # 鲞
    ord("\u9c9f") : "鱘", # 鲟
    ord("\u9ca0") : "鯁", # 鲠
    ord("\u9ca1") : "鱺", # 鲡
    ord("\u9ca2") : "鰱", # 鲢
    ord("\u9ca3") : "鰹", # 鲣
    ord("\u9ca4") : "鯉", # 鲤
    ord("\u9ca5") : "鰣", # 鲥
    ord("\u9ca6") : "鰷", # 鲦
    ord("\u9ca7") : "鯀", # 鲧
    ord("\u9ca8") : "鯊", # 鲨
    ord("\u9ca9") : "鯇", # 鲩
    ord("\u9cab") : "鯽", # 鲫
    ord("\u9cad") : "鯖", # 鲭
    ord("\u9cae") : "鯪", # 鲮
    ord("\u9cb0") : "鯫", # 鲰
    ord("\u9cb1") : "鯡", # 鲱
    ord("\u9cb2") : "鯤", # 鲲
    ord("\u9cb3") : "鯧", # 鲳
    ord("\u9cb4") : "鯝", # 鲴
    ord("\u9cb5") : "鯢", # 鲵
    ord("\u9cb6") : "鯰", # 鲶
    ord("\u9cb7") : "鯛", # 鲷
    ord("\u9cb8") : "鯨", # 鲸
    ord("\u9cba") : "鯴", # 鲺
    ord("\u9cbb") : "鯔", # 鲻
    ord("\u9cbc") : "鱝", # 鲼
    ord("\u9cbd") : "鰈", # 鲽
    ord("\u9cc3") : "鰓", # 鳃
    ord("\u9cc4") : "鱷", # 鳄
    ord("\u9cc5") : "鰍", # 鳅
    ord("\u9cc6") : "鰒", # 鳆
    ord("\u9cc7") : "鰉", # 鳇
    ord("\u9cca") : "鯿", # 鳊
    ord("\u9ccb") : "鰠", # 鳋
    ord("\u9ccc") : "鰲", # 鳌
    ord("\u9ccd") : "鰭", # 鳍
    ord("\u9cce") : "鰨", # 鳎
    ord("\u9ccf") : "鰥", # 鳏
    ord("\u9cd0") : "鰩", # 鳐
    ord("\u9cd3") : "鰳", # 鳓
    ord("\u9cd4") : "鰾", # 鳔
    ord("\u9cd5") : "鱈", # 鳕
    ord("\u9cd6") : "鱉", # 鳖
    ord("\u9cd7") : "鰻", # 鳗
    ord("\u9cd8") : "鰵", # 鳘
    ord("\u9cd9") : "鱅", # 鳙
    ord("\u9cdc") : "鱖", # 鳜
    ord("\u9cdd") : "鱔", # 鳝
    ord("\u9cde") : "鱗", # 鳞
    ord("\u9cdf") : "鱒", # 鳟
    ord("\u9ce2") : "鱧", # 鳢
    ord("\u9d8f") : "雞", # 鳢
    ord("\u9e20") : "鳩", # 鸠
    ord("\u9e21") : "雞", # 鸡
    ord("\u9e22") : "鳶", # 鸢
    ord("\u9e23") : "鳴", # 鸣
    ord("\u9e25") : "鷗", # 鸥
    ord("\u9e26") : "鴉", # 鸦
    ord("\u9e28") : "鴇", # 鸨
    ord("\u9e29") : "鴆", # 鸩
    ord("\u9e2a") : "鴣", # 鸪
    ord("\u9e2b") : "鶇", # 鸫
    ord("\u9e2c") : "鸕", # 鸬
    ord("\u9e2d") : "鴨", # 鸭
    ord("\u9e2f") : "鴦", # 鸯
    ord("\u9e31") : "鴟", # 鸱
    ord("\u9e32") : "鴝", # 鸲
    ord("\u9e33") : "鴛", # 鸳
    ord("\u9e35") : "鴕", # 鸵
    ord("\u9e36") : "鷥", # 鸶
    ord("\u9e37") : "鷙", # 鸷
    ord("\u9e38") : "鴯", # 鸸
    ord("\u9e39") : "鴰", # 鸹
    ord("\u9e3a") : "鵂", # 鸺
    ord("\u9e3d") : "鴿", # 鸽
    ord("\u9e3e") : "鸞", # 鸾
    ord("\u9e3f") : "鴻", # 鸿
    ord("\u9e41") : "鵓", # 鹁
    ord("\u9e42") : "鸝", # 鹂
    ord("\u9e43") : "鵑", # 鹃
    ord("\u9e44") : "鵠", # 鹄
    ord("\u9e45") : "鵝", # 鹅
    ord("\u9e46") : "鵒", # 鹆
    ord("\u9e47") : "鷴", # 鹇
    ord("\u9e48") : "鵜", # 鹈
    ord("\u9e49") : "鵡", # 鹉
    ord("\u9e4a") : "鵲", # 鹊
    ord("\u9e4b") : "鶓", # 鹋
    ord("\u9e4c") : "鵪", # 鹌
    ord("\u9e4e") : "鵯", # 鹎
    ord("\u9e4f") : "鵬", # 鹏
    ord("\u9e51") : "鶉", # 鹑
    ord("\u9e55") : "鶘", # 鹕
    ord("\u9e57") : "鶚", # 鹗
    ord("\u9e58") : "鶻", # 鹘
    ord("\u9e5a") : "鶿", # 鹚
    ord("\u9e5b") : "鶥", # 鹛
    ord("\u9e5c") : "鶩", # 鹜
    ord("\u9e5e") : "鷂", # 鹞
    ord("\u9e63") : "鶼", # 鹣
    ord("\u9e64") : "鶴", # 鹤
    ord("\u9e66") : "鸚", # 鹦
    ord("\u9e67") : "鷓", # 鹧
    ord("\u9e68") : "鷚", # 鹨
    ord("\u9e69") : "鷯", # 鹩
    ord("\u9e6a") : "鷦", # 鹪
    ord("\u9e6b") : "鷲", # 鹫
    ord("\u9e6c") : "鷸", # 鹬
    ord("\u9e6d") : "鷺", # 鹭
    ord("\u9e70") : "鷹", # 鹰
    ord("\u9e71") : "鸌", # 鹱
    ord("\u9e73") : "鸛", # 鹳
    ord("\u9e7e") : "鹺", # 鹾
    ord("\u9eb8") : "麩", # 麸
    ord("\u9ec9") : "黌", # 黉
    ord("\u9ee9") : "黷", # 黩
    ord("\u9eea") : "黲", # 黪
    ord("\u9f0b") : "黿", # 鼋
    ord("\u9f0d") : "鼉", # 鼍
    ord("\u9f51") : "齏", # 齑
    ord("\u9f80") : "齔", # 龀
    ord("\u9f83") : "齟", # 龃
    ord("\u9f84") : "齡", # 龄
    ord("\u9f85") : "齙", # 龅
    ord("\u9f86") : "齠", # 龆
    ord("\u9f87") : "齜", # 龇
    ord("\u9f88") : "齦", # 龈
    ord("\u9f89") : "齬", # 龉
    ord("\u9f8a") : "齪", # 龊
    ord("\u9f8b") : "齲", # 龋
    ord("\u9f8c") : "齷", # 龌
    ord("\u9f9a") : "龔", # 龚
    ord("\u9f9b") : "龕", # 龛
    ord("\u9f9f") : "龜", # 龟
    
    
    # CJK Compatibility Ideographs -> CJK Unified Ideographs
    # Extracted from http://www.unicode.org/charts/PDF/UF900.pdf
    ord("\uF900") : "\u8C48",    # 豈
    ord("\uF901") : "\u66F4",    # 更
    ord("\uF902") : "\u8ECA",    # 車
    ord("\uF903") : "\u8CC8",    # 賈
    ord("\uF904") : "\u6ED1",    # 滑
    ord("\uF905") : "\u4E32",    # 串
    ord("\uF906") : "\u53E5",    # 句
    ord("\uF907") : "\u9F9C",    # 龜
    ord("\uF908") : "\u9F9C",    # 龜
    ord("\uF909") : "\u5951",    # 契
    ord("\uF90A") : "\u91D1",    # 金
    ord("\uF90B") : "\u5587",    # 喇
    ord("\uF90C") : "\u5948",    # 奈
    ord("\uF90D") : "\u61F6",    # 懶
    ord("\uF90E") : "\u7669",    # 癩
    ord("\uF90F") : "\u7F85",    # 羅
    ord("\uF910") : "\u863F",    # 蘿
    ord("\uF911") : "\u87BA",    # 螺
    ord("\uF912") : "\u88F8",    # 裸
    ord("\uF913") : "\u908F",    # 邏
    ord("\uF914") : "\u6A02",    # 樂
    ord("\uF915") : "\u6D1B",    # 洛
    ord("\uF916") : "\u70D9",    # 烙
    ord("\uF917") : "\u73DE",    # 珞
    ord("\uF918") : "\u843D",    # 落
    ord("\uF919") : "\u916A",    # 酪
    ord("\uF91A") : "\u99F1",    # 駱
    ord("\uF91B") : "\u4E82",    # 亂
    ord("\uF91C") : "\u5375",    # 卵
    ord("\uF91D") : "\u6B04",    # 欄
    ord("\uF91E") : "\u721B",    # 爛
    ord("\uF91F") : "\u862D",    # 蘭
    ord("\uF920") : "\u9E1E",    # 鸞
    ord("\uF921") : "\u5D50",    # 嵐
    ord("\uF922") : "\u6FEB",    # 濫
    ord("\uF923") : "\u85CD",    # 藍
    ord("\uF924") : "\u8964",    # 襤
    ord("\uF925") : "\u62C9",    # 拉
    ord("\uF926") : "\u81D8",    # 臘
    ord("\uF927") : "\u881F",    # 蠟
    ord("\uF928") : "\u5ECA",    # 廊
    ord("\uF929") : "\u6717",    # 朗
    ord("\uF92A") : "\u6D6A",    # 浪
    ord("\uF92B") : "\u72FC",    # 狼
    ord("\uF92C") : "\u90CE",    # 郎
    ord("\uF92D") : "\u4F86",    # 來
    ord("\uF92E") : "\u51B7",    # 冷
    ord("\uF92F") : "\u52DE",    # 勞
    ord("\uF930") : "\u64C4",    # 擄
    ord("\uF931") : "\u6AD3",    # 櫓
    ord("\uF932") : "\u7210",    # 爐
    ord("\uF933") : "\u76E7",    # 盧
    ord("\uF934") : "\u8001",    # 老
    ord("\uF935") : "\u8606",    # 蘆
    ord("\uF936") : "\u865C",    # 虜
    ord("\uF937") : "\u8DEF",    # 路
    ord("\uF938") : "\u9732",    # 露
    ord("\uF939") : "\u9B6F",    # 魯
    ord("\uF93A") : "\u9DFA",    # 鷺
    ord("\uF93B") : "\u788C",    # 碌
    ord("\uF93C") : "\u797F",    # 祿
    ord("\uF93D") : "\u7DA0",    # 綠
    ord("\uF93E") : "\u83C9",    # 菉
    ord("\uF93F") : "\u9304",    # 錄
    ord("\uF940") : "\u9E7F",    # 鹿
    ord("\uF941") : "\u8AD6",    # 論
    ord("\uF942") : "\u58DF",    # 壟
    ord("\uF943") : "\u5F04",    # 弄
    ord("\uF944") : "\u7C60",    # 籠
    ord("\uF945") : "\u807E",    # 聾
    ord("\uF946") : "\u7262",    # 牢
    ord("\uF947") : "\u78CA",    # 磊
    ord("\uF948") : "\u8CC2",    # 賂
    ord("\uF949") : "\u96F7",    # 雷
    ord("\uF94A") : "\u58D8",    # 壘
    ord("\uF94B") : "\u5C62",    # 屢
    ord("\uF94C") : "\u6A13",    # 樓
    ord("\uF94D") : "\u6DDA",    # 淚
    ord("\uF94E") : "\u6F0F",    # 漏
    ord("\uF94F") : "\u7D2F",    # 累
    ord("\uF950") : "\u7E37",    # 縷
    ord("\uF951") : "\u964B",    # 陋
    ord("\uF952") : "\u52D2",    # 勒
    ord("\uF953") : "\u808B",    # 肋
    ord("\uF954") : "\u51DC",    # 凜
    ord("\uF955") : "\u51CC",    # 凌
    ord("\uF956") : "\u7A1C",    # 稜
    ord("\uF957") : "\u7DBE",    # 綾
    ord("\uF958") : "\u83F1",    # 菱
    ord("\uF959") : "\u9675",    # 陵
    ord("\uF95A") : "\u8B80",    # 讀
    ord("\uF95B") : "\u62CF",    # 拏
    ord("\uF95C") : "\u6A02",    # 樂
    ord("\uF95D") : "\u8AFE",    # 諾
    ord("\uF95E") : "\u4E39",    # 丹
    ord("\uF95F") : "\u5BE7",    # 寧
    ord("\uF960") : "\u6012",    # 怒
    ord("\uF961") : "\u7387",    # 率
    ord("\uF962") : "\u7570",    # 異
    ord("\uF963") : "\u5317",    # 北
    ord("\uF964") : "\u78FB",    # 磻
    ord("\uF965") : "\u4FBF",    # 便
    ord("\uF966") : "\u5FA9",    # 復
    ord("\uF967") : "\u4E0D",    # 不
    ord("\uF968") : "\u6CCC",    # 泌
    ord("\uF969") : "\u6578",    # 數
    ord("\uF96A") : "\u7D22",    # 索
    ord("\uF96B") : "\u53C3",    # 參
    ord("\uF96C") : "\u585E",    # 塞
    ord("\uF96D") : "\u7701",    # 省
    ord("\uF96E") : "\u8449",    # 葉
    ord("\uF96F") : "\u8AAA",    # 說
    ord("\uF970") : "\u6BBA",    # 殺
    ord("\uF971") : "\u8FB0",    # 辰
    ord("\uF972") : "\u6C88",    # 沈
    ord("\uF973") : "\u62FE",    # 拾
    ord("\uF974") : "\u82E5",    # 若
    ord("\uF975") : "\u63A0",    # 掠
    ord("\uF976") : "\u7565",    # 略
    ord("\uF977") : "\u4EAE",    # 亮
    ord("\uF978") : "\u5169",    # 兩
    ord("\uF979") : "\u51C9",    # 凉
    ord("\uF97A") : "\u6881",    # 梁
    ord("\uF97B") : "\u7CE7",    # 糧
    ord("\uF97C") : "\u826F",    # 良
    ord("\uF97D") : "\u8AD2",    # 諒
    ord("\uF97E") : "\u91CF",    # 量
    ord("\uF97F") : "\u52F5",    # 勵
    ord("\uF980") : "\u5442",    # 呂
    ord("\uF981") : "\u5973",    # 女
    ord("\uF982") : "\u5EEC",    # 廬
    ord("\uF983") : "\u65C5",    # 旅
    ord("\uF984") : "\u6FFE",    # 濾
    ord("\uF985") : "\u792A",    # 礪
    ord("\uF986") : "\u95AD",    # 閭
    ord("\uF987") : "\u9A6A",    # 驪
    ord("\uF988") : "\u9E97",    # 麗
    ord("\uF989") : "\u9ECE",    # 黎
    ord("\uF98A") : "\u529B",    # 力
    ord("\uF98B") : "\u66C6",    # 曆
    ord("\uF98C") : "\u6B77",    # 歷
    ord("\uF98D") : "\u8F62",    # 轢
    ord("\uF98E") : "\u5E74",    # 年
    ord("\uF98F") : "\u6190",    # 憐
    ord("\uF990") : "\u6200",    # 戀
    ord("\uF991") : "\u649A",    # 撚
    ord("\uF992") : "\u6F23",    # 漣
    ord("\uF993") : "\u7149",    # 煉
    ord("\uF994") : "\u7489",    # 璉
    ord("\uF995") : "\u79CA",    # 秊
    ord("\uF996") : "\u7DF4",    # 練
    ord("\uF997") : "\u806F",    # 聯
    ord("\uF998") : "\u8F26",    # 輦
    ord("\uF999") : "\u84EE",    # 蓮
    ord("\uF99A") : "\u9023",    # 連
    ord("\uF99B") : "\u934A",    # 鍊
    ord("\uF99C") : "\u5217",    # 列
    ord("\uF99D") : "\u52A3",    # 劣
    ord("\uF99E") : "\u54BD",    # 咽
    ord("\uF99F") : "\u70C8",    # 烈
    ord("\uF9A0") : "\u88C2",    # 裂
    ord("\uF9A1") : "\u8AAA",    # 說
    ord("\uF9A2") : "\u5EC9",    # 廉
    ord("\uF9A3") : "\u5FF5",    # 念
    ord("\uF9A4") : "\u637B",    # 捻
    ord("\uF9A5") : "\u6BAE",    # 殮
    ord("\uF9A6") : "\u7C3E",    # 簾
    ord("\uF9A7") : "\u7375",    # 獵
    ord("\uF9A8") : "\u4EE4",    # 令
    ord("\uF9A9") : "\u56F9",    # 囹
    ord("\uF9AA") : "\u5BE7",    # 寧
    ord("\uF9AB") : "\u5DBA",    # 嶺
    ord("\uF9AC") : "\u601C",    # 怜
    ord("\uF9AD") : "\u73B2",    # 玲
    ord("\uF9AE") : "\u7469",    # 瑩
    ord("\uF9AF") : "\u7F9A",    # 羚
    ord("\uF9B0") : "\u8046",    # 聆
    ord("\uF9B1") : "\u9234",    # 鈴
    ord("\uF9B2") : "\u96F6",    # 零
    ord("\uF9B3") : "\u9748",    # 靈
    ord("\uF9B4") : "\u9818",    # 領
    ord("\uF9B5") : "\u4F8B",    # 例
    ord("\uF9B6") : "\u79AE",    # 禮
    ord("\uF9B7") : "\u91B4",    # 醴
    ord("\uF9B8") : "\u96B8",    # 隸
    ord("\uF9B9") : "\u60E1",    # 惡
    ord("\uF9BA") : "\u4E86",    # 了
    ord("\uF9BB") : "\u50DA",    # 僚
    ord("\uF9BC") : "\u5BEE",    # 寮
    ord("\uF9BD") : "\u5C3F",    # 尿
    ord("\uF9BE") : "\u6599",    # 料
    ord("\uF9BF") : "\u6A02",    # 樂
    ord("\uF9C0") : "\u71CE",    # 燎
    ord("\uF9C1") : "\u7642",    # 療
    ord("\uF9C2") : "\u84FC",    # 蓼
    ord("\uF9C3") : "\u907C",    # 遼
    ord("\uF9C4") : "\u9F8D",    # 龍
    ord("\uF9C5") : "\u6688",    # 暈
    ord("\uF9C6") : "\u962E",    # 阮
    ord("\uF9C7") : "\u5289",    # 劉
    ord("\uF9C8") : "\u677B",    # 杻
    ord("\uF9C9") : "\u67F3",    # 柳
    ord("\uF9CA") : "\u6D41",    # 流
    ord("\uF9CB") : "\u6E9C",    # 溜
    ord("\uF9CC") : "\u7409",    # 琉
    ord("\uF9CD") : "\u7559",    # 留
    ord("\uF9CE") : "\u786B",    # 硫
    ord("\uF9CF") : "\u7D10",    # 紐
    ord("\uF9D0") : "\u985E",    # 類
    ord("\uF9D1") : "\u516D",    # 六
    ord("\uF9D2") : "\u622E",    # 戮
    ord("\uF9D3") : "\u9678",    # 陸
    ord("\uF9D4") : "\u502B",    # 倫
    ord("\uF9D5") : "\u5D19",    # 崙
    ord("\uF9D6") : "\u6DEA",    # 淪
    ord("\uF9D7") : "\u8F2A",    # 輪
    ord("\uF9D8") : "\u5F8B",    # 律
    ord("\uF9D9") : "\u6144",    # 慄
    ord("\uF9DA") : "\u6817",    # 栗
    ord("\uF9DB") : "\u7387",    # 率
    ord("\uF9DC") : "\u9686",    # 隆
    ord("\uF9DD") : "\u5229",    # 利
    ord("\uF9DE") : "\u540F",    # 吏
    ord("\uF9DF") : "\u5C65",    # 履
    ord("\uF9E0") : "\u6613",    # 易
    ord("\uF9E1") : "\u674E",    # 李
    ord("\uF9E2") : "\u68A8",    # 梨
    ord("\uF9E3") : "\u6CE5",    # 泥
    ord("\uF9E4") : "\u7406",    # 理
    ord("\uF9E5") : "\u75E2",    # 痢
    ord("\uF9E6") : "\u7F79",    # 罹
    ord("\uF9E7") : "\u88CF",    # 裏
    ord("\uF9E8") : "\u88E1",    # 裡
    ord("\uF9E9") : "\u91CC",    # 里
    ord("\uF9EA") : "\u96E2",    # 離
    ord("\uF9EB") : "\u533F",    # 匿
    ord("\uF9EC") : "\u6EBA",    # 溺
    ord("\uF9ED") : "\u541D",    # 吝
    ord("\uF9EE") : "\u71D0",    # 燐
    ord("\uF9EF") : "\u7498",    # 璘
    ord("\uF9F0") : "\u85FA",    # 藺
    ord("\uF9F1") : "\u96A3",    # 隣
    ord("\uF9F2") : "\u9C57",    # 鱗
    ord("\uF9F3") : "\u9E9F",    # 麟
    ord("\uF9F4") : "\u6797",    # 林
    ord("\uF9F5") : "\u6DCB",    # 淋
    ord("\uF9F6") : "\u81E8",    # 臨
    ord("\uF9F7") : "\u7ACB",    # 立
    ord("\uF9F8") : "\u7B20",    # 笠
    ord("\uF9F9") : "\u7C92",    # 粒
    ord("\uF9FA") : "\u72C0",    # 狀
    ord("\uF9FB") : "\u7099",    # 炙
    ord("\uF9FC") : "\u8B58",    # 識
    ord("\uF9FD") : "\u4EC0",    # 什
    ord("\uF9FE") : "\u8336",    # 茶
    ord("\uF9FF") : "\u523A",    # 刺
    ord("\uFA00") : "\u5207",    # 切
    ord("\uFA01") : "\u5EA6",    # 度
    ord("\uFA02") : "\u62D3",    # 拓
    ord("\uFA03") : "\u7CD6",    # 糖
    ord("\uFA04") : "\u5B85",    # 宅
    ord("\uFA05") : "\u6D1E",    # 洞
    ord("\uFA06") : "\u66B4",    # 暴
    ord("\uFA07") : "\u8F3B",    # 輻
    ord("\uFA08") : "\u884C",    # 行
    ord("\uFA09") : "\u964D",    # 降
    ord("\uFA0A") : "\u898B",    # 見
    ord("\uFA0B") : "\u5ED3",    # 廓
    ord("\uFA0C") : "\u5140",    # 兀
    ord("\uFA0D") : "\u55C0",    # 嗀
#FA0E 
#FA0F 﨏
    ord("\uFA10") : "\u585A",    # 塚
#FA11 﨑
    ord("\uFA12") : "\u6674",    # 晴
#FA13 﨓
#FA14 﨔
    ord("\uFA15") : "\u51DE",    # 凞
    ord("\uFA16") : "\u732A",    # 猪
    ord("\uFA17") : "\u76CA",    # 益
    ord("\uFA18") : "\u793C",    # 礼
    ord("\uFA19") : "\u795E",    # 神
    ord("\uFA1A") : "\u7965",    # 祥
    ord("\uFA1B") : "\u798F",    # 福
    ord("\uFA1C") : "\u9756",    # 靖
    ord("\uFA1D") : "\u7CBE",    # 精
    ord("\uFA1E") : "\u7FBD",    # 羽
#FA1F 﨟
    ord("\uFA20") : "\u8612",    # 蘒
#FA21 﨡
    ord("\uFA22") : "\u8AF8",    # 諸
#FA23 﨣
#FA24 﨤
    ord("\uFA25") : "\u9038",    # 逸
    ord("\uFA26") : "\u90FD",    # 都
#FA27 
#FA28 﨨
#FA29 
    ord("\uFA2A") : "\u98EF",    # 飯
    ord("\uFA2B") : "\u98FC",    # 飼
    ord("\uFA2C") : "\u9928",    # 館
    ord("\uFA2D") : "\u9DB4",    # 鶴
    ord("\uFA2E") : "\u90DE",    # 郞
    ord("\uFA2F") : "\u96B7",    # 隷
    ord("\uFA30") : "\u4FAE",    # 侮
    ord("\uFA31") : "\u50E7",    # 僧
    ord("\uFA32") : "\u514D",    # 免
    ord("\uFA33") : "\u52C9",    # 勉
    ord("\uFA34") : "\u52E4",    # 勤
    ord("\uFA35") : "\u5351",    # 卑
    ord("\uFA36") : "\u559D",    # 喝
    ord("\uFA37") : "\u5606",    # 嘆
    ord("\uFA38") : "\u5668",    # 器
    ord("\uFA39") : "\u5840",    # 塀
    ord("\uFA3A") : "\u58A8",    # 墨
    ord("\uFA3B") : "\u5C64",    # 層
    ord("\uFA3C") : "\u5C6E",    # 屮
    ord("\uFA3D") : "\u6094",    # 悔
    ord("\uFA3E") : "\u6168",    # 慨
    ord("\uFA3F") : "\u618E",    # 憎
    ord("\uFA40") : "\u61F2",    # 懲
    ord("\uFA41") : "\u654F",    # 敏
    ord("\uFA42") : "\u65E2",    # 既
    ord("\uFA43") : "\u6691",    # 暑
    ord("\uFA44") : "\u6885",    # 梅
    ord("\uFA45") : "\u6D77",    # 海
    ord("\uFA46") : "\u6E1A",    # 渚
    ord("\uFA47") : "\u6F22",    # 漢
    ord("\uFA48") : "\u716E",    # 煮
    ord("\uFA49") : "\u722B",    # 爫	
    ord("\uFA4A") : "\u7422",    # 琢
    ord("\uFA4B") : "\u7891",    # 碑
    ord("\uFA4C") : "\u793E",    # 社
    ord("\uFA4D") : "\u7949",    # 祉
    ord("\uFA4E") : "\u7948",    # 祈
    ord("\uFA4F") : "\u7950",    # 祐
    ord("\uFA50") : "\u7956",    # 祖
    ord("\uFA51") : "\u795D",    # 祝
    ord("\uFA52") : "\u798D",    # 禍
    ord("\uFA53") : "\u798E",    # 禎
    ord("\uFA54") : "\u7A40",    # 穀
    ord("\uFA55") : "\u7A81",    # 突
    ord("\uFA56") : "\u7BC0",    # 節
    ord("\uFA57") : "\u7DF4",    # 練
    ord("\uFA58") : "\u7E09",    # 縉
    ord("\uFA59") : "\u7E41",    # 繁
    ord("\uFA5A") : "\u7F72",    # 署
    ord("\uFA5B") : "\u8005",    # 者
    ord("\uFA5C") : "\u81ED",    # 臭
    ord("\uFA5D") : "\u8279",    # 艹	
    ord("\uFA5E") : "\u8279",    # 艹	
    ord("\uFA5F") : "\u8457",    # 著
    ord("\uFA60") : "\u8910",    # 褐
    ord("\uFA61") : "\u8996",    # 視
    ord("\uFA62") : "\u8B01",    # 謁
    ord("\uFA63") : "\u8B39",    # 謹
    ord("\uFA64") : "\u8CD3",    # 賓
    ord("\uFA65") : "\u8D08",    # 贈
    ord("\uFA66") : "\u8FB6",    # 辶
    ord("\uFA67") : "\u9038",    # 逸
    ord("\uFA68") : "\u96E3",    # 難
    ord("\uFA69") : "\u97FF",    # 響
    ord("\uFA6A") : "\u983B",    # 頻
    ord("\uFA6B") : "\u6075",    # 恵
    ord("\uFA6C") : "\u242EE",    # �
    ord("\uFA6D") : "\u8218",    # 舘
    ord("\uFA70") : "\u4E26",    # 並
    ord("\uFA71") : "\u51B5",    # 况
    ord("\uFA72") : "\u5168",    # 全
    ord("\uFA73") : "\u4F80",    # 侀
    ord("\uFA74") : "\u5145",    # 充
    ord("\uFA75") : "\u5180",    # 冀
    ord("\uFA76") : "\u52C7",    # 勇
    ord("\uFA77") : "\u52FA",    # 勺
    ord("\uFA78") : "\u559D",    # 喝
    ord("\uFA79") : "\u5555",    # 啕
    ord("\uFA7A") : "\u5599",    # 喙
    ord("\uFA7B") : "\u55E2",    # 嗢
    ord("\uFA7C") : "\u585A",    # 塚
    ord("\uFA7D") : "\u58B3",    # 墳
    ord("\uFA7E") : "\u5944",    # 奄
    ord("\uFA7F") : "\u5954",    # 奔
    ord("\uFA80") : "\u5A62",    # 婢
    ord("\uFA81") : "\u5B28",    # 嬨
    ord("\uFA82") : "\u5ED2",    # 廒
    ord("\uFA83") : "\u5ED9",    # 廙
    ord("\uFA84") : "\u5F69",    # 彩
    ord("\uFA85") : "\u5FAD",    # 徭
    ord("\uFA86") : "\u60D8",    # 惘
    ord("\uFA87") : "\u614E",    # 慎
    ord("\uFA88") : "\u6108",    # 愈
    ord("\uFA89") : "\u618E",    # 憎
    ord("\uFA8A") : "\u6160",    # 慠
    ord("\uFA8B") : "\u61F2",    # 懲
    ord("\uFA8C") : "\u6234",    # 戴
    ord("\uFA8D") : "\u63C4",    # 揄
    ord("\uFA8E") : "\u641C",    # 搜
    ord("\uFA8F") : "\u6452",    # 摒
    ord("\uFA90") : "\u6556",    # 敖
    ord("\uFA91") : "\u6674",    # 晴
    ord("\uFA92") : "\u6717",    # 朗
    ord("\uFA93") : "\u671B",    # 望
    ord("\uFA94") : "\u6756",    # 杖
    ord("\uFA95") : "\u6B79",    # 歹
    ord("\uFA96") : "\u6BBA",    # 殺
    ord("\uFA97") : "\u6D41",    # 流
    ord("\uFA98") : "\u6EDB",    # 滛
    ord("\uFA99") : "\u6ECB",    # 滋
    ord("\uFA9A") : "\u6F22",    # 漢
    ord("\uFA9B") : "\u701E",    # 瀞
    ord("\uFA9C") : "\u716E",    # 煮
    ord("\uFA9D") : "\u77A7",    # 瞧
    ord("\uFA9E") : "\u7235",    # 爵
    ord("\uFA9F") : "\u72AF",    # 犯
    ord("\uFAA0") : "\u732A",    # 猪
    ord("\uFAA1") : "\u7471",    # 瑱
    ord("\uFAA2") : "\u7506",    # 甆
    ord("\uFAA3") : "\u753B",    # 画
    ord("\uFAA4") : "\u761D",    # 瘝
    ord("\uFAA5") : "\u761F",    # 瘟
    ord("\uFAA6") : "\u76CA",    # 益
    ord("\uFAA7") : "\u76DB",    # 盛
    ord("\uFAA8") : "\u76F4",    # 直
    ord("\uFAA9") : "\u774A",    # 睊
    ord("\uFAAA") : "\u7740",    # 着
    ord("\uFAAB") : "\u78CC",    # 磌
    ord("\uFAAC") : "\u7AB1",    # 窱
    ord("\uFAAD") : "\u7BC0",    # 節
    ord("\uFAAE") : "\u7C7B",    # 类
    ord("\uFAAF") : "\u7D5B",    # 絛
    ord("\uFAB0") : "\u7DF4",    # 練
    ord("\uFAB1") : "\u7F3E",    # 缾
    ord("\uFAB2") : "\u8005",    # 者
    ord("\uFAB3") : "\u8352",    # 荒
    ord("\uFAB4") : "\u83EF",    # 華
    ord("\uFAB5") : "\u8779",    # 蝹
    ord("\uFAB6") : "\u8941",    # 襁
    ord("\uFAB7") : "\u8986",    # 覆
    ord("\uFAB8") : "\u8996",    # 視
    ord("\uFAB9") : "\u8ABF",    # 調
    ord("\uFABA") : "\u8AF8",    # 諸
    ord("\uFABB") : "\u8ACB",    # 請
    ord("\uFABC") : "\u8B01",    # 謁
    ord("\uFABD") : "\u8AFE",    # 諾
    ord("\uFABE") : "\u8AED",    # 諭
    ord("\uFABF") : "\u8B39",    # 謹
    ord("\uFAC0") : "\u8B8A",    # 變
    ord("\uFAC1") : "\u8D08",    # 贈
    ord("\uFAC2") : "\u8F38",    # 輸
    ord("\uFAC3") : "\u9072",    # 遲
    ord("\uFAC4") : "\u9199",    # 醙
    ord("\uFAC5") : "\u9276",    # 鉶
    ord("\uFAC6") : "\u967C",    # 陼
    ord("\uFAC7") : "\u96E3",    # 難
    ord("\uFAC8") : "\u9756",    # 靖
    ord("\uFAC9") : "\u97DB",    # 韛
    ord("\uFACA") : "\u97FF",    # 響
    ord("\uFACB") : "\u980B",    # 頋
    ord("\uFACC") : "\u983B",    # 頻
    ord("\uFACD") : "\u9B12",    # 鬒
    ord("\uFACE") : "\u9F9C",    # 龜
    ord("\uFACF") : "\u2284A",    # �
    ord("\uFAD0") : "\u22844",    # �
    ord("\uFAD1") : "\u233D5",    # �
    ord("\uFAD2") : "\u3B9D",    # 㮝
    ord("\uFAD3") : "\u4018",    # 䀘
    ord("\uFAD4") : "\u4039",    # 䀹
    ord("\uFAD5") : "\u25249",    # �
    ord("\uFAD6") : "\u25CD0",    # �
    ord("\uFAD7") : "\u27ED3",    # �
    ord("\uFAD8") : "\u9F43",    # 齃
    ord("\uFAD9") : "\u9F8E",    # 龎
    ord("\u58ca") : "\u58de",    #壞
    ord("\u6d45") : "\u6DFA",
    ord("\u69c7") : "\u69D9",
    ord("\u7a42") : "\u7A57",
    
    # private use codepoints
    ord("\ue000") : "",
    ord("\ue001") : "",
    ord("\ue002") : "",
    ord("\ue003") : "",
    ord("\ue004") : "",
    ord("\ue005") : "",
    ord("\ue006") : "",
    ord("\ue007") : "",
    ord("\ue008") : "",
    ord("\ue009") : "",
    ord("\ue00a") : "",
    ord("\ue00b") : "",
    ord("\ue00c") : "",
    ord("\ue00d") : "",
    ord("\ue00e") : "",
    ord("\ue00f") : "",
    ord("\ue010") : "",
    ord("\ue011") : "",
    ord("\ue012") : "",
    ord("\ue013") : "",
    ord("\ue014") : "",
    ord("\ue015") : "",
    ord("\ue016") : "",
    ord("\ue017") : "",
    ord("\ue018") : "",
    ord("\ue019") : "",
    ord("\ue01a") : "",
    ord("\ue01b") : "",
    ord("\ue01c") : "",
    ord("\ue01d") : "",
    ord("\ue01e") : "",
    ord("\ue01f") : "",
    ord("\ue020") : "",
    ord("\ue021") : "",
    ord("\ue022") : "",
    ord("\ue023") : "",
    ord("\ue024") : "",
    ord("\ue025") : "",
    ord("\ue026") : "",
    ord("\ue027") : "",
    ord("\ue028") : "",
    ord("\ue029") : "",
    ord("\ue02a") : "",
    ord("\ue02b") : "",
    ord("\ue02c") : "",
    ord("\ue02d") : "",
    ord("\ue02e") : "",
    ord("\ue02f") : "",
    ord("\ue030") : "",
    ord("\ue031") : "",
    ord("\ue032") : "",
    ord("\ue033") : "",
    ord("\ue034") : "",
    ord("\ue035") : "",
    ord("\ue036") : "",
    ord("\ue037") : "",
    ord("\ue038") : "",
    ord("\ue039") : "",
    ord("\ue03a") : "",
    ord("\ue03b") : "",
    ord("\ue03c") : "",
    ord("\ue03d") : "",
    ord("\ue03e") : "",
    ord("\ue03f") : "",
    ord("\ue040") : "",
    ord("\ue041") : "",
    ord("\ue042") : "",
    ord("\ue043") : "",
    ord("\ue044") : "",
    ord("\ue045") : "",
    ord("\ue046") : "",
    ord("\ue047") : "",
    ord("\ue048") : "",
    ord("\ue049") : "",
    ord("\ue04a") : "",
    ord("\ue04b") : "",
    ord("\ue04c") : "",
    ord("\ue04d") : "",
    ord("\ue04e") : "",
    ord("\ue04f") : "",
    ord("\ue050") : "",
    ord("\ue051") : "",
    ord("\ue052") : "",
    ord("\ue053") : "",
    ord("\ue054") : "",
    ord("\ue055") : "",
    ord("\ue056") : "",
    ord("\ue057") : "",
    ord("\ue058") : "",
    ord("\ue059") : "",
    ord("\ue05a") : "",
    ord("\ue05b") : "",
    ord("\ue05c") : "",
    ord("\ue05d") : "",
    ord("\ue05e") : "",
    ord("\ue05f") : "",
    ord("\ue060") : "",
    ord("\ue061") : "",
    ord("\ue062") : "",
    ord("\ue063") : "",
    ord("\ue064") : "",
    ord("\ue065") : "",
    ord("\ue066") : "",
    ord("\ue067") : "",
    ord("\ue068") : "",
    ord("\ue069") : "",
    ord("\ue06a") : "",
    ord("\ue06b") : "",
    ord("\ue06c") : "",
    ord("\ue06d") : "",
    ord("\ue06e") : "",
    ord("\ue06f") : "",
    ord("\ue070") : "",
    ord("\ue071") : "",
    ord("\ue072") : "",
    ord("\ue073") : "",
    ord("\ue074") : "",
    ord("\ue075") : "",
    ord("\ue076") : "",
    ord("\ue077") : "",
    ord("\ue078") : "",
    ord("\ue079") : "",
    ord("\ue07a") : "",
    ord("\ue07b") : "",
    ord("\ue07c") : "",
    ord("\ue07d") : "",
    ord("\ue07e") : "",
    ord("\ue07f") : "",
    ord("\ue080") : "",
    ord("\ue081") : "",
    ord("\ue082") : "",
    ord("\ue083") : "",
    ord("\ue084") : "",
    ord("\ue085") : "",
    ord("\ue086") : "",
    ord("\ue087") : "",
    ord("\ue088") : "",
    ord("\ue089") : "",
    ord("\ue08a") : "",
    ord("\ue08b") : "",
    ord("\ue08c") : "",
    ord("\ue08d") : "",
    ord("\ue08e") : "",
    ord("\ue08f") : "",
    ord("\ue090") : "",
    ord("\ue091") : "",
    ord("\ue092") : "",
    ord("\ue093") : "",
    ord("\ue094") : "",
    ord("\ue095") : "",
    ord("\ue096") : "",
    ord("\ue097") : "",
    ord("\ue098") : "",
    ord("\ue099") : "",
    ord("\ue09a") : "",
    ord("\ue09b") : "",
    ord("\ue09c") : "",
    ord("\ue09d") : "",
    ord("\ue09e") : "",
    ord("\ue09f") : "",
    ord("\ue0a0") : "",
    ord("\ue0a1") : "",
    ord("\ue0a2") : "",
    ord("\ue0a3") : "",
    ord("\ue0a4") : "",
    ord("\ue0a5") : "",
    ord("\ue0a6") : "",
    ord("\ue0a7") : "",
    ord("\ue0a8") : "",
    ord("\ue0a9") : "",
    ord("\ue0aa") : "",
    ord("\ue0ab") : "",
    ord("\ue0ac") : "",
    ord("\ue0ad") : "",
    ord("\ue0ae") : "",
    ord("\ue0af") : "",
    ord("\ue0b0") : "",
    ord("\ue0b1") : "",
    ord("\ue0b2") : "",
    ord("\ue0b3") : "",
    ord("\ue0b4") : "",
    ord("\ue0b5") : "",
    ord("\ue0b6") : "",
    ord("\ue0b7") : "",
    ord("\ue0b8") : "",
    ord("\ue0b9") : "",
    ord("\ue0ba") : "",
    ord("\ue0bb") : "",
    ord("\ue0bc") : "",
    ord("\ue0bd") : "",
    ord("\ue0be") : "",
    ord("\ue0bf") : "",
    ord("\ue0c0") : "",
    ord("\ue0c1") : "",
    ord("\ue0c2") : "",
    ord("\ue0c3") : "",
    ord("\ue0c4") : "",
    ord("\ue0c5") : "",
    ord("\ue0c6") : "",
    ord("\ue0c7") : "",
    ord("\ue0c8") : "",
    ord("\ue0c9") : "",
    ord("\ue0ca") : "",
    ord("\ue0cb") : "",
    ord("\ue0cc") : "",
    ord("\ue0cd") : "",
    ord("\ue0ce") : "",
    ord("\ue0cf") : "",
    ord("\ue0d0") : "",
    ord("\ue0d1") : "",
    ord("\ue0d2") : "",
    ord("\ue0d3") : "",
    ord("\ue0d4") : "",
    ord("\ue0d5") : "",
    ord("\ue0d6") : "",
    ord("\ue0d7") : "",
    ord("\ue0d8") : "",
    ord("\ue0d9") : "",
    ord("\ue0da") : "",
    ord("\ue0db") : "",
    ord("\ue0dc") : "",
    ord("\ue0dd") : "",
    ord("\ue0de") : "",
    ord("\ue0df") : "",
    ord("\ue0e0") : "",
    ord("\ue0e1") : "",
    ord("\ue0e2") : "",
    ord("\ue0e3") : "",
    ord("\ue0e4") : "",
    ord("\ue0e5") : "",
    ord("\ue0e6") : "",
    ord("\ue0e7") : "",
    ord("\ue0e8") : "",
    ord("\ue0e9") : "",
    ord("\ue0ea") : "",
    ord("\ue0eb") : "",
    ord("\ue0ec") : "",
    ord("\ue0ed") : "",
    ord("\ue0ee") : "",
    ord("\ue0ef") : "",
    ord("\ue0f0") : "",
    ord("\ue0f1") : "",
    ord("\ue0f2") : "",
    ord("\ue0f3") : "",
    ord("\ue0f4") : "",
    ord("\ue0f5") : "",
    ord("\ue0f6") : "",
    ord("\ue0f7") : "",
    ord("\ue0f8") : "",
    ord("\ue0f9") : "",
    ord("\ue0fa") : "",
    ord("\ue0fb") : "",
    ord("\ue0fc") : "",
    ord("\ue0fd") : "",
    ord("\ue0fe") : "",
    ord("\ue0ff") : "",
    ord("\ue100") : "",
    ord("\ue101") : "",
    ord("\ue102") : "",
    ord("\ue103") : "",
    ord("\ue104") : "",
    ord("\ue105") : "",
    ord("\ue106") : "",
    ord("\ue107") : "",
    ord("\ue108") : "",
    ord("\ue109") : "",
    ord("\ue10a") : "",
    ord("\ue10b") : "",
    ord("\ue10c") : "",
    ord("\ue10d") : "",
    ord("\ue10e") : "",
    ord("\ue10f") : "",
    ord("\ue110") : "",
    ord("\ue111") : "",
    ord("\ue112") : "",
    ord("\ue113") : "",
    ord("\ue114") : "",
    ord("\ue115") : "",
    ord("\ue116") : "",
    ord("\ue117") : "",
    ord("\ue118") : "",
    ord("\ue119") : "",
    ord("\ue11a") : "",
    ord("\ue11b") : "",
    ord("\ue11c") : "",
    ord("\ue11d") : "",
    ord("\ue11e") : "",
    ord("\ue11f") : "",
    ord("\ue120") : "",
    ord("\ue121") : "",
    ord("\ue122") : "",
    ord("\ue123") : "",
    ord("\ue124") : "",
    ord("\ue125") : "",
    ord("\ue126") : "",
    ord("\ue127") : "",
    ord("\ue128") : "",
    ord("\ue129") : "",
    ord("\ue12a") : "",
    ord("\ue12b") : "",
    ord("\ue12c") : "",
    ord("\ue12d") : "",
    ord("\ue12e") : "",
    ord("\ue12f") : "",
    ord("\ue130") : "",
    ord("\ue131") : "",
    ord("\ue132") : "",
    ord("\ue133") : "",
    ord("\ue134") : "",
    ord("\ue135") : "",
    ord("\ue136") : "",
    ord("\ue137") : "",
    ord("\ue138") : "",
    ord("\ue139") : "",
    ord("\ue13a") : "",
    ord("\ue13b") : "",
    ord("\ue13c") : "",
    ord("\ue13d") : "",
    ord("\ue13e") : "",
    ord("\ue13f") : "",
    ord("\ue140") : "",
    ord("\ue141") : "",
    ord("\ue142") : "",
    ord("\ue143") : "",
    ord("\ue144") : "",
    ord("\ue145") : "",
    ord("\ue146") : "",
    ord("\ue147") : "",
    ord("\ue148") : "",
    ord("\ue149") : "",
    ord("\ue14a") : "",
    ord("\ue14b") : "",
    ord("\ue14c") : "",
    ord("\ue14d") : "",
    ord("\ue14e") : "",
    ord("\ue14f") : "",
    ord("\ue150") : "",
    ord("\ue151") : "",
    ord("\ue152") : "",
    ord("\ue153") : "",
    ord("\ue154") : "",
    ord("\ue155") : "",
    ord("\ue156") : "",
    ord("\ue157") : "",
    ord("\ue158") : "",
    ord("\ue159") : "",
    ord("\ue15a") : "",
    ord("\ue15b") : "",
    ord("\ue15c") : "",
    ord("\ue15d") : "",
    ord("\ue15e") : "",
    ord("\ue15f") : "",
    ord("\ue160") : "",
    ord("\ue161") : "",
    ord("\ue162") : "",
    ord("\ue163") : "",
    ord("\ue164") : "",
    ord("\ue165") : "",
    ord("\ue166") : "",
    ord("\ue167") : "",
    ord("\ue168") : "",
    ord("\ue169") : "",
    ord("\ue16a") : "",
    ord("\ue16b") : "",
    ord("\ue16c") : "",
    ord("\ue16d") : "",
    ord("\ue16e") : "",
    ord("\ue16f") : "",
    ord("\ue170") : "",
    ord("\ue171") : "",
    ord("\ue172") : "",
    ord("\ue173") : "",
    ord("\ue174") : "",
    ord("\ue175") : "",
    ord("\ue176") : "",
    ord("\ue177") : "",
    ord("\ue178") : "",
    ord("\ue179") : "",
    ord("\ue17a") : "",
    ord("\ue17b") : "",
    ord("\ue17c") : "",
    ord("\ue17d") : "",
    ord("\ue17e") : "",
    ord("\ue17f") : "",
    ord("\ue180") : "",
    ord("\ue181") : "",
    ord("\ue182") : "",
    ord("\ue183") : "",
    ord("\ue184") : "",
    ord("\ue185") : "",
    ord("\ue186") : "",
    ord("\ue187") : "",
    ord("\ue188") : "",
    ord("\ue189") : "",
    ord("\ue18a") : "",
    ord("\ue18b") : "",
    ord("\ue18c") : "",
    ord("\ue18d") : "",
    ord("\ue18e") : "",
    ord("\ue18f") : "",
    ord("\ue190") : "",
    ord("\ue191") : "",
    ord("\ue192") : "",
    ord("\ue193") : "",
    ord("\ue194") : "",
    ord("\ue195") : "",
    ord("\ue196") : "",
    ord("\ue197") : "",
    ord("\ue198") : "",
    ord("\ue199") : "",
    ord("\ue19a") : "",
    ord("\ue19b") : "",
    ord("\ue19c") : "",
    ord("\ue19d") : "",
    ord("\ue19e") : "",
    ord("\ue19f") : "",
    ord("\ue1a0") : "",
    ord("\ue1a1") : "",
    ord("\ue1a2") : "",
    ord("\ue1a3") : "",
    ord("\ue1a4") : "",
    ord("\ue1a5") : "",
    ord("\ue1a6") : "",
    ord("\ue1a7") : "",
    ord("\ue1a8") : "",
    ord("\ue1a9") : "",
    ord("\ue1aa") : "",
    ord("\ue1ab") : "",
    ord("\ue1ac") : "",
    ord("\ue1ad") : "",
    ord("\ue1ae") : "",
    ord("\ue1af") : "",
    ord("\ue1b0") : "",
    ord("\ue1b1") : "",
    ord("\ue1b2") : "",
    ord("\ue1b3") : "",
    ord("\ue1b4") : "",
    ord("\ue1b5") : "",
    ord("\ue1b6") : "",
    ord("\ue1b7") : "",
    ord("\ue1b8") : "",
    ord("\ue1b9") : "",
    ord("\ue1ba") : "",
    ord("\ue1bb") : "",
    ord("\ue1bc") : "",
    ord("\ue1bd") : "",
    ord("\ue1be") : "",
    ord("\ue1bf") : "",
    ord("\ue1c0") : "",
    ord("\ue1c1") : "",
    ord("\ue1c2") : "",
    ord("\ue1c3") : "",
    ord("\ue1c4") : "",
    ord("\ue1c5") : "",
    ord("\ue1c6") : "",
    ord("\ue1c7") : "",
    ord("\ue1c8") : "",
    ord("\ue1c9") : "",
    ord("\ue1ca") : "",
    ord("\ue1cb") : "",
    ord("\ue1cc") : "",
    ord("\ue1cd") : "",
    ord("\ue1ce") : "",
    ord("\ue1cf") : "",
    ord("\ue1d0") : "",
    ord("\ue1d1") : "",
    ord("\ue1d2") : "",
    ord("\ue1d3") : "",
    ord("\ue1d4") : "",
    ord("\ue1d5") : "",
    ord("\ue1d6") : "",
    ord("\ue1d7") : "",
    ord("\ue1d8") : "",
    ord("\ue1d9") : "",
    ord("\ue1da") : "",
    ord("\ue1db") : "",
    ord("\ue1dc") : "",
    ord("\ue1dd") : "",
    ord("\ue1de") : "",
    ord("\ue1df") : "",
    ord("\ue1e0") : "",
    ord("\ue1e1") : "",
    ord("\ue1e2") : "",
    ord("\ue1e3") : "",
    ord("\ue1e4") : "",
    ord("\ue1e5") : "",
    ord("\ue1e6") : "",
    ord("\ue1e7") : "",
    ord("\ue1e8") : "",
    ord("\ue1e9") : "",
    ord("\ue1ea") : "",
    ord("\ue1eb") : "",
    ord("\ue1ec") : "",
    ord("\ue1ed") : "",
    ord("\ue1ee") : "",
    ord("\ue1ef") : "",
    ord("\ue1f0") : "",
    ord("\ue1f1") : "",
    ord("\ue1f2") : "",
    ord("\ue1f3") : "",
    ord("\ue1f4") : "",
    ord("\ue1f5") : "",
    ord("\ue1f6") : "",
    ord("\ue1f7") : "",
    ord("\ue1f8") : "",
    ord("\ue1f9") : "",
    ord("\ue1fa") : "",
    ord("\ue1fb") : "",
    ord("\ue1fc") : "",
    ord("\ue1fd") : "",
    ord("\ue1fe") : "",
    ord("\ue1ff") : "",
    ord("\ue200") : "",
    ord("\ue201") : "",
    ord("\ue202") : "",
    ord("\ue203") : "",
    ord("\ue204") : "",
    ord("\ue205") : "",
    ord("\ue206") : "",
    ord("\ue207") : "",
    ord("\ue208") : "",
    ord("\ue209") : "",
    ord("\ue20a") : "",
    ord("\ue20b") : "",
    ord("\ue20c") : "",
    ord("\ue20d") : "",
    ord("\ue20e") : "",
    ord("\ue20f") : "",
    ord("\ue210") : "",
    ord("\ue211") : "",
    ord("\ue212") : "",
    ord("\ue213") : "",
    ord("\ue214") : "",
    ord("\ue215") : "",
    ord("\ue216") : "",
    ord("\ue217") : "",
    ord("\ue218") : "",
    ord("\ue219") : "",
    ord("\ue21a") : "",
    ord("\ue21b") : "",
    ord("\ue21c") : "",
    ord("\ue21d") : "",
    ord("\ue21e") : "",
    ord("\ue21f") : "",
    ord("\ue220") : "",
    ord("\ue221") : "",
    ord("\ue222") : "",
    ord("\ue223") : "",
    ord("\ue224") : "",
    ord("\ue225") : "",
    ord("\ue226") : "",
    ord("\ue227") : "",
    ord("\ue228") : "",
    ord("\ue229") : "",
    ord("\ue22a") : "",
    ord("\ue22b") : "",
    ord("\ue22c") : "",
    ord("\ue22d") : "",
    ord("\ue22e") : "",
    ord("\ue22f") : "",
    ord("\ue230") : "",
    ord("\ue231") : "",
    ord("\ue232") : "",
    ord("\ue233") : "",
    ord("\ue234") : "",
    ord("\ue235") : "",
    ord("\ue236") : "",
    ord("\ue237") : "",
    ord("\ue238") : "",
    ord("\ue239") : "",
    ord("\ue23a") : "",
    ord("\ue23b") : "",
    ord("\ue23c") : "",
    ord("\ue23d") : "",
    ord("\ue23e") : "",
    ord("\ue23f") : "",
    ord("\ue240") : "",
    ord("\ue241") : "",
    ord("\ue242") : "",
    ord("\ue243") : "",
    ord("\ue244") : "",
    ord("\ue245") : "",
    ord("\ue246") : "",
    ord("\ue247") : "",
    ord("\ue248") : "",
    ord("\ue249") : "",
    ord("\ue24a") : "",
    ord("\ue24b") : "",
    ord("\ue24c") : "",
    ord("\ue24d") : "",
    ord("\ue24e") : "",
    ord("\ue24f") : "",
    ord("\ue250") : "",
    ord("\ue251") : "",
    ord("\ue252") : "",
    ord("\ue253") : "",
    ord("\ue254") : "",
    ord("\ue255") : "",
    ord("\ue256") : "",
    ord("\ue257") : "",
    ord("\ue258") : "",
    ord("\ue259") : "",
    ord("\ue25a") : "",
    ord("\ue25b") : "",
    ord("\ue25c") : "",
    ord("\ue25d") : "",
    ord("\ue25e") : "",
    ord("\ue25f") : "",
    ord("\ue260") : "",
    ord("\ue261") : "",
    ord("\ue262") : "",
    ord("\ue263") : "",
    ord("\ue264") : "",
    ord("\ue265") : "",
    ord("\ue266") : "",
    ord("\ue267") : "",
    ord("\ue268") : "",
    ord("\ue269") : "",
    ord("\ue26a") : "",
    ord("\ue26b") : "",
    ord("\ue26c") : "",
    ord("\ue26d") : "",
    ord("\ue26e") : "",
    ord("\ue26f") : "",
    ord("\ue270") : "",
    ord("\ue271") : "",
    ord("\ue272") : "",
    ord("\ue273") : "",
    ord("\ue274") : "",
    ord("\ue275") : "",
    ord("\ue276") : "",
    ord("\ue277") : "",
    ord("\ue278") : "",
    ord("\ue279") : "",
    ord("\ue27a") : "",
    ord("\ue27b") : "",
    ord("\ue27c") : "",
    ord("\ue27d") : "",
    ord("\ue27e") : "",
    ord("\ue27f") : "",
    ord("\ue280") : "",
    ord("\ue281") : "",
    ord("\ue282") : "",
    ord("\ue283") : "",
    ord("\ue284") : "",
    ord("\ue285") : "",
    ord("\ue286") : "",
    ord("\ue287") : "",
    ord("\ue288") : "",
    ord("\ue289") : "",
    ord("\ue28a") : "",
    ord("\ue28b") : "",
    ord("\ue28c") : "",
    ord("\ue28d") : "",
    ord("\ue28e") : "",
    ord("\ue28f") : "",
    ord("\ue290") : "",
    ord("\ue291") : "",
    ord("\ue292") : "",
    ord("\ue293") : "",
    ord("\ue294") : "",
    ord("\ue295") : "",
    ord("\ue296") : "",
    ord("\ue297") : "",
    ord("\ue298") : "",
    ord("\ue299") : "",
    ord("\ue29a") : "",
    ord("\ue29b") : "",
    ord("\ue29c") : "",
    ord("\ue29d") : "",
    ord("\ue29e") : "",
    ord("\ue29f") : "",
    ord("\ue2a0") : "",
    ord("\ue2a1") : "",
    ord("\ue2a2") : "",
    ord("\ue2a3") : "",
    ord("\ue2a4") : "",
    ord("\ue2a5") : "",
    ord("\ue2a6") : "",
    ord("\ue2a7") : "",
    ord("\ue2a8") : "",
    ord("\ue2a9") : "",
    ord("\ue2aa") : "",
    ord("\ue2ab") : "",
    ord("\ue2ac") : "",
    ord("\ue2ad") : "",
    ord("\ue2ae") : "",
    ord("\ue2af") : "",
    ord("\ue2b0") : "",
    ord("\ue2b1") : "",
    ord("\ue2b2") : "",
    ord("\ue2b3") : "",
    ord("\ue2b4") : "",
    ord("\ue2b5") : "",
    ord("\ue2b6") : "",
    ord("\ue2b7") : "",
    ord("\ue2b8") : "",
    ord("\ue2b9") : "",
    ord("\ue2ba") : "",
    ord("\ue2bb") : "",
    ord("\ue2bc") : "",
    ord("\ue2bd") : "",
    ord("\ue2be") : "",
    ord("\ue2bf") : "",
    ord("\ue2c0") : "",
    ord("\ue2c1") : "",
    ord("\ue2c2") : "",
    ord("\ue2c3") : "",
    ord("\ue2c4") : "",
    ord("\ue2c5") : "",
    ord("\ue2c6") : "",
    ord("\ue2c7") : "",
    ord("\ue2c8") : "",
    ord("\ue2c9") : "",
    ord("\ue2ca") : "",
    ord("\ue2cb") : "",
    ord("\ue2cc") : "",
    ord("\ue2cd") : "",
    ord("\ue2ce") : "",
    ord("\ue2cf") : "",
    ord("\ue2d0") : "",
    ord("\ue2d1") : "",
    ord("\ue2d2") : "",
    ord("\ue2d3") : "",
    ord("\ue2d4") : "",
    ord("\ue2d5") : "",
    ord("\ue2d6") : "",
    ord("\ue2d7") : "",
    ord("\ue2d8") : "",
    ord("\ue2d9") : "",
    ord("\ue2da") : "",
    ord("\ue2db") : "",
    ord("\ue2dc") : "",
    ord("\ue2dd") : "",
    ord("\ue2de") : "",
    ord("\ue2df") : "",
    ord("\ue2e0") : "",
    ord("\ue2e1") : "",
    ord("\ue2e2") : "",
    ord("\ue2e3") : "",
    ord("\ue2e4") : "",
    ord("\ue2e5") : "",
    ord("\ue2e6") : "",
    ord("\ue2e7") : "",
    ord("\ue2e8") : "",
    ord("\ue2e9") : "",
    ord("\ue2ea") : "",
    ord("\ue2eb") : "",
    ord("\ue2ec") : "",
    ord("\ue2ed") : "",
    ord("\ue2ee") : "",
    ord("\ue2ef") : "",
    ord("\ue2f0") : "",
    ord("\ue2f1") : "",
    ord("\ue2f2") : "",
    ord("\ue2f3") : "",
    ord("\ue2f4") : "",
    ord("\ue2f5") : "",
    ord("\ue2f6") : "",
    ord("\ue2f7") : "",
    ord("\ue2f8") : "",
    ord("\ue2f9") : "",
    ord("\ue2fa") : "",
    ord("\ue2fb") : "",
    ord("\ue2fc") : "",
    ord("\ue2fd") : "",
    ord("\ue2fe") : "",
    ord("\ue2ff") : "",
    ord("\ue300") : "",
    ord("\ue301") : "",
    ord("\ue302") : "",
    ord("\ue303") : "",
    ord("\ue304") : "",
    ord("\ue305") : "",
    ord("\ue306") : "",
    ord("\ue307") : "",
    ord("\ue308") : "",
    ord("\ue309") : "",
    ord("\ue30a") : "",
    ord("\ue30b") : "",
    ord("\ue30c") : "",
    ord("\ue30d") : "",
    ord("\ue30e") : "",
    ord("\ue30f") : "",
    ord("\ue310") : "",
    ord("\ue311") : "",
    ord("\ue312") : "",
    ord("\ue313") : "",
    ord("\ue314") : "",
    ord("\ue315") : "",
    ord("\ue316") : "",
    ord("\ue317") : "",
    ord("\ue318") : "",
    ord("\ue319") : "",
    ord("\ue31a") : "",
    ord("\ue31b") : "",
    ord("\ue31c") : "",
    ord("\ue31d") : "",
    ord("\ue31e") : "",
    ord("\ue31f") : "",
    ord("\ue320") : "",
    ord("\ue321") : "",
    ord("\ue322") : "",
    ord("\ue323") : "",
    ord("\ue324") : "",
    ord("\ue325") : "",
    ord("\ue326") : "",
    ord("\ue327") : "",
    ord("\ue328") : "",
    ord("\ue329") : "",
    ord("\ue32a") : "",
    ord("\ue32b") : "",
    ord("\ue32c") : "",
    ord("\ue32d") : "",
    ord("\ue32e") : "",
    ord("\ue32f") : "",
    ord("\ue330") : "",
    ord("\ue331") : "",
    ord("\ue332") : "",
    ord("\ue333") : "",
    ord("\ue334") : "",
    ord("\ue335") : "",
    ord("\ue336") : "",
    ord("\ue337") : "",
    ord("\ue338") : "",
    ord("\ue339") : "",
    ord("\ue33a") : "",
    ord("\ue33b") : "",
    ord("\ue33c") : "",
    ord("\ue33d") : "",
    ord("\ue33e") : "",
    ord("\ue33f") : "",
    ord("\ue340") : "",
    ord("\ue341") : "",
    ord("\ue342") : "",
    ord("\ue343") : "",
    ord("\ue344") : "",
    ord("\ue345") : "",
    ord("\ue346") : "",
    ord("\ue347") : "",
    ord("\ue348") : "",
    ord("\ue349") : "",
    ord("\ue34a") : "",
    ord("\ue34b") : "",
    ord("\ue34c") : "",
    ord("\ue34d") : "",
    ord("\ue34e") : "",
    ord("\ue34f") : "",
    ord("\ue350") : "",
    ord("\ue351") : "",
    ord("\ue352") : "",
    ord("\ue353") : "",
    ord("\ue354") : "",
    ord("\ue355") : "",
    ord("\ue356") : "",
    ord("\ue357") : "",
    ord("\ue358") : "",
    ord("\ue359") : "",
    ord("\ue35a") : "",
    ord("\ue35b") : "",
    ord("\ue35c") : "",
    ord("\ue35d") : "",
    ord("\ue35e") : "",
    ord("\ue35f") : "",
    ord("\ue360") : "",
    ord("\ue361") : "",
    ord("\ue362") : "",
    ord("\ue363") : "",
    ord("\ue364") : "",
    ord("\ue365") : "",
    ord("\ue366") : "",
    ord("\ue367") : "",
    ord("\ue368") : "",
    ord("\ue369") : "",
    ord("\ue36a") : "",
    ord("\ue36b") : "",
    ord("\ue36c") : "",
    ord("\ue36d") : "",
    ord("\ue36e") : "",
    ord("\ue36f") : "",
    ord("\ue370") : "",
    ord("\ue371") : "",
    ord("\ue372") : "",
    ord("\ue373") : "",
    ord("\ue374") : "",
    ord("\ue375") : "",
    ord("\ue376") : "",
    ord("\ue377") : "",
    ord("\ue378") : "",
    ord("\ue379") : "",
    ord("\ue37a") : "",
    ord("\ue37b") : "",
    ord("\ue37c") : "",
    ord("\ue37d") : "",
    ord("\ue37e") : "",
    ord("\ue37f") : "",
    ord("\ue380") : "",
    ord("\ue381") : "",
    ord("\ue382") : "",
    ord("\ue383") : "",
    ord("\ue384") : "",
    ord("\ue385") : "",
    ord("\ue386") : "",
    ord("\ue387") : "",
    ord("\ue388") : "",
    ord("\ue389") : "",
    ord("\ue38a") : "",
    ord("\ue38b") : "",
    ord("\ue38c") : "",
    ord("\ue38d") : "",
    ord("\ue38e") : "",
    ord("\ue38f") : "",
    ord("\ue390") : "",
    ord("\ue391") : "",
    ord("\ue392") : "",
    ord("\ue393") : "",
    ord("\ue394") : "",
    ord("\ue395") : "",
    ord("\ue396") : "",
    ord("\ue397") : "",
    ord("\ue398") : "",
    ord("\ue399") : "",
    ord("\ue39a") : "",
    ord("\ue39b") : "",
    ord("\ue39c") : "",
    ord("\ue39d") : "",
    ord("\ue39e") : "",
    ord("\ue39f") : "",
    ord("\ue3a0") : "",
    ord("\ue3a1") : "",
    ord("\ue3a2") : "",
    ord("\ue3a3") : "",
    ord("\ue3a4") : "",
    ord("\ue3a5") : "",
    ord("\ue3a6") : "",
    ord("\ue3a7") : "",
    ord("\ue3a8") : "",
    ord("\ue3a9") : "",
    ord("\ue3aa") : "",
    ord("\ue3ab") : "",
    ord("\ue3ac") : "",
    ord("\ue3ad") : "",
    ord("\ue3ae") : "",
    ord("\ue3af") : "",
    ord("\ue3b0") : "",
    ord("\ue3b1") : "",
    ord("\ue3b2") : "",
    ord("\ue3b3") : "",
    ord("\ue3b4") : "",
    ord("\ue3b5") : "",
    ord("\ue3b6") : "",
    ord("\ue3b7") : "",
    ord("\ue3b8") : "",
    ord("\ue3b9") : "",
    ord("\ue3ba") : "",
    ord("\ue3bb") : "",
    ord("\ue3bc") : "",
    ord("\ue3bd") : "",
    ord("\ue3be") : "",
    ord("\ue3bf") : "",
    ord("\ue3c0") : "",
    ord("\ue3c1") : "",
    ord("\ue3c2") : "",
    ord("\ue3c3") : "",
    ord("\ue3c4") : "",
    ord("\ue3c5") : "",
    ord("\ue3c6") : "",
    ord("\ue3c7") : "",
    ord("\ue3c8") : "",
    ord("\ue3c9") : "",
    ord("\ue3ca") : "",
    ord("\ue3cb") : "",
    ord("\ue3cc") : "",
    ord("\ue3cd") : "",
    ord("\ue3ce") : "",
    ord("\ue3cf") : "",
    ord("\ue3d0") : "",
    ord("\ue3d1") : "",
    ord("\ue3d2") : "",
    ord("\ue3d3") : "",
    ord("\ue3d4") : "",
    ord("\ue3d5") : "",
    ord("\ue3d6") : "",
    ord("\ue3d7") : "",
    ord("\ue3d8") : "",
    ord("\ue3d9") : "",
    ord("\ue3da") : "",
    ord("\ue3db") : "",
    ord("\ue3dc") : "",
    ord("\ue3dd") : "",
    ord("\ue3de") : "",
    ord("\ue3df") : "",
    ord("\ue3e0") : "",
    ord("\ue3e1") : "",
    ord("\ue3e2") : "",
    ord("\ue3e3") : "",
    ord("\ue3e4") : "",
    ord("\ue3e5") : "",
    ord("\ue3e6") : "",
    ord("\ue3e7") : "",
    ord("\ue3e8") : "",
    ord("\ue3e9") : "",
    ord("\ue3ea") : "",
    ord("\ue3eb") : "",
    ord("\ue3ec") : "",
    ord("\ue3ed") : "",
    ord("\ue3ee") : "",
    ord("\ue3ef") : "",
    ord("\ue3f0") : "",
    ord("\ue3f1") : "",
    ord("\ue3f2") : "",
    ord("\ue3f3") : "",
    ord("\ue3f4") : "",
    ord("\ue3f5") : "",
    ord("\ue3f6") : "",
    ord("\ue3f7") : "",
    ord("\ue3f8") : "",
    ord("\ue3f9") : "",
    ord("\ue3fa") : "",
    ord("\ue3fb") : "",
    ord("\ue3fc") : "",
    ord("\ue3fd") : "",
    ord("\ue3fe") : "",
    ord("\ue3ff") : "",
    ord("\ue400") : "",
    ord("\ue401") : "",
    ord("\ue402") : "",
    ord("\ue403") : "",
    ord("\ue404") : "",
    ord("\ue405") : "",
    ord("\ue406") : "",
    ord("\ue407") : "",
    ord("\ue408") : "",
    ord("\ue409") : "",
    ord("\ue40a") : "",
    ord("\ue40b") : "",
    ord("\ue40c") : "",
    ord("\ue40d") : "",
    ord("\ue40e") : "",
    ord("\ue40f") : "",
    ord("\ue410") : "",
    ord("\ue411") : "",
    ord("\ue412") : "",
    ord("\ue413") : "",
    ord("\ue414") : "",
    ord("\ue415") : "",
    ord("\ue416") : "",
    ord("\ue417") : "",
    ord("\ue418") : "",
    ord("\ue419") : "",
    ord("\ue41a") : "",
    ord("\ue41b") : "",
    ord("\ue41c") : "",
    ord("\ue41d") : "",
    ord("\ue41e") : "",
    ord("\ue41f") : "",
    ord("\ue420") : "",
    ord("\ue421") : "",
    ord("\ue422") : "",
    ord("\ue423") : "",
    ord("\ue424") : "",
    ord("\ue425") : "",
    ord("\ue426") : "",
    ord("\ue427") : "",
    ord("\ue428") : "",
    ord("\ue429") : "",
    ord("\ue42a") : "",
    ord("\ue42b") : "",
    ord("\ue42c") : "",
    ord("\ue42d") : "",
    ord("\ue42e") : "",
    ord("\ue42f") : "",
    ord("\ue430") : "",
    ord("\ue431") : "",
    ord("\ue432") : "",
    ord("\ue433") : "",
    ord("\ue434") : "",
    ord("\ue435") : "",
    ord("\ue436") : "",
    ord("\ue437") : "",
    ord("\ue438") : "",
    ord("\ue439") : "",
    ord("\ue43a") : "",
    ord("\ue43b") : "",
    ord("\ue43c") : "",
    ord("\ue43d") : "",
    ord("\ue43e") : "",
    ord("\ue43f") : "",
    ord("\ue440") : "",
    ord("\ue441") : "",
    ord("\ue442") : "",
    ord("\ue443") : "",
    ord("\ue444") : "",
    ord("\ue445") : "",
    ord("\ue446") : "",
    ord("\ue447") : "",
    ord("\ue448") : "",
    ord("\ue449") : "",
    ord("\ue44a") : "",
    ord("\ue44b") : "",
    ord("\ue44c") : "",
    ord("\ue44d") : "",
    ord("\ue44e") : "",
    ord("\ue44f") : "",
    ord("\ue450") : "",
    ord("\ue451") : "",
    ord("\ue452") : "",
    ord("\ue453") : "",
    ord("\ue454") : "",
    ord("\ue455") : "",
    ord("\ue456") : "",
    ord("\ue457") : "",
    ord("\ue458") : "",
    ord("\ue459") : "",
    ord("\ue45a") : "",
    ord("\ue45b") : "",
    ord("\ue45c") : "",
    ord("\ue45d") : "",
    ord("\ue45e") : "",
    ord("\ue45f") : "",
    ord("\ue460") : "",
    ord("\ue461") : "",
    ord("\ue462") : "",
    ord("\ue463") : "",
    ord("\ue464") : "",
    ord("\ue465") : "",
    ord("\ue466") : "",
    ord("\ue467") : "",
    ord("\ue468") : "",
    ord("\ue469") : "",
    ord("\ue46a") : "",
    ord("\ue46b") : "",
    ord("\ue46c") : "",
    ord("\ue46d") : "",
    ord("\ue46e") : "",
    ord("\ue46f") : "",
    ord("\ue470") : "",
    ord("\ue471") : "",
    ord("\ue472") : "",
    ord("\ue473") : "",
    ord("\ue474") : "",
    ord("\ue475") : "",
    ord("\ue476") : "",
    ord("\ue477") : "",
    ord("\ue478") : "",
    ord("\ue479") : "",
    ord("\ue47a") : "",
    ord("\ue47b") : "",
    ord("\ue47c") : "",
    ord("\ue47d") : "",
    ord("\ue47e") : "",
    ord("\ue47f") : "",
    ord("\ue480") : "",
    ord("\ue481") : "",
    ord("\ue482") : "",
    ord("\ue483") : "",
    ord("\ue484") : "",
    ord("\ue485") : "",
    ord("\ue486") : "",
    ord("\ue487") : "",
    ord("\ue488") : "",
    ord("\ue489") : "",
    ord("\ue48a") : "",
    ord("\ue48b") : "",
    ord("\ue48c") : "",
    ord("\ue48d") : "",
    ord("\ue48e") : "",
    ord("\ue48f") : "",
    ord("\ue490") : "",
    ord("\ue491") : "",
    ord("\ue492") : "",
    ord("\ue493") : "",
    ord("\ue494") : "",
    ord("\ue495") : "",
    ord("\ue496") : "",
    ord("\ue497") : "",
    ord("\ue498") : "",
    ord("\ue499") : "",
    ord("\ue49a") : "",
    ord("\ue49b") : "",
    ord("\ue49c") : "",
    ord("\ue49d") : "",
    ord("\ue49e") : "",
    ord("\ue49f") : "",
    ord("\ue4a0") : "",
    ord("\ue4a1") : "",
    ord("\ue4a2") : "",
    ord("\ue4a3") : "",
    ord("\ue4a4") : "",
    ord("\ue4a5") : "",
    ord("\ue4a6") : "",
    ord("\ue4a7") : "",
    ord("\ue4a8") : "",
    ord("\ue4a9") : "",
    ord("\ue4aa") : "",
    ord("\ue4ab") : "",
    ord("\ue4ac") : "",
    ord("\ue4ad") : "",
    ord("\ue4ae") : "",
    ord("\ue4af") : "",
    ord("\ue4b0") : "",
    ord("\ue4b1") : "",
    ord("\ue4b2") : "",
    ord("\ue4b3") : "",
    ord("\ue4b4") : "",
    ord("\ue4b5") : "",
    ord("\ue4b6") : "",
    ord("\ue4b7") : "",
    ord("\ue4b8") : "",
    ord("\ue4b9") : "",
    ord("\ue4ba") : "",
    ord("\ue4bb") : "",
    ord("\ue4bc") : "",
    ord("\ue4bd") : "",
    ord("\ue4be") : "",
    ord("\ue4bf") : "",
    ord("\ue4c0") : "",
    ord("\ue4c1") : "",
    ord("\ue4c2") : "",
    ord("\ue4c3") : "",
    ord("\ue4c4") : "",
    ord("\ue4c5") : "",
    ord("\ue4c6") : "",
    ord("\ue4c7") : "",
    ord("\ue4c8") : "",
    ord("\ue4c9") : "",
    ord("\ue4ca") : "",
    ord("\ue4cb") : "",
    ord("\ue4cc") : "",
    ord("\ue4cd") : "",
    ord("\ue4ce") : "",
    ord("\ue4cf") : "",
    ord("\ue4d0") : "",
    ord("\ue4d1") : "",
    ord("\ue4d2") : "",
    ord("\ue4d3") : "",
    ord("\ue4d4") : "",
    ord("\ue4d5") : "",
    ord("\ue4d6") : "",
    ord("\ue4d7") : "",
    ord("\ue4d8") : "",
    ord("\ue4d9") : "",
    ord("\ue4da") : "",
    ord("\ue4db") : "",
    ord("\ue4dc") : "",
    ord("\ue4dd") : "",
    ord("\ue4de") : "",
    ord("\ue4df") : "",
    ord("\ue4e0") : "",
    ord("\ue4e1") : "",
    ord("\ue4e2") : "",
    ord("\ue4e3") : "",
    ord("\ue4e4") : "",
    ord("\ue4e5") : "",
    ord("\ue4e6") : "",
    ord("\ue4e7") : "",
    ord("\ue4e8") : "",
    ord("\ue4e9") : "",
    ord("\ue4ea") : "",
    ord("\ue4eb") : "",
    ord("\ue4ec") : "",
    ord("\ue4ed") : "",
    ord("\ue4ee") : "",
    ord("\ue4ef") : "",
    ord("\ue4f0") : "",
    ord("\ue4f1") : "",
    ord("\ue4f2") : "",
    ord("\ue4f3") : "",
    ord("\ue4f4") : "",
    ord("\ue4f5") : "",
    ord("\ue4f6") : "",
    ord("\ue4f7") : "",
    ord("\ue4f8") : "",
    ord("\ue4f9") : "",
    ord("\ue4fa") : "",
    ord("\ue4fb") : "",
    ord("\ue4fc") : "",
    ord("\ue4fd") : "",
    ord("\ue4fe") : "",
    ord("\ue4ff") : "",
    ord("\ue500") : "",
    ord("\ue501") : "",
    ord("\ue502") : "",
    ord("\ue503") : "",
    ord("\ue504") : "",
    ord("\ue505") : "",
    ord("\ue506") : "",
    ord("\ue507") : "",
    ord("\ue508") : "",
    ord("\ue509") : "",
    ord("\ue50a") : "",
    ord("\ue50b") : "",
    ord("\ue50c") : "",
    ord("\ue50d") : "",
    ord("\ue50e") : "",
    ord("\ue50f") : "",
    ord("\ue510") : "",
    ord("\ue511") : "",
    ord("\ue512") : "",
    ord("\ue513") : "",
    ord("\ue514") : "",
    ord("\ue515") : "",
    ord("\ue516") : "",
    ord("\ue517") : "",
    ord("\ue518") : "",
    ord("\ue519") : "",
    ord("\ue51a") : "",
    ord("\ue51b") : "",
    ord("\ue51c") : "",
    ord("\ue51d") : "",
    ord("\ue51e") : "",
    ord("\ue51f") : "",
    ord("\ue520") : "",
    ord("\ue521") : "",
    ord("\ue522") : "",
    ord("\ue523") : "",
    ord("\ue524") : "",
    ord("\ue525") : "",
    ord("\ue526") : "",
    ord("\ue527") : "",
    ord("\ue528") : "",
    ord("\ue529") : "",
    ord("\ue52a") : "",
    ord("\ue52b") : "",
    ord("\ue52c") : "",
    ord("\ue52d") : "",
    ord("\ue52e") : "",
    ord("\ue52f") : "",
    ord("\ue530") : "",
    ord("\ue531") : "",
    ord("\ue532") : "",
    ord("\ue533") : "",
    ord("\ue534") : "",
    ord("\ue535") : "",
    ord("\ue536") : "",
    ord("\ue537") : "",
    ord("\ue538") : "",
    ord("\ue539") : "",
    ord("\ue53a") : "",
    ord("\ue53b") : "",
    ord("\ue53c") : "",
    ord("\ue53d") : "",
    ord("\ue53e") : "",
    ord("\ue53f") : "",
    ord("\ue540") : "",
    ord("\ue541") : "",
    ord("\ue542") : "",
    ord("\ue543") : "",
    ord("\ue544") : "",
    ord("\ue545") : "",
    ord("\ue546") : "",
    ord("\ue547") : "",
    ord("\ue548") : "",
    ord("\ue549") : "",
    ord("\ue54a") : "",
    ord("\ue54b") : "",
    ord("\ue54c") : "",
    ord("\ue54d") : "",
    ord("\ue54e") : "",
    ord("\ue54f") : "",
    ord("\ue550") : "",
    ord("\ue551") : "",
    ord("\ue552") : "",
    ord("\ue553") : "",
    ord("\ue554") : "",
    ord("\ue555") : "",
    ord("\ue556") : "",
    ord("\ue557") : "",
    ord("\ue558") : "",
    ord("\ue559") : "",
    ord("\ue55a") : "",
    ord("\ue55b") : "",
    ord("\ue55c") : "",
    ord("\ue55d") : "",
    ord("\ue55e") : "",
    ord("\ue55f") : "",
    ord("\ue560") : "",
    ord("\ue561") : "",
    ord("\ue562") : "",
    ord("\ue563") : "",
    ord("\ue564") : "",
    ord("\ue565") : "",
    ord("\ue566") : "",
    ord("\ue567") : "",
    ord("\ue568") : "",
    ord("\ue569") : "",
    ord("\ue56a") : "",
    ord("\ue56b") : "",
    ord("\ue56c") : "",
    ord("\ue56d") : "",
    ord("\ue56e") : "",
    ord("\ue56f") : "",
    ord("\ue570") : "",
    ord("\ue571") : "",
    ord("\ue572") : "",
    ord("\ue573") : "",
    ord("\ue574") : "",
    ord("\ue575") : "",
    ord("\ue576") : "",
    ord("\ue577") : "",
    ord("\ue578") : "",
    ord("\ue579") : "",
    ord("\ue57a") : "",
    ord("\ue57b") : "",
    ord("\ue57c") : "",
    ord("\ue57d") : "",
    ord("\ue57e") : "",
    ord("\ue57f") : "",
    ord("\ue580") : "",
    ord("\ue581") : "",
    ord("\ue582") : "",
    ord("\ue583") : "",
    ord("\ue584") : "",
    ord("\ue585") : "",
    ord("\ue586") : "",
    ord("\ue587") : "",
    ord("\ue588") : "",
    ord("\ue589") : "",
    ord("\ue58a") : "",
    ord("\ue58b") : "",
    ord("\ue58c") : "",
    ord("\ue58d") : "",
    ord("\ue58e") : "",
    ord("\ue58f") : "",
    ord("\ue590") : "",
    ord("\ue591") : "",
    ord("\ue592") : "",
    ord("\ue593") : "",
    ord("\ue594") : "",
    ord("\ue595") : "",
    ord("\ue596") : "",
    ord("\ue597") : "",
    ord("\ue598") : "",
    ord("\ue599") : "",
    ord("\ue59a") : "",
    ord("\ue59b") : "",
    ord("\ue59c") : "",
    ord("\ue59d") : "",
    ord("\ue59e") : "",
    ord("\ue59f") : "",
    ord("\ue5a0") : "",
    ord("\ue5a1") : "",
    ord("\ue5a2") : "",
    ord("\ue5a3") : "",
    ord("\ue5a4") : "",
    ord("\ue5a5") : "",
    ord("\ue5a6") : "",
    ord("\ue5a7") : "",
    ord("\ue5a8") : "",
    ord("\ue5a9") : "",
    ord("\ue5aa") : "",
    ord("\ue5ab") : "",
    ord("\ue5ac") : "",
    ord("\ue5ad") : "",
    ord("\ue5ae") : "",
    ord("\ue5af") : "",
    ord("\ue5b0") : "",
    ord("\ue5b1") : "",
    ord("\ue5b2") : "",
    ord("\ue5b3") : "",
    ord("\ue5b4") : "",
    ord("\ue5b5") : "",
    ord("\ue5b6") : "",
    ord("\ue5b7") : "",
    ord("\ue5b8") : "",
    ord("\ue5b9") : "",
    ord("\ue5ba") : "",
    ord("\ue5bb") : "",
    ord("\ue5bc") : "",
    ord("\ue5bd") : "",
    ord("\ue5be") : "",
    ord("\ue5bf") : "",
    ord("\ue5c0") : "",
    ord("\ue5c1") : "",
    ord("\ue5c2") : "",
    ord("\ue5c3") : "",
    ord("\ue5c4") : "",
    ord("\ue5c5") : "",
    ord("\ue5c6") : "",
    ord("\ue5c7") : "",
    ord("\ue5c8") : "",
    ord("\ue5c9") : "",
    ord("\ue5ca") : "",
    ord("\ue5cb") : "",
    ord("\ue5cc") : "",
    ord("\ue5cd") : "",
    ord("\ue5ce") : "",
    ord("\ue5cf") : "",
    ord("\ue5d0") : "",
    ord("\ue5d1") : "",
    ord("\ue5d2") : "",
    ord("\ue5d3") : "",
    ord("\ue5d4") : "",
    ord("\ue5d5") : "",
    ord("\ue5d6") : "",
    ord("\ue5d7") : "",
    ord("\ue5d8") : "",
    ord("\ue5d9") : "",
    ord("\ue5da") : "",
    ord("\ue5db") : "",
    ord("\ue5dc") : "",
    ord("\ue5dd") : "",
    ord("\ue5de") : "",
    ord("\ue5df") : "",
    ord("\ue5e0") : "",
    ord("\ue5e1") : "",
    ord("\ue5e2") : "",
    ord("\ue5e3") : "",
    ord("\ue5e4") : "",
    ord("\ue5e5") : "",
    ord("\ue5e6") : "",
    ord("\ue5e7") : "",
    ord("\ue5e8") : "",
    ord("\ue5e9") : "",
    ord("\ue5ea") : "",
    ord("\ue5eb") : "",
    ord("\ue5ec") : "",
    ord("\ue5ed") : "",
    ord("\ue5ee") : "",
    ord("\ue5ef") : "",
    ord("\ue5f0") : "",
    ord("\ue5f1") : "",
    ord("\ue5f2") : "",
    ord("\ue5f3") : "",
    ord("\ue5f4") : "",
    ord("\ue5f5") : "",
    ord("\ue5f6") : "",
    ord("\ue5f7") : "",
    ord("\ue5f8") : "",
    ord("\ue5f9") : "",
    ord("\ue5fa") : "",
    ord("\ue5fb") : "",
    ord("\ue5fc") : "",
    ord("\ue5fd") : "",
    ord("\ue5fe") : "",
    ord("\ue5ff") : "",
    ord("\ue600") : "",
    ord("\ue601") : "",
    ord("\ue602") : "",
    ord("\ue603") : "",
    ord("\ue604") : "",
    ord("\ue605") : "",
    ord("\ue606") : "",
    ord("\ue607") : "",
    ord("\ue608") : "",
    ord("\ue609") : "",
    ord("\ue60a") : "",
    ord("\ue60b") : "",
    ord("\ue60c") : "",
    ord("\ue60d") : "",
    ord("\ue60e") : "",
    ord("\ue60f") : "",
    ord("\ue610") : "",
    ord("\ue611") : "",
    ord("\ue612") : "",
    ord("\ue613") : "",
    ord("\ue614") : "",
    ord("\ue615") : "",
    ord("\ue616") : "",
    ord("\ue617") : "",
    ord("\ue618") : "",
    ord("\ue619") : "",
    ord("\ue61a") : "",
    ord("\ue61b") : "",
    ord("\ue61c") : "",
    ord("\ue61d") : "",
    ord("\ue61e") : "",
    ord("\ue61f") : "",
    ord("\ue620") : "",
    ord("\ue621") : "",
    ord("\ue622") : "",
    ord("\ue623") : "",
    ord("\ue624") : "",
    ord("\ue625") : "",
    ord("\ue626") : "",
    ord("\ue627") : "",
    ord("\ue628") : "",
    ord("\ue629") : "",
    ord("\ue62a") : "",
    ord("\ue62b") : "",
    ord("\ue62c") : "",
    ord("\ue62d") : "",
    ord("\ue62e") : "",
    ord("\ue62f") : "",
    ord("\ue630") : "",
    ord("\ue631") : "",
    ord("\ue632") : "",
    ord("\ue633") : "",
    ord("\ue634") : "",
    ord("\ue635") : "",
    ord("\ue636") : "",
    ord("\ue637") : "",
    ord("\ue638") : "",
    ord("\ue639") : "",
    ord("\ue63a") : "",
    ord("\ue63b") : "",
    ord("\ue63c") : "",
    ord("\ue63d") : "",
    ord("\ue63e") : "",
    ord("\ue63f") : "",
    ord("\ue640") : "",
    ord("\ue641") : "",
    ord("\ue642") : "",
    ord("\ue643") : "",
    ord("\ue644") : "",
    ord("\ue645") : "",
    ord("\ue646") : "",
    ord("\ue647") : "",
    ord("\ue648") : "",
    ord("\ue649") : "",
    ord("\ue64a") : "",
    ord("\ue64b") : "",
    ord("\ue64c") : "",
    ord("\ue64d") : "",
    ord("\ue64e") : "",
    ord("\ue64f") : "",
    ord("\ue650") : "",
    ord("\ue651") : "",
    ord("\ue652") : "",
    ord("\ue653") : "",
    ord("\ue654") : "",
    ord("\ue655") : "",
    ord("\ue656") : "",
    ord("\ue657") : "",
    ord("\ue658") : "",
    ord("\ue659") : "",
    ord("\ue65a") : "",
    ord("\ue65b") : "",
    ord("\ue65c") : "",
    ord("\ue65d") : "",
    ord("\ue65e") : "",
    ord("\ue65f") : "",
    ord("\ue660") : "",
    ord("\ue661") : "",
    ord("\ue662") : "",
    ord("\ue663") : "",
    ord("\ue664") : "",
    ord("\ue665") : "",
    ord("\ue666") : "",
    ord("\ue667") : "",
    ord("\ue668") : "",
    ord("\ue669") : "",
    ord("\ue66a") : "",
    ord("\ue66b") : "",
    ord("\ue66c") : "",
    ord("\ue66d") : "",
    ord("\ue66e") : "",
    ord("\ue66f") : "",
    ord("\ue670") : "",
    ord("\ue671") : "",
    ord("\ue672") : "",
    ord("\ue673") : "",
    ord("\ue674") : "",
    ord("\ue675") : "",
    ord("\ue676") : "",
    ord("\ue677") : "",
    ord("\ue678") : "",
    ord("\ue679") : "",
    ord("\ue67a") : "",
    ord("\ue67b") : "",
    ord("\ue67c") : "",
    ord("\ue67d") : "",
    ord("\ue67e") : "",
    ord("\ue67f") : "",
    ord("\ue680") : "",
    ord("\ue681") : "",
    ord("\ue682") : "",
    ord("\ue683") : "",
    ord("\ue684") : "",
    ord("\ue685") : "",
    ord("\ue686") : "",
    ord("\ue687") : "",
    ord("\ue688") : "",
    ord("\ue689") : "",
    ord("\ue68a") : "",
    ord("\ue68b") : "",
    ord("\ue68c") : "",
    ord("\ue68d") : "",
    ord("\ue68e") : "",
    ord("\ue68f") : "",
    ord("\ue690") : "",
    ord("\ue691") : "",
    ord("\ue692") : "",
    ord("\ue693") : "",
    ord("\ue694") : "",
    ord("\ue695") : "",
    ord("\ue696") : "",
    ord("\ue697") : "",
    ord("\ue698") : "",
    ord("\ue699") : "",
    ord("\ue69a") : "",
    ord("\ue69b") : "",
    ord("\ue69c") : "",
    ord("\ue69d") : "",
    ord("\ue69e") : "",
    ord("\ue69f") : "",
    ord("\ue6a0") : "",
    ord("\ue6a1") : "",
    ord("\ue6a2") : "",
    ord("\ue6a3") : "",
    ord("\ue6a4") : "",
    ord("\ue6a5") : "",
    ord("\ue6a6") : "",
    ord("\ue6a7") : "",
    ord("\ue6a8") : "",
    ord("\ue6a9") : "",
    ord("\ue6aa") : "",
    ord("\ue6ab") : "",
    ord("\ue6ac") : "",
    ord("\ue6ad") : "",
    ord("\ue6ae") : "",
    ord("\ue6af") : "",
    ord("\ue6b0") : "",
    ord("\ue6b1") : "",
    ord("\ue6b2") : "",
    ord("\ue6b3") : "",
    ord("\ue6b4") : "",
    ord("\ue6b5") : "",
    ord("\ue6b6") : "",
    ord("\ue6b7") : "",
    ord("\ue6b8") : "",
    ord("\ue6b9") : "",
    ord("\ue6ba") : "",
    ord("\ue6bb") : "",
    ord("\ue6bc") : "",
    ord("\ue6bd") : "",
    ord("\ue6be") : "",
    ord("\ue6bf") : "",
    ord("\ue6c0") : "",
    ord("\ue6c1") : "",
    ord("\ue6c2") : "",
    ord("\ue6c3") : "",
    ord("\ue6c4") : "",
    ord("\ue6c5") : "",
    ord("\ue6c6") : "",
    ord("\ue6c7") : "",
    ord("\ue6c8") : "",
    ord("\ue6c9") : "",
    ord("\ue6ca") : "",
    ord("\ue6cb") : "",
    ord("\ue6cc") : "",
    ord("\ue6cd") : "",
    ord("\ue6ce") : "",
    ord("\ue6cf") : "",
    ord("\ue6d0") : "",
    ord("\ue6d1") : "",
    ord("\ue6d2") : "",
    ord("\ue6d3") : "",
    ord("\ue6d4") : "",
    ord("\ue6d5") : "",
    ord("\ue6d6") : "",
    ord("\ue6d7") : "",
    ord("\ue6d8") : "",
    ord("\ue6d9") : "",
    ord("\ue6da") : "",
    ord("\ue6db") : "",
    ord("\ue6dc") : "",
    ord("\ue6dd") : "",
    ord("\ue6de") : "",
    ord("\ue6df") : "",
    ord("\ue6e0") : "",
    ord("\ue6e1") : "",
    ord("\ue6e2") : "",
    ord("\ue6e3") : "",
    ord("\ue6e4") : "",
    ord("\ue6e5") : "",
    ord("\ue6e6") : "",
    ord("\ue6e7") : "",
    ord("\ue6e8") : "",
    ord("\ue6e9") : "",
    ord("\ue6ea") : "",
    ord("\ue6eb") : "",
    ord("\ue6ec") : "",
    ord("\ue6ed") : "",
    ord("\ue6ee") : "",
    ord("\ue6ef") : "",
    ord("\ue6f0") : "",
    ord("\ue6f1") : "",
    ord("\ue6f2") : "",
    ord("\ue6f3") : "",
    ord("\ue6f4") : "",
    ord("\ue6f5") : "",
    ord("\ue6f6") : "",
    ord("\ue6f7") : "",
    ord("\ue6f8") : "",
    ord("\ue6f9") : "",
    ord("\ue6fa") : "",
    ord("\ue6fb") : "",
    ord("\ue6fc") : "",
    ord("\ue6fd") : "",
    ord("\ue6fe") : "",
    ord("\ue6ff") : "",
    ord("\ue700") : "",
    ord("\ue701") : "",
    ord("\ue702") : "",
    ord("\ue703") : "",
    ord("\ue704") : "",
    ord("\ue705") : "",
    ord("\ue706") : "",
    ord("\ue707") : "",
    ord("\ue708") : "",
    ord("\ue709") : "",
    ord("\ue70a") : "",
    ord("\ue70b") : "",
    ord("\ue70c") : "",
    ord("\ue70d") : "",
    ord("\ue70e") : "",
    ord("\ue70f") : "",
    ord("\ue710") : "",
    ord("\ue711") : "",
    ord("\ue712") : "",
    ord("\ue713") : "",
    ord("\ue714") : "",
    ord("\ue715") : "",
    ord("\ue716") : "",
    ord("\ue717") : "",
    ord("\ue718") : "",
    ord("\ue719") : "",
    ord("\ue71a") : "",
    ord("\ue71b") : "",
    ord("\ue71c") : "",
    ord("\ue71d") : "",
    ord("\ue71e") : "",
    ord("\ue71f") : "",
    ord("\ue720") : "",
    ord("\ue721") : "",
    ord("\ue722") : "",
    ord("\ue723") : "",
    ord("\ue724") : "",
    ord("\ue725") : "",
    ord("\ue726") : "",
    ord("\ue727") : "",
    ord("\ue728") : "",
    ord("\ue729") : "",
    ord("\ue72a") : "",
    ord("\ue72b") : "",
    ord("\ue72c") : "",
    ord("\ue72d") : "",
    ord("\ue72e") : "",
    ord("\ue72f") : "",
    ord("\ue730") : "",
    ord("\ue731") : "",
    ord("\ue732") : "",
    ord("\ue733") : "",
    ord("\ue734") : "",
    ord("\ue735") : "",
    ord("\ue736") : "",
    ord("\ue737") : "",
    ord("\ue738") : "",
    ord("\ue739") : "",
    ord("\ue73a") : "",
    ord("\ue73b") : "",
    ord("\ue73c") : "",
    ord("\ue73d") : "",
    ord("\ue73e") : "",
    ord("\ue73f") : "",
    ord("\ue740") : "",
    ord("\ue741") : "",
    ord("\ue742") : "",
    ord("\ue743") : "",
    ord("\ue744") : "",
    ord("\ue745") : "",
    ord("\ue746") : "",
    ord("\ue747") : "",
    ord("\ue748") : "",
    ord("\ue749") : "",
    ord("\ue74a") : "",
    ord("\ue74b") : "",
    ord("\ue74c") : "",
    ord("\ue74d") : "",
    ord("\ue74e") : "",
    ord("\ue74f") : "",
    ord("\ue750") : "",
    ord("\ue751") : "",
    ord("\ue752") : "",
    ord("\ue753") : "",
    ord("\ue754") : "",
    ord("\ue755") : "",
    ord("\ue756") : "",
    ord("\ue757") : "",
    ord("\ue758") : "",
    ord("\ue759") : "",
    ord("\ue75a") : "",
    ord("\ue75b") : "",
    ord("\ue75c") : "",
    ord("\ue75d") : "",
    ord("\ue75e") : "",
    ord("\ue75f") : "",
    ord("\ue760") : "",
    ord("\ue761") : "",
    ord("\ue762") : "",
    ord("\ue763") : "",
    ord("\ue764") : "",
    ord("\ue765") : "",
    ord("\ue766") : "",
    ord("\ue767") : "",
    ord("\ue768") : "",
    ord("\ue769") : "",
    ord("\ue76a") : "",
    ord("\ue76b") : "",
    ord("\ue76c") : "",
    ord("\ue76d") : "",
    ord("\ue76e") : "",
    ord("\ue76f") : "",
    ord("\ue770") : "",
    ord("\ue771") : "",
    ord("\ue772") : "",
    ord("\ue773") : "",
    ord("\ue774") : "",
    ord("\ue775") : "",
    ord("\ue776") : "",
    ord("\ue777") : "",
    ord("\ue778") : "",
    ord("\ue779") : "",
    ord("\ue77a") : "",
    ord("\ue77b") : "",
    ord("\ue77c") : "",
    ord("\ue77d") : "",
    ord("\ue77e") : "",
    ord("\ue77f") : "",
    ord("\ue780") : "",
    ord("\ue781") : "",
    ord("\ue782") : "",
    ord("\ue783") : "",
    ord("\ue784") : "",
    ord("\ue785") : "",
    ord("\ue786") : "",
    ord("\ue787") : "",
    ord("\ue788") : "",
    ord("\ue789") : "",
    ord("\ue78a") : "",
    ord("\ue78b") : "",
    ord("\ue78c") : "",
    ord("\ue78d") : "",
    ord("\ue78e") : "",
    ord("\ue78f") : "",
    ord("\ue790") : "",
    ord("\ue791") : "",
    ord("\ue792") : "",
    ord("\ue793") : "",
    ord("\ue794") : "",
    ord("\ue795") : "",
    ord("\ue796") : "",
    ord("\ue797") : "",
    ord("\ue798") : "",
    ord("\ue799") : "",
    ord("\ue79a") : "",
    ord("\ue79b") : "",
    ord("\ue79c") : "",
    ord("\ue79d") : "",
    ord("\ue79e") : "",
    ord("\ue79f") : "",
    ord("\ue7a0") : "",
    ord("\ue7a1") : "",
    ord("\ue7a2") : "",
    ord("\ue7a3") : "",
    ord("\ue7a4") : "",
    ord("\ue7a5") : "",
    ord("\ue7a6") : "",
    ord("\ue7a7") : "",
    ord("\ue7a8") : "",
    ord("\ue7a9") : "",
    ord("\ue7aa") : "",
    ord("\ue7ab") : "",
    ord("\ue7ac") : "",
    ord("\ue7ad") : "",
    ord("\ue7ae") : "",
    ord("\ue7af") : "",
    ord("\ue7b0") : "",
    ord("\ue7b1") : "",
    ord("\ue7b2") : "",
    ord("\ue7b3") : "",
    ord("\ue7b4") : "",
    ord("\ue7b5") : "",
    ord("\ue7b6") : "",
    ord("\ue7b7") : "",
    ord("\ue7b8") : "",
    ord("\ue7b9") : "",
    ord("\ue7ba") : "",
    ord("\ue7bb") : "",
    ord("\ue7bc") : "",
    ord("\ue7bd") : "",
    ord("\ue7be") : "",
    ord("\ue7bf") : "",
    ord("\ue7c0") : "",
    ord("\ue7c1") : "",
    ord("\ue7c2") : "",
    ord("\ue7c3") : "",
    ord("\ue7c4") : "",
    ord("\ue7c5") : "",
    ord("\ue7c6") : "",
    ord("\ue7c7") : "",
    ord("\ue7c8") : "",
    ord("\ue7c9") : "",
    ord("\ue7ca") : "",
    ord("\ue7cb") : "",
    ord("\ue7cc") : "",
    ord("\ue7cd") : "",
    ord("\ue7ce") : "",
    ord("\ue7cf") : "",
    ord("\ue7d0") : "",
    ord("\ue7d1") : "",
    ord("\ue7d2") : "",
    ord("\ue7d3") : "",
    ord("\ue7d4") : "",
    ord("\ue7d5") : "",
    ord("\ue7d6") : "",
    ord("\ue7d7") : "",
    ord("\ue7d8") : "",
    ord("\ue7d9") : "",
    ord("\ue7da") : "",
    ord("\ue7db") : "",
    ord("\ue7dc") : "",
    ord("\ue7dd") : "",
    ord("\ue7de") : "",
    ord("\ue7df") : "",
    ord("\ue7e0") : "",
    ord("\ue7e1") : "",
    ord("\ue7e2") : "",
    ord("\ue7e3") : "",
    ord("\ue7e4") : "",
    ord("\ue7e5") : "",
    ord("\ue7e6") : "",
    ord("\ue7e7") : "",
    ord("\ue7e8") : "",
    ord("\ue7e9") : "",
    ord("\ue7ea") : "",
    ord("\ue7eb") : "",
    ord("\ue7ec") : "",
    ord("\ue7ed") : "",
    ord("\ue7ee") : "",
    ord("\ue7ef") : "",
    ord("\ue7f0") : "",
    ord("\ue7f1") : "",
    ord("\ue7f2") : "",
    ord("\ue7f3") : "",
    ord("\ue7f4") : "",
    ord("\ue7f5") : "",
    ord("\ue7f6") : "",
    ord("\ue7f7") : "",
    ord("\ue7f8") : "",
    ord("\ue7f9") : "",
    ord("\ue7fa") : "",
    ord("\ue7fb") : "",
    ord("\ue7fc") : "",
    ord("\ue7fd") : "",
    ord("\ue7fe") : "",
    ord("\ue7ff") : "",
    ord("\ue800") : "",
    ord("\ue801") : "",
    ord("\ue802") : "",
    ord("\ue803") : "",
    ord("\ue804") : "",
    ord("\ue805") : "",
    ord("\ue806") : "",
    ord("\ue807") : "",
    ord("\ue808") : "",
    ord("\ue809") : "",
    ord("\ue80a") : "",
    ord("\ue80b") : "",
    ord("\ue80c") : "",
    ord("\ue80d") : "",
    ord("\ue80e") : "",
    ord("\ue80f") : "",
    ord("\ue810") : "",
    ord("\ue811") : "",
    ord("\ue812") : "",
    ord("\ue813") : "",
    ord("\ue814") : "",
    ord("\ue815") : "",
    ord("\ue816") : "",
    ord("\ue817") : "",
    ord("\ue818") : "",
    ord("\ue819") : "",
    ord("\ue81a") : "",
    ord("\ue81b") : "",
    ord("\ue81c") : "",
    ord("\ue81d") : "",
    ord("\ue81e") : "",
    ord("\ue81f") : "",
    ord("\ue820") : "",
    ord("\ue821") : "",
    ord("\ue822") : "",
    ord("\ue823") : "",
    ord("\ue824") : "",
    ord("\ue825") : "",
    ord("\ue826") : "",
    ord("\ue827") : "",
    ord("\ue828") : "",
    ord("\ue829") : "",
    ord("\ue82a") : "",
    ord("\ue82b") : "",
    ord("\ue82c") : "",
    ord("\ue82d") : "",
    ord("\ue82e") : "",
    ord("\ue82f") : "",
    ord("\ue830") : "",
    ord("\ue831") : "",
    ord("\ue832") : "",
    ord("\ue833") : "",
    ord("\ue834") : "",
    ord("\ue835") : "",
    ord("\ue836") : "",
    ord("\ue837") : "",
    ord("\ue838") : "",
    ord("\ue839") : "",
    ord("\ue83a") : "",
    ord("\ue83b") : "",
    ord("\ue83c") : "",
    ord("\ue83d") : "",
    ord("\ue83e") : "",
    ord("\ue83f") : "",
    ord("\ue840") : "",
    ord("\ue841") : "",
    ord("\ue842") : "",
    ord("\ue843") : "",
    ord("\ue844") : "",
    ord("\ue845") : "",
    ord("\ue846") : "",
    ord("\ue847") : "",
    ord("\ue848") : "",
    ord("\ue849") : "",
    ord("\ue84a") : "",
    ord("\ue84b") : "",
    ord("\ue84c") : "",
    ord("\ue84d") : "",
    ord("\ue84e") : "",
    ord("\ue84f") : "",
    ord("\ue850") : "",
    ord("\ue851") : "",
    ord("\ue852") : "",
    ord("\ue853") : "",
    ord("\ue854") : "",
    ord("\ue855") : "",
    ord("\ue856") : "",
    ord("\ue857") : "",
    ord("\ue858") : "",
    ord("\ue859") : "",
    ord("\ue85a") : "",
    ord("\ue85b") : "",
    ord("\ue85c") : "",
    ord("\ue85d") : "",
    ord("\ue85e") : "",
    ord("\ue85f") : "",
    ord("\ue860") : "",
    ord("\ue861") : "",
    ord("\ue862") : "",
    ord("\ue863") : "",
    ord("\ue864") : "",
    ord("\ue865") : "",
    ord("\ue866") : "",
    ord("\ue867") : "",
    ord("\ue868") : "",
    ord("\ue869") : "",
    ord("\ue86a") : "",
    ord("\ue86b") : "",
    ord("\ue86c") : "",
    ord("\ue86d") : "",
    ord("\ue86e") : "",
    ord("\ue86f") : "",
    ord("\ue870") : "",
    ord("\ue871") : "",
    ord("\ue872") : "",
    ord("\ue873") : "",
    ord("\ue874") : "",
    ord("\ue875") : "",
    ord("\ue876") : "",
    ord("\ue877") : "",
    ord("\ue878") : "",
    ord("\ue879") : "",
    ord("\ue87a") : "",
    ord("\ue87b") : "",
    ord("\ue87c") : "",
    ord("\ue87d") : "",
    ord("\ue87e") : "",
    ord("\ue87f") : "",
    ord("\ue880") : "",
    ord("\ue881") : "",
    ord("\ue882") : "",
    ord("\ue883") : "",
    ord("\ue884") : "",
    ord("\ue885") : "",
    ord("\ue886") : "",
    ord("\ue887") : "",
    ord("\ue888") : "",
    ord("\ue889") : "",
    ord("\ue88a") : "",
    ord("\ue88b") : "",
    ord("\ue88c") : "",
    ord("\ue88d") : "",
    ord("\ue88e") : "",
    ord("\ue88f") : "",
    ord("\ue890") : "",
    ord("\ue891") : "",
    ord("\ue892") : "",
    ord("\ue893") : "",
    ord("\ue894") : "",
    ord("\ue895") : "",
    ord("\ue896") : "",
    ord("\ue897") : "",
    ord("\ue898") : "",
    ord("\ue899") : "",
    ord("\ue89a") : "",
    ord("\ue89b") : "",
    ord("\ue89c") : "",
    ord("\ue89d") : "",
    ord("\ue89e") : "",
    ord("\ue89f") : "",
    ord("\ue8a0") : "",
    ord("\ue8a1") : "",
    ord("\ue8a2") : "",
    ord("\ue8a3") : "",
    ord("\ue8a4") : "",
    ord("\ue8a5") : "",
    ord("\ue8a6") : "",
    ord("\ue8a7") : "",
    ord("\ue8a8") : "",
    ord("\ue8a9") : "",
    ord("\ue8aa") : "",
    ord("\ue8ab") : "",
    ord("\ue8ac") : "",
    ord("\ue8ad") : "",
    ord("\ue8ae") : "",
    ord("\ue8af") : "",
    ord("\ue8b0") : "",
    ord("\ue8b1") : "",
    ord("\ue8b2") : "",
    ord("\ue8b3") : "",
    ord("\ue8b4") : "",
    ord("\ue8b5") : "",
    ord("\ue8b6") : "",
    ord("\ue8b7") : "",
    ord("\ue8b8") : "",
    ord("\ue8b9") : "",
    ord("\ue8ba") : "",
    ord("\ue8bb") : "",
    ord("\ue8bc") : "",
    ord("\ue8bd") : "",
    ord("\ue8be") : "",
    ord("\ue8bf") : "",
    ord("\ue8c0") : "",
    ord("\ue8c1") : "",
    ord("\ue8c2") : "",
    ord("\ue8c3") : "",
    ord("\ue8c4") : "",
    ord("\ue8c5") : "",
    ord("\ue8c6") : "",
    ord("\ue8c7") : "",
    ord("\ue8c8") : "",
    ord("\ue8c9") : "",
    ord("\ue8ca") : "",
    ord("\ue8cb") : "",
    ord("\ue8cc") : "",
    ord("\ue8cd") : "",
    ord("\ue8ce") : "",
    ord("\ue8cf") : "",
    ord("\ue8d0") : "",
    ord("\ue8d1") : "",
    ord("\ue8d2") : "",
    ord("\ue8d3") : "",
    ord("\ue8d4") : "",
    ord("\ue8d5") : "",
    ord("\ue8d6") : "",
    ord("\ue8d7") : "",
    ord("\ue8d8") : "",
    ord("\ue8d9") : "",
    ord("\ue8da") : "",
    ord("\ue8db") : "",
    ord("\ue8dc") : "",
    ord("\ue8dd") : "",
    ord("\ue8de") : "",
    ord("\ue8df") : "",
    ord("\ue8e0") : "",
    ord("\ue8e1") : "",
    ord("\ue8e2") : "",
    ord("\ue8e3") : "",
    ord("\ue8e4") : "",
    ord("\ue8e5") : "",
    ord("\ue8e6") : "",
    ord("\ue8e7") : "",
    ord("\ue8e8") : "",
    ord("\ue8e9") : "",
    ord("\ue8ea") : "",
    ord("\ue8eb") : "",
    ord("\ue8ec") : "",
    ord("\ue8ed") : "",
    ord("\ue8ee") : "",
    ord("\ue8ef") : "",
    ord("\ue8f0") : "",
    ord("\ue8f1") : "",
    ord("\ue8f2") : "",
    ord("\ue8f3") : "",
    ord("\ue8f4") : "",
    ord("\ue8f5") : "",
    ord("\ue8f6") : "",
    ord("\ue8f7") : "",
    ord("\ue8f8") : "",
    ord("\ue8f9") : "",
    ord("\ue8fa") : "",
    ord("\ue8fb") : "",
    ord("\ue8fc") : "",
    ord("\ue8fd") : "",
    ord("\ue8fe") : "",
    ord("\ue8ff") : "",
    ord("\ue900") : "",
    ord("\ue901") : "",
    ord("\ue902") : "",
    ord("\ue903") : "",
    ord("\ue904") : "",
    ord("\ue905") : "",
    ord("\ue906") : "",
    ord("\ue907") : "",
    ord("\ue908") : "",
    ord("\ue909") : "",
    ord("\ue90a") : "",
    ord("\ue90b") : "",
    ord("\ue90c") : "",
    ord("\ue90d") : "",
    ord("\ue90e") : "",
    ord("\ue90f") : "",
    ord("\ue910") : "",
    ord("\ue911") : "",
    ord("\ue912") : "",
    ord("\ue913") : "",
    ord("\ue914") : "",
    ord("\ue915") : "",
    ord("\ue916") : "",
    ord("\ue917") : "",
    ord("\ue918") : "",
    ord("\ue919") : "",
    ord("\ue91a") : "",
    ord("\ue91b") : "",
    ord("\ue91c") : "",
    ord("\ue91d") : "",
    ord("\ue91e") : "",
    ord("\ue91f") : "",
    ord("\ue920") : "",
    ord("\ue921") : "",
    ord("\ue922") : "",
    ord("\ue923") : "",
    ord("\ue924") : "",
    ord("\ue925") : "",
    ord("\ue926") : "",
    ord("\ue927") : "",
    ord("\ue928") : "",
    ord("\ue929") : "",
    ord("\ue92a") : "",
    ord("\ue92b") : "",
    ord("\ue92c") : "",
    ord("\ue92d") : "",
    ord("\ue92e") : "",
    ord("\ue92f") : "",
    ord("\ue930") : "",
    ord("\ue931") : "",
    ord("\ue932") : "",
    ord("\ue933") : "",
    ord("\ue934") : "",
    ord("\ue935") : "",
    ord("\ue936") : "",
    ord("\ue937") : "",
    ord("\ue938") : "",
    ord("\ue939") : "",
    ord("\ue93a") : "",
    ord("\ue93b") : "",
    ord("\ue93c") : "",
    ord("\ue93d") : "",
    ord("\ue93e") : "",
    ord("\ue93f") : "",
    ord("\ue940") : "",
    ord("\ue941") : "",
    ord("\ue942") : "",
    ord("\ue943") : "",
    ord("\ue944") : "",
    ord("\ue945") : "",
    ord("\ue946") : "",
    ord("\ue947") : "",
    ord("\ue948") : "",
    ord("\ue949") : "",
    ord("\ue94a") : "",
    ord("\ue94b") : "",
    ord("\ue94c") : "",
    ord("\ue94d") : "",
    ord("\ue94e") : "",
    ord("\ue94f") : "",
    ord("\ue950") : "",
    ord("\ue951") : "",
    ord("\ue952") : "",
    ord("\ue953") : "",
    ord("\ue954") : "",
    ord("\ue955") : "",
    ord("\ue956") : "",
    ord("\ue957") : "",
    ord("\ue958") : "",
    ord("\ue959") : "",
    ord("\ue95a") : "",
    ord("\ue95b") : "",
    ord("\ue95c") : "",
    ord("\ue95d") : "",
    ord("\ue95e") : "",
    ord("\ue95f") : "",
    ord("\ue960") : "",
    ord("\ue961") : "",
    ord("\ue962") : "",
    ord("\ue963") : "",
    ord("\ue964") : "",
    ord("\ue965") : "",
    ord("\ue966") : "",
    ord("\ue967") : "",
    ord("\ue968") : "",
    ord("\ue969") : "",
    ord("\ue96a") : "",
    ord("\ue96b") : "",
    ord("\ue96c") : "",
    ord("\ue96d") : "",
    ord("\ue96e") : "",
    ord("\ue96f") : "",
    ord("\ue970") : "",
    ord("\ue971") : "",
    ord("\ue972") : "",
    ord("\ue973") : "",
    ord("\ue974") : "",
    ord("\ue975") : "",
    ord("\ue976") : "",
    ord("\ue977") : "",
    ord("\ue978") : "",
    ord("\ue979") : "",
    ord("\ue97a") : "",
    ord("\ue97b") : "",
    ord("\ue97c") : "",
    ord("\ue97d") : "",
    ord("\ue97e") : "",
    ord("\ue97f") : "",
    ord("\ue980") : "",
    ord("\ue981") : "",
    ord("\ue982") : "",
    ord("\ue983") : "",
    ord("\ue984") : "",
    ord("\ue985") : "",
    ord("\ue986") : "",
    ord("\ue987") : "",
    ord("\ue988") : "",
    ord("\ue989") : "",
    ord("\ue98a") : "",
    ord("\ue98b") : "",
    ord("\ue98c") : "",
    ord("\ue98d") : "",
    ord("\ue98e") : "",
    ord("\ue98f") : "",
    ord("\ue990") : "",
    ord("\ue991") : "",
    ord("\ue992") : "",
    ord("\ue993") : "",
    ord("\ue994") : "",
    ord("\ue995") : "",
    ord("\ue996") : "",
    ord("\ue997") : "",
    ord("\ue998") : "",
    ord("\ue999") : "",
    ord("\ue99a") : "",
    ord("\ue99b") : "",
    ord("\ue99c") : "",
    ord("\ue99d") : "",
    ord("\ue99e") : "",
    ord("\ue99f") : "",
    ord("\ue9a0") : "",
    ord("\ue9a1") : "",
    ord("\ue9a2") : "",
    ord("\ue9a3") : "",
    ord("\ue9a4") : "",
    ord("\ue9a5") : "",
    ord("\ue9a6") : "",
    ord("\ue9a7") : "",
    ord("\ue9a8") : "",
    ord("\ue9a9") : "",
    ord("\ue9aa") : "",
    ord("\ue9ab") : "",
    ord("\ue9ac") : "",
    ord("\ue9ad") : "",
    ord("\ue9ae") : "",
    ord("\ue9af") : "",
    ord("\ue9b0") : "",
    ord("\ue9b1") : "",
    ord("\ue9b2") : "",
    ord("\ue9b3") : "",
    ord("\ue9b4") : "",
    ord("\ue9b5") : "",
    ord("\ue9b6") : "",
    ord("\ue9b7") : "",
    ord("\ue9b8") : "",
    ord("\ue9b9") : "",
    ord("\ue9ba") : "",
    ord("\ue9bb") : "",
    ord("\ue9bc") : "",
    ord("\ue9bd") : "",
    ord("\ue9be") : "",
    ord("\ue9bf") : "",
    ord("\ue9c0") : "",
    ord("\ue9c1") : "",
    ord("\ue9c2") : "",
    ord("\ue9c3") : "",
    ord("\ue9c4") : "",
    ord("\ue9c5") : "",
    ord("\ue9c6") : "",
    ord("\ue9c7") : "",
    ord("\ue9c8") : "",
    ord("\ue9c9") : "",
    ord("\ue9ca") : "",
    ord("\ue9cb") : "",
    ord("\ue9cc") : "",
    ord("\ue9cd") : "",
    ord("\ue9ce") : "",
    ord("\ue9cf") : "",
    ord("\ue9d0") : "",
    ord("\ue9d1") : "",
    ord("\ue9d2") : "",
    ord("\ue9d3") : "",
    ord("\ue9d4") : "",
    ord("\ue9d5") : "",
    ord("\ue9d6") : "",
    ord("\ue9d7") : "",
    ord("\ue9d8") : "",
    ord("\ue9d9") : "",
    ord("\ue9da") : "",
    ord("\ue9db") : "",
    ord("\ue9dc") : "",
    ord("\ue9dd") : "",
    ord("\ue9de") : "",
    ord("\ue9df") : "",
    ord("\ue9e0") : "",
    ord("\ue9e1") : "",
    ord("\ue9e2") : "",
    ord("\ue9e3") : "",
    ord("\ue9e4") : "",
    ord("\ue9e5") : "",
    ord("\ue9e6") : "",
    ord("\ue9e7") : "",
    ord("\ue9e8") : "",
    ord("\ue9e9") : "",
    ord("\ue9ea") : "",
    ord("\ue9eb") : "",
    ord("\ue9ec") : "",
    ord("\ue9ed") : "",
    ord("\ue9ee") : "",
    ord("\ue9ef") : "",
    ord("\ue9f0") : "",
    ord("\ue9f1") : "",
    ord("\ue9f2") : "",
    ord("\ue9f3") : "",
    ord("\ue9f4") : "",
    ord("\ue9f5") : "",
    ord("\ue9f6") : "",
    ord("\ue9f7") : "",
    ord("\ue9f8") : "",
    ord("\ue9f9") : "",
    ord("\ue9fa") : "",
    ord("\ue9fb") : "",
    ord("\ue9fc") : "",
    ord("\ue9fd") : "",
    ord("\ue9fe") : "",
    ord("\ue9ff") : "",
    ord("\uea00") : "",
    ord("\uea01") : "",
    ord("\uea02") : "",
    ord("\uea03") : "",
    ord("\uea04") : "",
    ord("\uea05") : "",
    ord("\uea06") : "",
    ord("\uea07") : "",
    ord("\uea08") : "",
    ord("\uea09") : "",
    ord("\uea0a") : "",
    ord("\uea0b") : "",
    ord("\uea0c") : "",
    ord("\uea0d") : "",
    ord("\uea0e") : "",
    ord("\uea0f") : "",
    ord("\uea10") : "",
    ord("\uea11") : "",
    ord("\uea12") : "",
    ord("\uea13") : "",
    ord("\uea14") : "",
    ord("\uea15") : "",
    ord("\uea16") : "",
    ord("\uea17") : "",
    ord("\uea18") : "",
    ord("\uea19") : "",
    ord("\uea1a") : "",
    ord("\uea1b") : "",
    ord("\uea1c") : "",
    ord("\uea1d") : "",
    ord("\uea1e") : "",
    ord("\uea1f") : "",
    ord("\uea20") : "",
    ord("\uea21") : "",
    ord("\uea22") : "",
    ord("\uea23") : "",
    ord("\uea24") : "",
    ord("\uea25") : "",
    ord("\uea26") : "",
    ord("\uea27") : "",
    ord("\uea28") : "",
    ord("\uea29") : "",
    ord("\uea2a") : "",
    ord("\uea2b") : "",
    ord("\uea2c") : "",
    ord("\uea2d") : "",
    ord("\uea2e") : "",
    ord("\uea2f") : "",
    ord("\uea30") : "",
    ord("\uea31") : "",
    ord("\uea32") : "",
    ord("\uea33") : "",
    ord("\uea34") : "",
    ord("\uea35") : "",
    ord("\uea36") : "",
    ord("\uea37") : "",
    ord("\uea38") : "",
    ord("\uea39") : "",
    ord("\uea3a") : "",
    ord("\uea3b") : "",
    ord("\uea3c") : "",
    ord("\uea3d") : "",
    ord("\uea3e") : "",
    ord("\uea3f") : "",
    ord("\uea40") : "",
    ord("\uea41") : "",
    ord("\uea42") : "",
    ord("\uea43") : "",
    ord("\uea44") : "",
    ord("\uea45") : "",
    ord("\uea46") : "",
    ord("\uea47") : "",
    ord("\uea48") : "",
    ord("\uea49") : "",
    ord("\uea4a") : "",
    ord("\uea4b") : "",
    ord("\uea4c") : "",
    ord("\uea4d") : "",
    ord("\uea4e") : "",
    ord("\uea4f") : "",
    ord("\uea50") : "",
    ord("\uea51") : "",
    ord("\uea52") : "",
    ord("\uea53") : "",
    ord("\uea54") : "",
    ord("\uea55") : "",
    ord("\uea56") : "",
    ord("\uea57") : "",
    ord("\uea58") : "",
    ord("\uea59") : "",
    ord("\uea5a") : "",
    ord("\uea5b") : "",
    ord("\uea5c") : "",
    ord("\uea5d") : "",
    ord("\uea5e") : "",
    ord("\uea5f") : "",
    ord("\uea60") : "",
    ord("\uea61") : "",
    ord("\uea62") : "",
    ord("\uea63") : "",
    ord("\uea64") : "",
    ord("\uea65") : "",
    ord("\uea66") : "",
    ord("\uea67") : "",
    ord("\uea68") : "",
    ord("\uea69") : "",
    ord("\uea6a") : "",
    ord("\uea6b") : "",
    ord("\uea6c") : "",
    ord("\uea6d") : "",
    ord("\uea6e") : "",
    ord("\uea6f") : "",
    ord("\uea70") : "",
    ord("\uea71") : "",
    ord("\uea72") : "",
    ord("\uea73") : "",
    ord("\uea74") : "",
    ord("\uea75") : "",
    ord("\uea76") : "",
    ord("\uea77") : "",
    ord("\uea78") : "",
    ord("\uea79") : "",
    ord("\uea7a") : "",
    ord("\uea7b") : "",
    ord("\uea7c") : "",
    ord("\uea7d") : "",
    ord("\uea7e") : "",
    ord("\uea7f") : "",
    ord("\uea80") : "",
    ord("\uea81") : "",
    ord("\uea82") : "",
    ord("\uea83") : "",
    ord("\uea84") : "",
    ord("\uea85") : "",
    ord("\uea86") : "",
    ord("\uea87") : "",
    ord("\uea88") : "",
    ord("\uea89") : "",
    ord("\uea8a") : "",
    ord("\uea8b") : "",
    ord("\uea8c") : "",
    ord("\uea8d") : "",
    ord("\uea8e") : "",
    ord("\uea8f") : "",
    ord("\uea90") : "",
    ord("\uea91") : "",
    ord("\uea92") : "",
    ord("\uea93") : "",
    ord("\uea94") : "",
    ord("\uea95") : "",
    ord("\uea96") : "",
    ord("\uea97") : "",
    ord("\uea98") : "",
    ord("\uea99") : "",
    ord("\uea9a") : "",
    ord("\uea9b") : "",
    ord("\uea9c") : "",
    ord("\uea9d") : "",
    ord("\uea9e") : "",
    ord("\uea9f") : "",
    ord("\ueaa0") : "",
    ord("\ueaa1") : "",
    ord("\ueaa2") : "",
    ord("\ueaa3") : "",
    ord("\ueaa4") : "",
    ord("\ueaa5") : "",
    ord("\ueaa6") : "",
    ord("\ueaa7") : "",
    ord("\ueaa8") : "",
    ord("\ueaa9") : "",
    ord("\ueaaa") : "",
    ord("\ueaab") : "",
    ord("\ueaac") : "",
    ord("\ueaad") : "",
    ord("\ueaae") : "",
    ord("\ueaaf") : "",
    ord("\ueab0") : "",
    ord("\ueab1") : "",
    ord("\ueab2") : "",
    ord("\ueab3") : "",
    ord("\ueab4") : "",
    ord("\ueab5") : "",
    ord("\ueab6") : "",
    ord("\ueab7") : "",
    ord("\ueab8") : "",
    ord("\ueab9") : "",
    ord("\ueaba") : "",
    ord("\ueabb") : "",
    ord("\ueabc") : "",
    ord("\ueabd") : "",
    ord("\ueabe") : "",
    ord("\ueabf") : "",
    ord("\ueac0") : "",
    ord("\ueac1") : "",
    ord("\ueac2") : "",
    ord("\ueac3") : "",
    ord("\ueac4") : "",
    ord("\ueac5") : "",
    ord("\ueac6") : "",
    ord("\ueac7") : "",
    ord("\ueac8") : "",
    ord("\ueac9") : "",
    ord("\ueaca") : "",
    ord("\ueacb") : "",
    ord("\ueacc") : "",
    ord("\ueacd") : "",
    ord("\ueace") : "",
    ord("\ueacf") : "",
    ord("\uead0") : "",
    ord("\uead1") : "",
    ord("\uead2") : "",
    ord("\uead3") : "",
    ord("\uead4") : "",
    ord("\uead5") : "",
    ord("\uead6") : "",
    ord("\uead7") : "",
    ord("\uead8") : "",
    ord("\uead9") : "",
    ord("\ueada") : "",
    ord("\ueadb") : "",
    ord("\ueadc") : "",
    ord("\ueadd") : "",
    ord("\ueade") : "",
    ord("\ueadf") : "",
    ord("\ueae0") : "",
    ord("\ueae1") : "",
    ord("\ueae2") : "",
    ord("\ueae3") : "",
    ord("\ueae4") : "",
    ord("\ueae5") : "",
    ord("\ueae6") : "",
    ord("\ueae7") : "",
    ord("\ueae8") : "",
    ord("\ueae9") : "",
    ord("\ueaea") : "",
    ord("\ueaeb") : "",
    ord("\ueaec") : "",
    ord("\ueaed") : "",
    ord("\ueaee") : "",
    ord("\ueaef") : "",
    ord("\ueaf0") : "",
    ord("\ueaf1") : "",
    ord("\ueaf2") : "",
    ord("\ueaf3") : "",
    ord("\ueaf4") : "",
    ord("\ueaf5") : "",
    ord("\ueaf6") : "",
    ord("\ueaf7") : "",
    ord("\ueaf8") : "",
    ord("\ueaf9") : "",
    ord("\ueafa") : "",
    ord("\ueafb") : "",
    ord("\ueafc") : "",
    ord("\ueafd") : "",
    ord("\ueafe") : "",
    ord("\ueaff") : "",
    ord("\ueb00") : "",
    ord("\ueb01") : "",
    ord("\ueb02") : "",
    ord("\ueb03") : "",
    ord("\ueb04") : "",
    ord("\ueb05") : "",
    ord("\ueb06") : "",
    ord("\ueb07") : "",
    ord("\ueb08") : "",
    ord("\ueb09") : "",
    ord("\ueb0a") : "",
    ord("\ueb0b") : "",
    ord("\ueb0c") : "",
    ord("\ueb0d") : "",
    ord("\ueb0e") : "",
    ord("\ueb0f") : "",
    ord("\ueb10") : "",
    ord("\ueb11") : "",
    ord("\ueb12") : "",
    ord("\ueb13") : "",
    ord("\ueb14") : "",
    ord("\ueb15") : "",
    ord("\ueb16") : "",
    ord("\ueb17") : "",
    ord("\ueb18") : "",
    ord("\ueb19") : "",
    ord("\ueb1a") : "",
    ord("\ueb1b") : "",
    ord("\ueb1c") : "",
    ord("\ueb1d") : "",
    ord("\ueb1e") : "",
    ord("\ueb1f") : "",
    ord("\ueb20") : "",
    ord("\ueb21") : "",
    ord("\ueb22") : "",
    ord("\ueb23") : "",
    ord("\ueb24") : "",
    ord("\ueb25") : "",
    ord("\ueb26") : "",
    ord("\ueb27") : "",
    ord("\ueb28") : "",
    ord("\ueb29") : "",
    ord("\ueb2a") : "",
    ord("\ueb2b") : "",
    ord("\ueb2c") : "",
    ord("\ueb2d") : "",
    ord("\ueb2e") : "",
    ord("\ueb2f") : "",
    ord("\ueb30") : "",
    ord("\ueb31") : "",
    ord("\ueb32") : "",
    ord("\ueb33") : "",
    ord("\ueb34") : "",
    ord("\ueb35") : "",
    ord("\ueb36") : "",
    ord("\ueb37") : "",
    ord("\ueb38") : "",
    ord("\ueb39") : "",
    ord("\ueb3a") : "",
    ord("\ueb3b") : "",
    ord("\ueb3c") : "",
    ord("\ueb3d") : "",
    ord("\ueb3e") : "",
    ord("\ueb3f") : "",
    ord("\ueb40") : "",
    ord("\ueb41") : "",
    ord("\ueb42") : "",
    ord("\ueb43") : "",
    ord("\ueb44") : "",
    ord("\ueb45") : "",
    ord("\ueb46") : "",
    ord("\ueb47") : "",
    ord("\ueb48") : "",
    ord("\ueb49") : "",
    ord("\ueb4a") : "",
    ord("\ueb4b") : "",
    ord("\ueb4c") : "",
    ord("\ueb4d") : "",
    ord("\ueb4e") : "",
    ord("\ueb4f") : "",
    ord("\ueb50") : "",
    ord("\ueb51") : "",
    ord("\ueb52") : "",
    ord("\ueb53") : "",
    ord("\ueb54") : "",
    ord("\ueb55") : "",
    ord("\ueb56") : "",
    ord("\ueb57") : "",
    ord("\ueb58") : "",
    ord("\ueb59") : "",
    ord("\ueb5a") : "",
    ord("\ueb5b") : "",
    ord("\ueb5c") : "",
    ord("\ueb5d") : "",
    ord("\ueb5e") : "",
    ord("\ueb5f") : "",
    ord("\ueb60") : "",
    ord("\ueb61") : "",
    ord("\ueb62") : "",
    ord("\ueb63") : "",
    ord("\ueb64") : "",
    ord("\ueb65") : "",
    ord("\ueb66") : "",
    ord("\ueb67") : "",
    ord("\ueb68") : "",
    ord("\ueb69") : "",
    ord("\ueb6a") : "",
    ord("\ueb6b") : "",
    ord("\ueb6c") : "",
    ord("\ueb6d") : "",
    ord("\ueb6e") : "",
    ord("\ueb6f") : "",
    ord("\ueb70") : "",
    ord("\ueb71") : "",
    ord("\ueb72") : "",
    ord("\ueb73") : "",
    ord("\ueb74") : "",
    ord("\ueb75") : "",
    ord("\ueb76") : "",
    ord("\ueb77") : "",
    ord("\ueb78") : "",
    ord("\ueb79") : "",
    ord("\ueb7a") : "",
    ord("\ueb7b") : "",
    ord("\ueb7c") : "",
    ord("\ueb7d") : "",
    ord("\ueb7e") : "",
    ord("\ueb7f") : "",
    ord("\ueb80") : "",
    ord("\ueb81") : "",
    ord("\ueb82") : "",
    ord("\ueb83") : "",
    ord("\ueb84") : "",
    ord("\ueb85") : "",
    ord("\ueb86") : "",
    ord("\ueb87") : "",
    ord("\ueb88") : "",
    ord("\ueb89") : "",
    ord("\ueb8a") : "",
    ord("\ueb8b") : "",
    ord("\ueb8c") : "",
    ord("\ueb8d") : "",
    ord("\ueb8e") : "",
    ord("\ueb8f") : "",
    ord("\ueb90") : "",
    ord("\ueb91") : "",
    ord("\ueb92") : "",
    ord("\ueb93") : "",
    ord("\ueb94") : "",
    ord("\ueb95") : "",
    ord("\ueb96") : "",
    ord("\ueb97") : "",
    ord("\ueb98") : "",
    ord("\ueb99") : "",
    ord("\ueb9a") : "",
    ord("\ueb9b") : "",
    ord("\ueb9c") : "",
    ord("\ueb9d") : "",
    ord("\ueb9e") : "",
    ord("\ueb9f") : "",
    ord("\ueba0") : "",
    ord("\ueba1") : "",
    ord("\ueba2") : "",
    ord("\ueba3") : "",
    ord("\ueba4") : "",
    ord("\ueba5") : "",
    ord("\ueba6") : "",
    ord("\ueba7") : "",
    ord("\ueba8") : "",
    ord("\ueba9") : "",
    ord("\uebaa") : "",
    ord("\uebab") : "",
    ord("\uebac") : "",
    ord("\uebad") : "",
    ord("\uebae") : "",
    ord("\uebaf") : "",
    ord("\uebb0") : "",
    ord("\uebb1") : "",
    ord("\uebb2") : "",
    ord("\uebb3") : "",
    ord("\uebb4") : "",
    ord("\uebb5") : "",
    ord("\uebb6") : "",
    ord("\uebb7") : "",
    ord("\uebb8") : "",
    ord("\uebb9") : "",
    ord("\uebba") : "",
    ord("\uebbb") : "",
    ord("\uebbc") : "",
    ord("\uebbd") : "",
    ord("\uebbe") : "",
    ord("\uebbf") : "",
    ord("\uebc0") : "",
    ord("\uebc1") : "",
    ord("\uebc2") : "",
    ord("\uebc3") : "",
    ord("\uebc4") : "",
    ord("\uebc5") : "",
    ord("\uebc6") : "",
    ord("\uebc7") : "",
    ord("\uebc8") : "",
    ord("\uebc9") : "",
    ord("\uebca") : "",
    ord("\uebcb") : "",
    ord("\uebcc") : "",
    ord("\uebcd") : "",
    ord("\uebce") : "",
    ord("\uebcf") : "",
    ord("\uebd0") : "",
    ord("\uebd1") : "",
    ord("\uebd2") : "",
    ord("\uebd3") : "",
    ord("\uebd4") : "",
    ord("\uebd5") : "",
    ord("\uebd6") : "",
    ord("\uebd7") : "",
    ord("\uebd8") : "",
    ord("\uebd9") : "",
    ord("\uebda") : "",
    ord("\uebdb") : "",
    ord("\uebdc") : "",
    ord("\uebdd") : "",
    ord("\uebde") : "",
    ord("\uebdf") : "",
    ord("\uebe0") : "",
    ord("\uebe1") : "",
    ord("\uebe2") : "",
    ord("\uebe3") : "",
    ord("\uebe4") : "",
    ord("\uebe5") : "",
    ord("\uebe6") : "",
    ord("\uebe7") : "",
    ord("\uebe8") : "",
    ord("\uebe9") : "",
    ord("\uebea") : "",
    ord("\uebeb") : "",
    ord("\uebec") : "",
    ord("\uebed") : "",
    ord("\uebee") : "",
    ord("\uebef") : "",
    ord("\uebf0") : "",
    ord("\uebf1") : "",
    ord("\uebf2") : "",
    ord("\uebf3") : "",
    ord("\uebf4") : "",
    ord("\uebf5") : "",
    ord("\uebf6") : "",
    ord("\uebf7") : "",
    ord("\uebf8") : "",
    ord("\uebf9") : "",
    ord("\uebfa") : "",
    ord("\uebfb") : "",
    ord("\uebfc") : "",
    ord("\uebfd") : "",
    ord("\uebfe") : "",
    ord("\uebff") : "",
    ord("\uec00") : "",
    ord("\uec01") : "",
    ord("\uec02") : "",
    ord("\uec03") : "",
    ord("\uec04") : "",
    ord("\uec05") : "",
    ord("\uec06") : "",
    ord("\uec07") : "",
    ord("\uec08") : "",
    ord("\uec09") : "",
    ord("\uec0a") : "",
    ord("\uec0b") : "",
    ord("\uec0c") : "",
    ord("\uec0d") : "",
    ord("\uec0e") : "",
    ord("\uec0f") : "",
    ord("\uec10") : "",
    ord("\uec11") : "",
    ord("\uec12") : "",
    ord("\uec13") : "",
    ord("\uec14") : "",
    ord("\uec15") : "",
    ord("\uec16") : "",
    ord("\uec17") : "",
    ord("\uec18") : "",
    ord("\uec19") : "",
    ord("\uec1a") : "",
    ord("\uec1b") : "",
    ord("\uec1c") : "",
    ord("\uec1d") : "",
    ord("\uec1e") : "",
    ord("\uec1f") : "",
    ord("\uec20") : "",
    ord("\uec21") : "",
    ord("\uec22") : "",
    ord("\uec23") : "",
    ord("\uec24") : "",
    ord("\uec25") : "",
    ord("\uec26") : "",
    ord("\uec27") : "",
    ord("\uec28") : "",
    ord("\uec29") : "",
    ord("\uec2a") : "",
    ord("\uec2b") : "",
    ord("\uec2c") : "",
    ord("\uec2d") : "",
    ord("\uec2e") : "",
    ord("\uec2f") : "",
    ord("\uec30") : "",
    ord("\uec31") : "",
    ord("\uec32") : "",
    ord("\uec33") : "",
    ord("\uec34") : "",
    ord("\uec35") : "",
    ord("\uec36") : "",
    ord("\uec37") : "",
    ord("\uec38") : "",
    ord("\uec39") : "",
    ord("\uec3a") : "",
    ord("\uec3b") : "",
    ord("\uec3c") : "",
    ord("\uec3d") : "",
    ord("\uec3e") : "",
    ord("\uec3f") : "",
    ord("\uec40") : "",
    ord("\uec41") : "",
    ord("\uec42") : "",
    ord("\uec43") : "",
    ord("\uec44") : "",
    ord("\uec45") : "",
    ord("\uec46") : "",
    ord("\uec47") : "",
    ord("\uec48") : "",
    ord("\uec49") : "",
    ord("\uec4a") : "",
    ord("\uec4b") : "",
    ord("\uec4c") : "",
    ord("\uec4d") : "",
    ord("\uec4e") : "",
    ord("\uec4f") : "",
    ord("\uec50") : "",
    ord("\uec51") : "",
    ord("\uec52") : "",
    ord("\uec53") : "",
    ord("\uec54") : "",
    ord("\uec55") : "",
    ord("\uec56") : "",
    ord("\uec57") : "",
    ord("\uec58") : "",
    ord("\uec59") : "",
    ord("\uec5a") : "",
    ord("\uec5b") : "",
    ord("\uec5c") : "",
    ord("\uec5d") : "",
    ord("\uec5e") : "",
    ord("\uec5f") : "",
    ord("\uec60") : "",
    ord("\uec61") : "",
    ord("\uec62") : "",
    ord("\uec63") : "",
    ord("\uec64") : "",
    ord("\uec65") : "",
    ord("\uec66") : "",
    ord("\uec67") : "",
    ord("\uec68") : "",
    ord("\uec69") : "",
    ord("\uec6a") : "",
    ord("\uec6b") : "",
    ord("\uec6c") : "",
    ord("\uec6d") : "",
    ord("\uec6e") : "",
    ord("\uec6f") : "",
    ord("\uec70") : "",
    ord("\uec71") : "",
    ord("\uec72") : "",
    ord("\uec73") : "",
    ord("\uec74") : "",
    ord("\uec75") : "",
    ord("\uec76") : "",
    ord("\uec77") : "",
    ord("\uec78") : "",
    ord("\uec79") : "",
    ord("\uec7a") : "",
    ord("\uec7b") : "",
    ord("\uec7c") : "",
    ord("\uec7d") : "",
    ord("\uec7e") : "",
    ord("\uec7f") : "",
    ord("\uec80") : "",
    ord("\uec81") : "",
    ord("\uec82") : "",
    ord("\uec83") : "",
    ord("\uec84") : "",
    ord("\uec85") : "",
    ord("\uec86") : "",
    ord("\uec87") : "",
    ord("\uec88") : "",
    ord("\uec89") : "",
    ord("\uec8a") : "",
    ord("\uec8b") : "",
    ord("\uec8c") : "",
    ord("\uec8d") : "",
    ord("\uec8e") : "",
    ord("\uec8f") : "",
    ord("\uec90") : "",
    ord("\uec91") : "",
    ord("\uec92") : "",
    ord("\uec93") : "",
    ord("\uec94") : "",
    ord("\uec95") : "",
    ord("\uec96") : "",
    ord("\uec97") : "",
    ord("\uec98") : "",
    ord("\uec99") : "",
    ord("\uec9a") : "",
    ord("\uec9b") : "",
    ord("\uec9c") : "",
    ord("\uec9d") : "",
    ord("\uec9e") : "",
    ord("\uec9f") : "",
    ord("\ueca0") : "",
    ord("\ueca1") : "",
    ord("\ueca2") : "",
    ord("\ueca3") : "",
    ord("\ueca4") : "",
    ord("\ueca5") : "",
    ord("\ueca6") : "",
    ord("\ueca7") : "",
    ord("\ueca8") : "",
    ord("\ueca9") : "",
    ord("\uecaa") : "",
    ord("\uecab") : "",
    ord("\uecac") : "",
    ord("\uecad") : "",
    ord("\uecae") : "",
    ord("\uecaf") : "",
    ord("\uecb0") : "",
    ord("\uecb1") : "",
    ord("\uecb2") : "",
    ord("\uecb3") : "",
    ord("\uecb4") : "",
    ord("\uecb5") : "",
    ord("\uecb6") : "",
    ord("\uecb7") : "",
    ord("\uecb8") : "",
    ord("\uecb9") : "",
    ord("\uecba") : "",
    ord("\uecbb") : "",
    ord("\uecbc") : "",
    ord("\uecbd") : "",
    ord("\uecbe") : "",
    ord("\uecbf") : "",
    ord("\uecc0") : "",
    ord("\uecc1") : "",
    ord("\uecc2") : "",
    ord("\uecc3") : "",
    ord("\uecc4") : "",
    ord("\uecc5") : "",
    ord("\uecc6") : "",
    ord("\uecc7") : "",
    ord("\uecc8") : "",
    ord("\uecc9") : "",
    ord("\uecca") : "",
    ord("\ueccb") : "",
    ord("\ueccc") : "",
    ord("\ueccd") : "",
    ord("\uecce") : "",
    ord("\ueccf") : "",
    ord("\uecd0") : "",
    ord("\uecd1") : "",
    ord("\uecd2") : "",
    ord("\uecd3") : "",
    ord("\uecd4") : "",
    ord("\uecd5") : "",
    ord("\uecd6") : "",
    ord("\uecd7") : "",
    ord("\uecd8") : "",
    ord("\uecd9") : "",
    ord("\uecda") : "",
    ord("\uecdb") : "",
    ord("\uecdc") : "",
    ord("\uecdd") : "",
    ord("\uecde") : "",
    ord("\uecdf") : "",
    ord("\uece0") : "",
    ord("\uece1") : "",
    ord("\uece2") : "",
    ord("\uece3") : "",
    ord("\uece4") : "",
    ord("\uece5") : "",
    ord("\uece6") : "",
    ord("\uece7") : "",
    ord("\uece8") : "",
    ord("\uece9") : "",
    ord("\uecea") : "",
    ord("\ueceb") : "",
    ord("\uecec") : "",
    ord("\ueced") : "",
    ord("\uecee") : "",
    ord("\uecef") : "",
    ord("\uecf0") : "",
    ord("\uecf1") : "",
    ord("\uecf2") : "",
    ord("\uecf3") : "",
    ord("\uecf4") : "",
    ord("\uecf5") : "",
    ord("\uecf6") : "",
    ord("\uecf7") : "",
    ord("\uecf8") : "",
    ord("\uecf9") : "",
    ord("\uecfa") : "",
    ord("\uecfb") : "",
    ord("\uecfc") : "",
    ord("\uecfd") : "",
    ord("\uecfe") : "",
    ord("\uecff") : "",
    ord("\ued00") : "",
    ord("\ued01") : "",
    ord("\ued02") : "",
    ord("\ued03") : "",
    ord("\ued04") : "",
    ord("\ued05") : "",
    ord("\ued06") : "",
    ord("\ued07") : "",
    ord("\ued08") : "",
    ord("\ued09") : "",
    ord("\ued0a") : "",
    ord("\ued0b") : "",
    ord("\ued0c") : "",
    ord("\ued0d") : "",
    ord("\ued0e") : "",
    ord("\ued0f") : "",
    ord("\ued10") : "",
    ord("\ued11") : "",
    ord("\ued12") : "",
    ord("\ued13") : "",
    ord("\ued14") : "",
    ord("\ued15") : "",
    ord("\ued16") : "",
    ord("\ued17") : "",
    ord("\ued18") : "",
    ord("\ued19") : "",
    ord("\ued1a") : "",
    ord("\ued1b") : "",
    ord("\ued1c") : "",
    ord("\ued1d") : "",
    ord("\ued1e") : "",
    ord("\ued1f") : "",
    ord("\ued20") : "",
    ord("\ued21") : "",
    ord("\ued22") : "",
    ord("\ued23") : "",
    ord("\ued24") : "",
    ord("\ued25") : "",
    ord("\ued26") : "",
    ord("\ued27") : "",
    ord("\ued28") : "",
    ord("\ued29") : "",
    ord("\ued2a") : "",
    ord("\ued2b") : "",
    ord("\ued2c") : "",
    ord("\ued2d") : "",
    ord("\ued2e") : "",
    ord("\ued2f") : "",
    ord("\ued30") : "",
    ord("\ued31") : "",
    ord("\ued32") : "",
    ord("\ued33") : "",
    ord("\ued34") : "",
    ord("\ued35") : "",
    ord("\ued36") : "",
    ord("\ued37") : "",
    ord("\ued38") : "",
    ord("\ued39") : "",
    ord("\ued3a") : "",
    ord("\ued3b") : "",
    ord("\ued3c") : "",
    ord("\ued3d") : "",
    ord("\ued3e") : "",
    ord("\ued3f") : "",
    ord("\ued40") : "",
    ord("\ued41") : "",
    ord("\ued42") : "",
    ord("\ued43") : "",
    ord("\ued44") : "",
    ord("\ued45") : "",
    ord("\ued46") : "",
    ord("\ued47") : "",
    ord("\ued48") : "",
    ord("\ued49") : "",
    ord("\ued4a") : "",
    ord("\ued4b") : "",
    ord("\ued4c") : "",
    ord("\ued4d") : "",
    ord("\ued4e") : "",
    ord("\ued4f") : "",
    ord("\ued50") : "",
    ord("\ued51") : "",
    ord("\ued52") : "",
    ord("\ued53") : "",
    ord("\ued54") : "",
    ord("\ued55") : "",
    ord("\ued56") : "",
    ord("\ued57") : "",
    ord("\ued58") : "",
    ord("\ued59") : "",
    ord("\ued5a") : "",
    ord("\ued5b") : "",
    ord("\ued5c") : "",
    ord("\ued5d") : "",
    ord("\ued5e") : "",
    ord("\ued5f") : "",
    ord("\ued60") : "",
    ord("\ued61") : "",
    ord("\ued62") : "",
    ord("\ued63") : "",
    ord("\ued64") : "",
    ord("\ued65") : "",
    ord("\ued66") : "",
    ord("\ued67") : "",
    ord("\ued68") : "",
    ord("\ued69") : "",
    ord("\ued6a") : "",
    ord("\ued6b") : "",
    ord("\ued6c") : "",
    ord("\ued6d") : "",
    ord("\ued6e") : "",
    ord("\ued6f") : "",
    ord("\ued70") : "",
    ord("\ued71") : "",
    ord("\ued72") : "",
    ord("\ued73") : "",
    ord("\ued74") : "",
    ord("\ued75") : "",
    ord("\ued76") : "",
    ord("\ued77") : "",
    ord("\ued78") : "",
    ord("\ued79") : "",
    ord("\ued7a") : "",
    ord("\ued7b") : "",
    ord("\ued7c") : "",
    ord("\ued7d") : "",
    ord("\ued7e") : "",
    ord("\ued7f") : "",
    ord("\ued80") : "",
    ord("\ued81") : "",
    ord("\ued82") : "",
    ord("\ued83") : "",
    ord("\ued84") : "",
    ord("\ued85") : "",
    ord("\ued86") : "",
    ord("\ued87") : "",
    ord("\ued88") : "",
    ord("\ued89") : "",
    ord("\ued8a") : "",
    ord("\ued8b") : "",
    ord("\ued8c") : "",
    ord("\ued8d") : "",
    ord("\ued8e") : "",
    ord("\ued8f") : "",
    ord("\ued90") : "",
    ord("\ued91") : "",
    ord("\ued92") : "",
    ord("\ued93") : "",
    ord("\ued94") : "",
    ord("\ued95") : "",
    ord("\ued96") : "",
    ord("\ued97") : "",
    ord("\ued98") : "",
    ord("\ued99") : "",
    ord("\ued9a") : "",
    ord("\ued9b") : "",
    ord("\ued9c") : "",
    ord("\ued9d") : "",
    ord("\ued9e") : "",
    ord("\ued9f") : "",
    ord("\ueda0") : "",
    ord("\ueda1") : "",
    ord("\ueda2") : "",
    ord("\ueda3") : "",
    ord("\ueda4") : "",
    ord("\ueda5") : "",
    ord("\ueda6") : "",
    ord("\ueda7") : "",
    ord("\ueda8") : "",
    ord("\ueda9") : "",
    ord("\uedaa") : "",
    ord("\uedab") : "",
    ord("\uedac") : "",
    ord("\uedad") : "",
    ord("\uedae") : "",
    ord("\uedaf") : "",
    ord("\uedb0") : "",
    ord("\uedb1") : "",
    ord("\uedb2") : "",
    ord("\uedb3") : "",
    ord("\uedb4") : "",
    ord("\uedb5") : "",
    ord("\uedb6") : "",
    ord("\uedb7") : "",
    ord("\uedb8") : "",
    ord("\uedb9") : "",
    ord("\uedba") : "",
    ord("\uedbb") : "",
    ord("\uedbc") : "",
    ord("\uedbd") : "",
    ord("\uedbe") : "",
    ord("\uedbf") : "",
    ord("\uedc0") : "",
    ord("\uedc1") : "",
    ord("\uedc2") : "",
    ord("\uedc3") : "",
    ord("\uedc4") : "",
    ord("\uedc5") : "",
    ord("\uedc6") : "",
    ord("\uedc7") : "",
    ord("\uedc8") : "",
    ord("\uedc9") : "",
    ord("\uedca") : "",
    ord("\uedcb") : "",
    ord("\uedcc") : "",
    ord("\uedcd") : "",
    ord("\uedce") : "",
    ord("\uedcf") : "",
    ord("\uedd0") : "",
    ord("\uedd1") : "",
    ord("\uedd2") : "",
    ord("\uedd3") : "",
    ord("\uedd4") : "",
    ord("\uedd5") : "",
    ord("\uedd6") : "",
    ord("\uedd7") : "",
    ord("\uedd8") : "",
    ord("\uedd9") : "",
    ord("\uedda") : "",
    ord("\ueddb") : "",
    ord("\ueddc") : "",
    ord("\ueddd") : "",
    ord("\uedde") : "",
    ord("\ueddf") : "",
    ord("\uede0") : "",
    ord("\uede1") : "",
    ord("\uede2") : "",
    ord("\uede3") : "",
    ord("\uede4") : "",
    ord("\uede5") : "",
    ord("\uede6") : "",
    ord("\uede7") : "",
    ord("\uede8") : "",
    ord("\uede9") : "",
    ord("\uedea") : "",
    ord("\uedeb") : "",
    ord("\uedec") : "",
    ord("\ueded") : "",
    ord("\uedee") : "",
    ord("\uedef") : "",
    ord("\uedf0") : "",
    ord("\uedf1") : "",
    ord("\uedf2") : "",
    ord("\uedf3") : "",
    ord("\uedf4") : "",
    ord("\uedf5") : "",
    ord("\uedf6") : "",
    ord("\uedf7") : "",
    ord("\uedf8") : "",
    ord("\uedf9") : "",
    ord("\uedfa") : "",
    ord("\uedfb") : "",
    ord("\uedfc") : "",
    ord("\uedfd") : "",
    ord("\uedfe") : "",
    ord("\uedff") : "",
    ord("\uee00") : "",
    ord("\uee01") : "",
    ord("\uee02") : "",
    ord("\uee03") : "",
    ord("\uee04") : "",
    ord("\uee05") : "",
    ord("\uee06") : "",
    ord("\uee07") : "",
    ord("\uee08") : "",
    ord("\uee09") : "",
    ord("\uee0a") : "",
    ord("\uee0b") : "",
    ord("\uee0c") : "",
    ord("\uee0d") : "",
    ord("\uee0e") : "",
    ord("\uee0f") : "",
    ord("\uee10") : "",
    ord("\uee11") : "",
    ord("\uee12") : "",
    ord("\uee13") : "",
    ord("\uee14") : "",
    ord("\uee15") : "",
    ord("\uee16") : "",
    ord("\uee17") : "",
    ord("\uee18") : "",
    ord("\uee19") : "",
    ord("\uee1a") : "",
    ord("\uee1b") : "",
    ord("\uee1c") : "",
    ord("\uee1d") : "",
    ord("\uee1e") : "",
    ord("\uee1f") : "",
    ord("\uee20") : "",
    ord("\uee21") : "",
    ord("\uee22") : "",
    ord("\uee23") : "",
    ord("\uee24") : "",
    ord("\uee25") : "",
    ord("\uee26") : "",
    ord("\uee27") : "",
    ord("\uee28") : "",
    ord("\uee29") : "",
    ord("\uee2a") : "",
    ord("\uee2b") : "",
    ord("\uee2c") : "",
    ord("\uee2d") : "",
    ord("\uee2e") : "",
    ord("\uee2f") : "",
    ord("\uee30") : "",
    ord("\uee31") : "",
    ord("\uee32") : "",
    ord("\uee33") : "",
    ord("\uee34") : "",
    ord("\uee35") : "",
    ord("\uee36") : "",
    ord("\uee37") : "",
    ord("\uee38") : "",
    ord("\uee39") : "",
    ord("\uee3a") : "",
    ord("\uee3b") : "",
    ord("\uee3c") : "",
    ord("\uee3d") : "",
    ord("\uee3e") : "",
    ord("\uee3f") : "",
    ord("\uee40") : "",
    ord("\uee41") : "",
    ord("\uee42") : "",
    ord("\uee43") : "",
    ord("\uee44") : "",
    ord("\uee45") : "",
    ord("\uee46") : "",
    ord("\uee47") : "",
    ord("\uee48") : "",
    ord("\uee49") : "",
    ord("\uee4a") : "",
    ord("\uee4b") : "",
    ord("\uee4c") : "",
    ord("\uee4d") : "",
    ord("\uee4e") : "",
    ord("\uee4f") : "",
    ord("\uee50") : "",
    ord("\uee51") : "",
    ord("\uee52") : "",
    ord("\uee53") : "",
    ord("\uee54") : "",
    ord("\uee55") : "",
    ord("\uee56") : "",
    ord("\uee57") : "",
    ord("\uee58") : "",
    ord("\uee59") : "",
    ord("\uee5a") : "",
    ord("\uee5b") : "",
    ord("\uee5c") : "",
    ord("\uee5d") : "",
    ord("\uee5e") : "",
    ord("\uee5f") : "",
    ord("\uee60") : "",
    ord("\uee61") : "",
    ord("\uee62") : "",
    ord("\uee63") : "",
    ord("\uee64") : "",
    ord("\uee65") : "",
    ord("\uee66") : "",
    ord("\uee67") : "",
    ord("\uee68") : "",
    ord("\uee69") : "",
    ord("\uee6a") : "",
    ord("\uee6b") : "",
    ord("\uee6c") : "",
    ord("\uee6d") : "",
    ord("\uee6e") : "",
    ord("\uee6f") : "",
    ord("\uee70") : "",
    ord("\uee71") : "",
    ord("\uee72") : "",
    ord("\uee73") : "",
    ord("\uee74") : "",
    ord("\uee75") : "",
    ord("\uee76") : "",
    ord("\uee77") : "",
    ord("\uee78") : "",
    ord("\uee79") : "",
    ord("\uee7a") : "",
    ord("\uee7b") : "",
    ord("\uee7c") : "",
    ord("\uee7d") : "",
    ord("\uee7e") : "",
    ord("\uee7f") : "",
    ord("\uee80") : "",
    ord("\uee81") : "",
    ord("\uee82") : "",
    ord("\uee83") : "",
    ord("\uee84") : "",
    ord("\uee85") : "",
    ord("\uee86") : "",
    ord("\uee87") : "",
    ord("\uee88") : "",
    ord("\uee89") : "",
    ord("\uee8a") : "",
    ord("\uee8b") : "",
    ord("\uee8c") : "",
    ord("\uee8d") : "",
    ord("\uee8e") : "",
    ord("\uee8f") : "",
    ord("\uee90") : "",
    ord("\uee91") : "",
    ord("\uee92") : "",
    ord("\uee93") : "",
    ord("\uee94") : "",
    ord("\uee95") : "",
    ord("\uee96") : "",
    ord("\uee97") : "",
    ord("\uee98") : "",
    ord("\uee99") : "",
    ord("\uee9a") : "",
    ord("\uee9b") : "",
    ord("\uee9c") : "",
    ord("\uee9d") : "",
    ord("\uee9e") : "",
    ord("\uee9f") : "",
    ord("\ueea0") : "",
    ord("\ueea1") : "",
    ord("\ueea2") : "",
    ord("\ueea3") : "",
    ord("\ueea4") : "",
    ord("\ueea5") : "",
    ord("\ueea6") : "",
    ord("\ueea7") : "",
    ord("\ueea8") : "",
    ord("\ueea9") : "",
    ord("\ueeaa") : "",
    ord("\ueeab") : "",
    ord("\ueeac") : "",
    ord("\ueead") : "",
    ord("\ueeae") : "",
    ord("\ueeaf") : "",
    ord("\ueeb0") : "",
    ord("\ueeb1") : "",
    ord("\ueeb2") : "",
    ord("\ueeb3") : "",
    ord("\ueeb4") : "",
    ord("\ueeb5") : "",
    ord("\ueeb6") : "",
    ord("\ueeb7") : "",
    ord("\ueeb8") : "",
    ord("\ueeb9") : "",
    ord("\ueeba") : "",
    ord("\ueebb") : "",
    ord("\ueebc") : "",
    ord("\ueebd") : "",
    ord("\ueebe") : "",
    ord("\ueebf") : "",
    ord("\ueec0") : "",
    ord("\ueec1") : "",
    ord("\ueec2") : "",
    ord("\ueec3") : "",
    ord("\ueec4") : "",
    ord("\ueec5") : "",
    ord("\ueec6") : "",
    ord("\ueec7") : "",
    ord("\ueec8") : "",
    ord("\ueec9") : "",
    ord("\ueeca") : "",
    ord("\ueecb") : "",
    ord("\ueecc") : "",
    ord("\ueecd") : "",
    ord("\ueece") : "",
    ord("\ueecf") : "",
    ord("\ueed0") : "",
    ord("\ueed1") : "",
    ord("\ueed2") : "",
    ord("\ueed3") : "",
    ord("\ueed4") : "",
    ord("\ueed5") : "",
    ord("\ueed6") : "",
    ord("\ueed7") : "",
    ord("\ueed8") : "",
    ord("\ueed9") : "",
    ord("\ueeda") : "",
    ord("\ueedb") : "",
    ord("\ueedc") : "",
    ord("\ueedd") : "",
    ord("\ueede") : "",
    ord("\ueedf") : "",
    ord("\ueee0") : "",
    ord("\ueee1") : "",
    ord("\ueee2") : "",
    ord("\ueee3") : "",
    ord("\ueee4") : "",
    ord("\ueee5") : "",
    ord("\ueee6") : "",
    ord("\ueee7") : "",
    ord("\ueee8") : "",
    ord("\ueee9") : "",
    ord("\ueeea") : "",
    ord("\ueeeb") : "",
    ord("\ueeec") : "",
    ord("\ueeed") : "",
    ord("\ueeee") : "",
    ord("\ueeef") : "",
    ord("\ueef0") : "",
    ord("\ueef1") : "",
    ord("\ueef2") : "",
    ord("\ueef3") : "",
    ord("\ueef4") : "",
    ord("\ueef5") : "",
    ord("\ueef6") : "",
    ord("\ueef7") : "",
    ord("\ueef8") : "",
    ord("\ueef9") : "",
    ord("\ueefa") : "",
    ord("\ueefb") : "",
    ord("\ueefc") : "",
    ord("\ueefd") : "",
    ord("\ueefe") : "",
    ord("\ueeff") : "",
    ord("\uef00") : "",
    ord("\uef01") : "",
    ord("\uef02") : "",
    ord("\uef03") : "",
    ord("\uef04") : "",
    ord("\uef05") : "",
    ord("\uef06") : "",
    ord("\uef07") : "",
    ord("\uef08") : "",
    ord("\uef09") : "",
    ord("\uef0a") : "",
    ord("\uef0b") : "",
    ord("\uef0c") : "",
    ord("\uef0d") : "",
    ord("\uef0e") : "",
    ord("\uef0f") : "",
    ord("\uef10") : "",
    ord("\uef11") : "",
    ord("\uef12") : "",
    ord("\uef13") : "",
    ord("\uef14") : "",
    ord("\uef15") : "",
    ord("\uef16") : "",
    ord("\uef17") : "",
    ord("\uef18") : "",
    ord("\uef19") : "",
    ord("\uef1a") : "",
    ord("\uef1b") : "",
    ord("\uef1c") : "",
    ord("\uef1d") : "",
    ord("\uef1e") : "",
    ord("\uef1f") : "",
    ord("\uef20") : "",
    ord("\uef21") : "",
    ord("\uef22") : "",
    ord("\uef23") : "",
    ord("\uef24") : "",
    ord("\uef25") : "",
    ord("\uef26") : "",
    ord("\uef27") : "",
    ord("\uef28") : "",
    ord("\uef29") : "",
    ord("\uef2a") : "",
    ord("\uef2b") : "",
    ord("\uef2c") : "",
    ord("\uef2d") : "",
    ord("\uef2e") : "",
    ord("\uef2f") : "",
    ord("\uef30") : "",
    ord("\uef31") : "",
    ord("\uef32") : "",
    ord("\uef33") : "",
    ord("\uef34") : "",
    ord("\uef35") : "",
    ord("\uef36") : "",
    ord("\uef37") : "",
    ord("\uef38") : "",
    ord("\uef39") : "",
    ord("\uef3a") : "",
    ord("\uef3b") : "",
    ord("\uef3c") : "",
    ord("\uef3d") : "",
    ord("\uef3e") : "",
    ord("\uef3f") : "",
    ord("\uef40") : "",
    ord("\uef41") : "",
    ord("\uef42") : "",
    ord("\uef43") : "",
    ord("\uef44") : "",
    ord("\uef45") : "",
    ord("\uef46") : "",
    ord("\uef47") : "",
    ord("\uef48") : "",
    ord("\uef49") : "",
    ord("\uef4a") : "",
    ord("\uef4b") : "",
    ord("\uef4c") : "",
    ord("\uef4d") : "",
    ord("\uef4e") : "",
    ord("\uef4f") : "",
    ord("\uef50") : "",
    ord("\uef51") : "",
    ord("\uef52") : "",
    ord("\uef53") : "",
    ord("\uef54") : "",
    ord("\uef55") : "",
    ord("\uef56") : "",
    ord("\uef57") : "",
    ord("\uef58") : "",
    ord("\uef59") : "",
    ord("\uef5a") : "",
    ord("\uef5b") : "",
    ord("\uef5c") : "",
    ord("\uef5d") : "",
    ord("\uef5e") : "",
    ord("\uef5f") : "",
    ord("\uef60") : "",
    ord("\uef61") : "",
    ord("\uef62") : "",
    ord("\uef63") : "",
    ord("\uef64") : "",
    ord("\uef65") : "",
    ord("\uef66") : "",
    ord("\uef67") : "",
    ord("\uef68") : "",
    ord("\uef69") : "",
    ord("\uef6a") : "",
    ord("\uef6b") : "",
    ord("\uef6c") : "",
    ord("\uef6d") : "",
    ord("\uef6e") : "",
    ord("\uef6f") : "",
    ord("\uef70") : "",
    ord("\uef71") : "",
    ord("\uef72") : "",
    ord("\uef73") : "",
    ord("\uef74") : "",
    ord("\uef75") : "",
    ord("\uef76") : "",
    ord("\uef77") : "",
    ord("\uef78") : "",
    ord("\uef79") : "",
    ord("\uef7a") : "",
    ord("\uef7b") : "",
    ord("\uef7c") : "",
    ord("\uef7d") : "",
    ord("\uef7e") : "",
    ord("\uef7f") : "",
    ord("\uef80") : "",
    ord("\uef81") : "",
    ord("\uef82") : "",
    ord("\uef83") : "",
    ord("\uef84") : "",
    ord("\uef85") : "",
    ord("\uef86") : "",
    ord("\uef87") : "",
    ord("\uef88") : "",
    ord("\uef89") : "",
    ord("\uef8a") : "",
    ord("\uef8b") : "",
    ord("\uef8c") : "",
    ord("\uef8d") : "",
    ord("\uef8e") : "",
    ord("\uef8f") : "",
    ord("\uef90") : "",
    ord("\uef91") : "",
    ord("\uef92") : "",
    ord("\uef93") : "",
    ord("\uef94") : "",
    ord("\uef95") : "",
    ord("\uef96") : "",
    ord("\uef97") : "",
    ord("\uef98") : "",
    ord("\uef99") : "",
    ord("\uef9a") : "",
    ord("\uef9b") : "",
    ord("\uef9c") : "",
    ord("\uef9d") : "",
    ord("\uef9e") : "",
    ord("\uef9f") : "",
    ord("\uefa0") : "",
    ord("\uefa1") : "",
    ord("\uefa2") : "",
    ord("\uefa3") : "",
    ord("\uefa4") : "",
    ord("\uefa5") : "",
    ord("\uefa6") : "",
    ord("\uefa7") : "",
    ord("\uefa8") : "",
    ord("\uefa9") : "",
    ord("\uefaa") : "",
    ord("\uefab") : "",
    ord("\uefac") : "",
    ord("\uefad") : "",
    ord("\uefae") : "",
    ord("\uefaf") : "",
    ord("\uefb0") : "",
    ord("\uefb1") : "",
    ord("\uefb2") : "",
    ord("\uefb3") : "",
    ord("\uefb4") : "",
    ord("\uefb5") : "",
    ord("\uefb6") : "",
    ord("\uefb7") : "",
    ord("\uefb8") : "",
    ord("\uefb9") : "",
    ord("\uefba") : "",
    ord("\uefbb") : "",
    ord("\uefbc") : "",
    ord("\uefbd") : "",
    ord("\uefbe") : "",
    ord("\uefbf") : "",
    ord("\uefc0") : "",
    ord("\uefc1") : "",
    ord("\uefc2") : "",
    ord("\uefc3") : "",
    ord("\uefc4") : "",
    ord("\uefc5") : "",
    ord("\uefc6") : "",
    ord("\uefc7") : "",
    ord("\uefc8") : "",
    ord("\uefc9") : "",
    ord("\uefca") : "",
    ord("\uefcb") : "",
    ord("\uefcc") : "",
    ord("\uefcd") : "",
    ord("\uefce") : "",
    ord("\uefcf") : "",
    ord("\uefd0") : "",
    ord("\uefd1") : "",
    ord("\uefd2") : "",
    ord("\uefd3") : "",
    ord("\uefd4") : "",
    ord("\uefd5") : "",
    ord("\uefd6") : "",
    ord("\uefd7") : "",
    ord("\uefd8") : "",
    ord("\uefd9") : "",
    ord("\uefda") : "",
    ord("\uefdb") : "",
    ord("\uefdc") : "",
    ord("\uefdd") : "",
    ord("\uefde") : "",
    ord("\uefdf") : "",
    ord("\uefe0") : "",
    ord("\uefe1") : "",
    ord("\uefe2") : "",
    ord("\uefe3") : "",
    ord("\uefe4") : "",
    ord("\uefe5") : "",
    ord("\uefe6") : "",
    ord("\uefe7") : "",
    ord("\uefe8") : "",
    ord("\uefe9") : "",
    ord("\uefea") : "",
    ord("\uefeb") : "",
    ord("\uefec") : "",
    ord("\uefed") : "",
    ord("\uefee") : "",
    ord("\uefef") : "",
    ord("\ueff0") : "",
    ord("\ueff1") : "",
    ord("\ueff2") : "",
    ord("\ueff3") : "",
    ord("\ueff4") : "",
    ord("\ueff5") : "",
    ord("\ueff6") : "",
    ord("\ueff7") : "",
    ord("\ueff8") : "",
    ord("\ueff9") : "",
    ord("\ueffa") : "",
    ord("\ueffb") : "",
    ord("\ueffc") : "",
    ord("\ueffd") : "",
    ord("\ueffe") : "",
    ord("\uefff") : "",
    ord("\uf000") : "",
    ord("\uf001") : "",
    ord("\uf002") : "",
    ord("\uf003") : "",
    ord("\uf004") : "",
    ord("\uf005") : "",
    ord("\uf006") : "",
    ord("\uf007") : "",
    ord("\uf008") : "",
    ord("\uf009") : "",
    ord("\uf00a") : "",
    ord("\uf00b") : "",
    ord("\uf00c") : "",
    ord("\uf00d") : "",
    ord("\uf00e") : "",
    ord("\uf00f") : "",
    ord("\uf010") : "",
    ord("\uf011") : "",
    ord("\uf012") : "",
    ord("\uf013") : "",
    ord("\uf014") : "",
    ord("\uf015") : "",
    ord("\uf016") : "",
    ord("\uf017") : "",
    ord("\uf018") : "",
    ord("\uf019") : "",
    ord("\uf01a") : "",
    ord("\uf01b") : "",
    ord("\uf01c") : "",
    ord("\uf01d") : "",
    ord("\uf01e") : "",
    ord("\uf01f") : "",
    ord("\uf020") : "",
    ord("\uf021") : "",
    ord("\uf022") : "",
    ord("\uf023") : "",
    ord("\uf024") : "",
    ord("\uf025") : "",
    ord("\uf026") : "",
    ord("\uf027") : "",
    ord("\uf028") : "",
    ord("\uf029") : "",
    ord("\uf02a") : "",
    ord("\uf02b") : "",
    ord("\uf02c") : "",
    ord("\uf02d") : "",
    ord("\uf02e") : "",
    ord("\uf02f") : "",
    ord("\uf030") : "",
    ord("\uf031") : "",
    ord("\uf032") : "",
    ord("\uf033") : "",
    ord("\uf034") : "",
    ord("\uf035") : "",
    ord("\uf036") : "",
    ord("\uf037") : "",
    ord("\uf038") : "",
    ord("\uf039") : "",
    ord("\uf03a") : "",
    ord("\uf03b") : "",
    ord("\uf03c") : "",
    ord("\uf03d") : "",
    ord("\uf03e") : "",
    ord("\uf03f") : "",
    ord("\uf040") : "",
    ord("\uf041") : "",
    ord("\uf042") : "",
    ord("\uf043") : "",
    ord("\uf044") : "",
    ord("\uf045") : "",
    ord("\uf046") : "",
    ord("\uf047") : "",
    ord("\uf048") : "",
    ord("\uf049") : "",
    ord("\uf04a") : "",
    ord("\uf04b") : "",
    ord("\uf04c") : "",
    ord("\uf04d") : "",
    ord("\uf04e") : "",
    ord("\uf04f") : "",
    ord("\uf050") : "",
    ord("\uf051") : "",
    ord("\uf052") : "",
    ord("\uf053") : "",
    ord("\uf054") : "",
    ord("\uf055") : "",
    ord("\uf056") : "",
    ord("\uf057") : "",
    ord("\uf058") : "",
    ord("\uf059") : "",
    ord("\uf05a") : "",
    ord("\uf05b") : "",
    ord("\uf05c") : "",
    ord("\uf05d") : "",
    ord("\uf05e") : "",
    ord("\uf05f") : "",
    ord("\uf060") : "",
    ord("\uf061") : "",
    ord("\uf062") : "",
    ord("\uf063") : "",
    ord("\uf064") : "",
    ord("\uf065") : "",
    ord("\uf066") : "",
    ord("\uf067") : "",
    ord("\uf068") : "",
    ord("\uf069") : "",
    ord("\uf06a") : "",
    ord("\uf06b") : "",
    ord("\uf06c") : "",
    ord("\uf06d") : "",
    ord("\uf06e") : "",
    ord("\uf06f") : "",
    ord("\uf070") : "",
    ord("\uf071") : "",
    ord("\uf072") : "",
    ord("\uf073") : "",
    ord("\uf074") : "",
    ord("\uf075") : "",
    ord("\uf076") : "",
    ord("\uf077") : "",
    ord("\uf078") : "",
    ord("\uf079") : "",
    ord("\uf07a") : "",
    ord("\uf07b") : "",
    ord("\uf07c") : "",
    ord("\uf07d") : "",
    ord("\uf07e") : "",
    ord("\uf07f") : "",
    ord("\uf080") : "",
    ord("\uf081") : "",
    ord("\uf082") : "",
    ord("\uf083") : "",
    ord("\uf084") : "",
    ord("\uf085") : "",
    ord("\uf086") : "",
    ord("\uf087") : "",
    ord("\uf088") : "",
    ord("\uf089") : "",
    ord("\uf08a") : "",
    ord("\uf08b") : "",
    ord("\uf08c") : "",
    ord("\uf08d") : "",
    ord("\uf08e") : "",
    ord("\uf08f") : "",
    ord("\uf090") : "",
    ord("\uf091") : "",
    ord("\uf092") : "",
    ord("\uf093") : "",
    ord("\uf094") : "",
    ord("\uf095") : "",
    ord("\uf096") : "",
    ord("\uf097") : "",
    ord("\uf098") : "",
    ord("\uf099") : "",
    ord("\uf09a") : "",
    ord("\uf09b") : "",
    ord("\uf09c") : "",
    ord("\uf09d") : "",
    ord("\uf09e") : "",
    ord("\uf09f") : "",
    ord("\uf0a0") : "",
    ord("\uf0a1") : "",
    ord("\uf0a2") : "",
    ord("\uf0a3") : "",
    ord("\uf0a4") : "",
    ord("\uf0a5") : "",
    ord("\uf0a6") : "",
    ord("\uf0a7") : "",
    ord("\uf0a8") : "",
    ord("\uf0a9") : "",
    ord("\uf0aa") : "",
    ord("\uf0ab") : "",
    ord("\uf0ac") : "",
    ord("\uf0ad") : "",
    ord("\uf0ae") : "",
    ord("\uf0af") : "",
    ord("\uf0b0") : "",
    ord("\uf0b1") : "",
    ord("\uf0b2") : "",
    ord("\uf0b3") : "",
    ord("\uf0b4") : "",
    ord("\uf0b5") : "",
    ord("\uf0b6") : "",
    ord("\uf0b7") : "",
    ord("\uf0b8") : "",
    ord("\uf0b9") : "",
    ord("\uf0ba") : "",
    ord("\uf0bb") : "",
    ord("\uf0bc") : "",
    ord("\uf0bd") : "",
    ord("\uf0be") : "",
    ord("\uf0bf") : "",
    ord("\uf0c0") : "",
    ord("\uf0c1") : "",
    ord("\uf0c2") : "",
    ord("\uf0c3") : "",
    ord("\uf0c4") : "",
    ord("\uf0c5") : "",
    ord("\uf0c6") : "",
    ord("\uf0c7") : "",
    ord("\uf0c8") : "",
    ord("\uf0c9") : "",
    ord("\uf0ca") : "",
    ord("\uf0cb") : "",
    ord("\uf0cc") : "",
    ord("\uf0cd") : "",
    ord("\uf0ce") : "",
    ord("\uf0cf") : "",
    ord("\uf0d0") : "",
    ord("\uf0d1") : "",
    ord("\uf0d2") : "",
    ord("\uf0d3") : "",
    ord("\uf0d4") : "",
    ord("\uf0d5") : "",
    ord("\uf0d6") : "",
    ord("\uf0d7") : "",
    ord("\uf0d8") : "",
    ord("\uf0d9") : "",
    ord("\uf0da") : "",
    ord("\uf0db") : "",
    ord("\uf0dc") : "",
    ord("\uf0dd") : "",
    ord("\uf0de") : "",
    ord("\uf0df") : "",
    ord("\uf0e0") : "",
    ord("\uf0e1") : "",
    ord("\uf0e2") : "",
    ord("\uf0e3") : "",
    ord("\uf0e4") : "",
    ord("\uf0e5") : "",
    ord("\uf0e6") : "",
    ord("\uf0e7") : "",
    ord("\uf0e8") : "",
    ord("\uf0e9") : "",
    ord("\uf0ea") : "",
    ord("\uf0eb") : "",
    ord("\uf0ec") : "",
    ord("\uf0ed") : "",
    ord("\uf0ee") : "",
    ord("\uf0ef") : "",
    ord("\uf0f0") : "",
    ord("\uf0f1") : "",
    ord("\uf0f2") : "",
    ord("\uf0f3") : "",
    ord("\uf0f4") : "",
    ord("\uf0f5") : "",
    ord("\uf0f6") : "",
    ord("\uf0f7") : "",
    ord("\uf0f8") : "",
    ord("\uf0f9") : "",
    ord("\uf0fa") : "",
    ord("\uf0fb") : "",
    ord("\uf0fc") : "",
    ord("\uf0fd") : "",
    ord("\uf0fe") : "",
    ord("\uf0ff") : "",
    ord("\uf100") : "",
    ord("\uf101") : "",
    ord("\uf102") : "",
    ord("\uf103") : "",
    ord("\uf104") : "",
    ord("\uf105") : "",
    ord("\uf106") : "",
    ord("\uf107") : "",
    ord("\uf108") : "",
    ord("\uf109") : "",
    ord("\uf10a") : "",
    ord("\uf10b") : "",
    ord("\uf10c") : "",
    ord("\uf10d") : "",
    ord("\uf10e") : "",
    ord("\uf10f") : "",
    ord("\uf110") : "",
    ord("\uf111") : "",
    ord("\uf112") : "",
    ord("\uf113") : "",
    ord("\uf114") : "",
    ord("\uf115") : "",
    ord("\uf116") : "",
    ord("\uf117") : "",
    ord("\uf118") : "",
    ord("\uf119") : "",
    ord("\uf11a") : "",
    ord("\uf11b") : "",
    ord("\uf11c") : "",
    ord("\uf11d") : "",
    ord("\uf11e") : "",
    ord("\uf11f") : "",
    ord("\uf120") : "",
    ord("\uf121") : "",
    ord("\uf122") : "",
    ord("\uf123") : "",
    ord("\uf124") : "",
    ord("\uf125") : "",
    ord("\uf126") : "",
    ord("\uf127") : "",
    ord("\uf128") : "",
    ord("\uf129") : "",
    ord("\uf12a") : "",
    ord("\uf12b") : "",
    ord("\uf12c") : "",
    ord("\uf12d") : "",
    ord("\uf12e") : "",
    ord("\uf12f") : "",
    ord("\uf130") : "",
    ord("\uf131") : "",
    ord("\uf132") : "",
    ord("\uf133") : "",
    ord("\uf134") : "",
    ord("\uf135") : "",
    ord("\uf136") : "",
    ord("\uf137") : "",
    ord("\uf138") : "",
    ord("\uf139") : "",
    ord("\uf13a") : "",
    ord("\uf13b") : "",
    ord("\uf13c") : "",
    ord("\uf13d") : "",
    ord("\uf13e") : "",
    ord("\uf13f") : "",
    ord("\uf140") : "",
    ord("\uf141") : "",
    ord("\uf142") : "",
    ord("\uf143") : "",
    ord("\uf144") : "",
    ord("\uf145") : "",
    ord("\uf146") : "",
    ord("\uf147") : "",
    ord("\uf148") : "",
    ord("\uf149") : "",
    ord("\uf14a") : "",
    ord("\uf14b") : "",
    ord("\uf14c") : "",
    ord("\uf14d") : "",
    ord("\uf14e") : "",
    ord("\uf14f") : "",
    ord("\uf150") : "",
    ord("\uf151") : "",
    ord("\uf152") : "",
    ord("\uf153") : "",
    ord("\uf154") : "",
    ord("\uf155") : "",
    ord("\uf156") : "",
    ord("\uf157") : "",
    ord("\uf158") : "",
    ord("\uf159") : "",
    ord("\uf15a") : "",
    ord("\uf15b") : "",
    ord("\uf15c") : "",
    ord("\uf15d") : "",
    ord("\uf15e") : "",
    ord("\uf15f") : "",
    ord("\uf160") : "",
    ord("\uf161") : "",
    ord("\uf162") : "",
    ord("\uf163") : "",
    ord("\uf164") : "",
    ord("\uf165") : "",
    ord("\uf166") : "",
    ord("\uf167") : "",
    ord("\uf168") : "",
    ord("\uf169") : "",
    ord("\uf16a") : "",
    ord("\uf16b") : "",
    ord("\uf16c") : "",
    ord("\uf16d") : "",
    ord("\uf16e") : "",
    ord("\uf16f") : "",
    ord("\uf170") : "",
    ord("\uf171") : "",
    ord("\uf172") : "",
    ord("\uf173") : "",
    ord("\uf174") : "",
    ord("\uf175") : "",
    ord("\uf176") : "",
    ord("\uf177") : "",
    ord("\uf178") : "",
    ord("\uf179") : "",
    ord("\uf17a") : "",
    ord("\uf17b") : "",
    ord("\uf17c") : "",
    ord("\uf17d") : "",
    ord("\uf17e") : "",
    ord("\uf17f") : "",
    ord("\uf180") : "",
    ord("\uf181") : "",
    ord("\uf182") : "",
    ord("\uf183") : "",
    ord("\uf184") : "",
    ord("\uf185") : "",
    ord("\uf186") : "",
    ord("\uf187") : "",
    ord("\uf188") : "",
    ord("\uf189") : "",
    ord("\uf18a") : "",
    ord("\uf18b") : "",
    ord("\uf18c") : "",
    ord("\uf18d") : "",
    ord("\uf18e") : "",
    ord("\uf18f") : "",
    ord("\uf190") : "",
    ord("\uf191") : "",
    ord("\uf192") : "",
    ord("\uf193") : "",
    ord("\uf194") : "",
    ord("\uf195") : "",
    ord("\uf196") : "",
    ord("\uf197") : "",
    ord("\uf198") : "",
    ord("\uf199") : "",
    ord("\uf19a") : "",
    ord("\uf19b") : "",
    ord("\uf19c") : "",
    ord("\uf19d") : "",
    ord("\uf19e") : "",
    ord("\uf19f") : "",
    ord("\uf1a0") : "",
    ord("\uf1a1") : "",
    ord("\uf1a2") : "",
    ord("\uf1a3") : "",
    ord("\uf1a4") : "",
    ord("\uf1a5") : "",
    ord("\uf1a6") : "",
    ord("\uf1a7") : "",
    ord("\uf1a8") : "",
    ord("\uf1a9") : "",
    ord("\uf1aa") : "",
    ord("\uf1ab") : "",
    ord("\uf1ac") : "",
    ord("\uf1ad") : "",
    ord("\uf1ae") : "",
    ord("\uf1af") : "",
    ord("\uf1b0") : "",
    ord("\uf1b1") : "",
    ord("\uf1b2") : "",
    ord("\uf1b3") : "",
    ord("\uf1b4") : "",
    ord("\uf1b5") : "",
    ord("\uf1b6") : "",
    ord("\uf1b7") : "",
    ord("\uf1b8") : "",
    ord("\uf1b9") : "",
    ord("\uf1ba") : "",
    ord("\uf1bb") : "",
    ord("\uf1bc") : "",
    ord("\uf1bd") : "",
    ord("\uf1be") : "",
    ord("\uf1bf") : "",
    ord("\uf1c0") : "",
    ord("\uf1c1") : "",
    ord("\uf1c2") : "",
    ord("\uf1c3") : "",
    ord("\uf1c4") : "",
    ord("\uf1c5") : "",
    ord("\uf1c6") : "",
    ord("\uf1c7") : "",
    ord("\uf1c8") : "",
    ord("\uf1c9") : "",
    ord("\uf1ca") : "",
    ord("\uf1cb") : "",
    ord("\uf1cc") : "",
    ord("\uf1cd") : "",
    ord("\uf1ce") : "",
    ord("\uf1cf") : "",
    ord("\uf1d0") : "",
    ord("\uf1d1") : "",
    ord("\uf1d2") : "",
    ord("\uf1d3") : "",
    ord("\uf1d4") : "",
    ord("\uf1d5") : "",
    ord("\uf1d6") : "",
    ord("\uf1d7") : "",
    ord("\uf1d8") : "",
    ord("\uf1d9") : "",
    ord("\uf1da") : "",
    ord("\uf1db") : "",
    ord("\uf1dc") : "",
    ord("\uf1dd") : "",
    ord("\uf1de") : "",
    ord("\uf1df") : "",
    ord("\uf1e0") : "",
    ord("\uf1e1") : "",
    ord("\uf1e2") : "",
    ord("\uf1e3") : "",
    ord("\uf1e4") : "",
    ord("\uf1e5") : "",
    ord("\uf1e6") : "",
    ord("\uf1e7") : "",
    ord("\uf1e8") : "",
    ord("\uf1e9") : "",
    ord("\uf1ea") : "",
    ord("\uf1eb") : "",
    ord("\uf1ec") : "",
    ord("\uf1ed") : "",
    ord("\uf1ee") : "",
    ord("\uf1ef") : "",
    ord("\uf1f0") : "",
    ord("\uf1f1") : "",
    ord("\uf1f2") : "",
    ord("\uf1f3") : "",
    ord("\uf1f4") : "",
    ord("\uf1f5") : "",
    ord("\uf1f6") : "",
    ord("\uf1f7") : "",
    ord("\uf1f8") : "",
    ord("\uf1f9") : "",
    ord("\uf1fa") : "",
    ord("\uf1fb") : "",
    ord("\uf1fc") : "",
    ord("\uf1fd") : "",
    ord("\uf1fe") : "",
    ord("\uf1ff") : "",
    ord("\uf200") : "",
    ord("\uf201") : "",
    ord("\uf202") : "",
    ord("\uf203") : "",
    ord("\uf204") : "",
    ord("\uf205") : "",
    ord("\uf206") : "",
    ord("\uf207") : "",
    ord("\uf208") : "",
    ord("\uf209") : "",
    ord("\uf20a") : "",
    ord("\uf20b") : "",
    ord("\uf20c") : "",
    ord("\uf20d") : "",
    ord("\uf20e") : "",
    ord("\uf20f") : "",
    ord("\uf210") : "",
    ord("\uf211") : "",
    ord("\uf212") : "",
    ord("\uf213") : "",
    ord("\uf214") : "",
    ord("\uf215") : "",
    ord("\uf216") : "",
    ord("\uf217") : "",
    ord("\uf218") : "",
    ord("\uf219") : "",
    ord("\uf21a") : "",
    ord("\uf21b") : "",
    ord("\uf21c") : "",
    ord("\uf21d") : "",
    ord("\uf21e") : "",
    ord("\uf21f") : "",
    ord("\uf220") : "",
    ord("\uf221") : "",
    ord("\uf222") : "",
    ord("\uf223") : "",
    ord("\uf224") : "",
    ord("\uf225") : "",
    ord("\uf226") : "",
    ord("\uf227") : "",
    ord("\uf228") : "",
    ord("\uf229") : "",
    ord("\uf22a") : "",
    ord("\uf22b") : "",
    ord("\uf22c") : "",
    ord("\uf22d") : "",
    ord("\uf22e") : "",
    ord("\uf22f") : "",
    ord("\uf230") : "",
    ord("\uf231") : "",
    ord("\uf232") : "",
    ord("\uf233") : "",
    ord("\uf234") : "",
    ord("\uf235") : "",
    ord("\uf236") : "",
    ord("\uf237") : "",
    ord("\uf238") : "",
    ord("\uf239") : "",
    ord("\uf23a") : "",
    ord("\uf23b") : "",
    ord("\uf23c") : "",
    ord("\uf23d") : "",
    ord("\uf23e") : "",
    ord("\uf23f") : "",
    ord("\uf240") : "",
    ord("\uf241") : "",
    ord("\uf242") : "",
    ord("\uf243") : "",
    ord("\uf244") : "",
    ord("\uf245") : "",
    ord("\uf246") : "",
    ord("\uf247") : "",
    ord("\uf248") : "",
    ord("\uf249") : "",
    ord("\uf24a") : "",
    ord("\uf24b") : "",
    ord("\uf24c") : "",
    ord("\uf24d") : "",
    ord("\uf24e") : "",
    ord("\uf24f") : "",
    ord("\uf250") : "",
    ord("\uf251") : "",
    ord("\uf252") : "",
    ord("\uf253") : "",
    ord("\uf254") : "",
    ord("\uf255") : "",
    ord("\uf256") : "",
    ord("\uf257") : "",
    ord("\uf258") : "",
    ord("\uf259") : "",
    ord("\uf25a") : "",
    ord("\uf25b") : "",
    ord("\uf25c") : "",
    ord("\uf25d") : "",
    ord("\uf25e") : "",
    ord("\uf25f") : "",
    ord("\uf260") : "",
    ord("\uf261") : "",
    ord("\uf262") : "",
    ord("\uf263") : "",
    ord("\uf264") : "",
    ord("\uf265") : "",
    ord("\uf266") : "",
    ord("\uf267") : "",
    ord("\uf268") : "",
    ord("\uf269") : "",
    ord("\uf26a") : "",
    ord("\uf26b") : "",
    ord("\uf26c") : "",
    ord("\uf26d") : "",
    ord("\uf26e") : "",
    ord("\uf26f") : "",
    ord("\uf270") : "",
    ord("\uf271") : "",
    ord("\uf272") : "",
    ord("\uf273") : "",
    ord("\uf274") : "",
    ord("\uf275") : "",
    ord("\uf276") : "",
    ord("\uf277") : "",
    ord("\uf278") : "",
    ord("\uf279") : "",
    ord("\uf27a") : "",
    ord("\uf27b") : "",
    ord("\uf27c") : "",
    ord("\uf27d") : "",
    ord("\uf27e") : "",
    ord("\uf27f") : "",
    ord("\uf280") : "",
    ord("\uf281") : "",
    ord("\uf282") : "",
    ord("\uf283") : "",
    ord("\uf284") : "",
    ord("\uf285") : "",
    ord("\uf286") : "",
    ord("\uf287") : "",
    ord("\uf288") : "",
    ord("\uf289") : "",
    ord("\uf28a") : "",
    ord("\uf28b") : "",
    ord("\uf28c") : "",
    ord("\uf28d") : "",
    ord("\uf28e") : "",
    ord("\uf28f") : "",
    ord("\uf290") : "",
    ord("\uf291") : "",
    ord("\uf292") : "",
    ord("\uf293") : "",
    ord("\uf294") : "",
    ord("\uf295") : "",
    ord("\uf296") : "",
    ord("\uf297") : "",
    ord("\uf298") : "",
    ord("\uf299") : "",
    ord("\uf29a") : "",
    ord("\uf29b") : "",
    ord("\uf29c") : "",
    ord("\uf29d") : "",
    ord("\uf29e") : "",
    ord("\uf29f") : "",
    ord("\uf2a0") : "",
    ord("\uf2a1") : "",
    ord("\uf2a2") : "",
    ord("\uf2a3") : "",
    ord("\uf2a4") : "",
    ord("\uf2a5") : "",
    ord("\uf2a6") : "",
    ord("\uf2a7") : "",
    ord("\uf2a8") : "",
    ord("\uf2a9") : "",
    ord("\uf2aa") : "",
    ord("\uf2ab") : "",
    ord("\uf2ac") : "",
    ord("\uf2ad") : "",
    ord("\uf2ae") : "",
    ord("\uf2af") : "",
    ord("\uf2b0") : "",
    ord("\uf2b1") : "",
    ord("\uf2b2") : "",
    ord("\uf2b3") : "",
    ord("\uf2b4") : "",
    ord("\uf2b5") : "",
    ord("\uf2b6") : "",
    ord("\uf2b7") : "",
    ord("\uf2b8") : "",
    ord("\uf2b9") : "",
    ord("\uf2ba") : "",
    ord("\uf2bb") : "",
    ord("\uf2bc") : "",
    ord("\uf2bd") : "",
    ord("\uf2be") : "",
    ord("\uf2bf") : "",
    ord("\uf2c0") : "",
    ord("\uf2c1") : "",
    ord("\uf2c2") : "",
    ord("\uf2c3") : "",
    ord("\uf2c4") : "",
    ord("\uf2c5") : "",
    ord("\uf2c6") : "",
    ord("\uf2c7") : "",
    ord("\uf2c8") : "",
    ord("\uf2c9") : "",
    ord("\uf2ca") : "",
    ord("\uf2cb") : "",
    ord("\uf2cc") : "",
    ord("\uf2cd") : "",
    ord("\uf2ce") : "",
    ord("\uf2cf") : "",
    ord("\uf2d0") : "",
    ord("\uf2d1") : "",
    ord("\uf2d2") : "",
    ord("\uf2d3") : "",
    ord("\uf2d4") : "",
    ord("\uf2d5") : "",
    ord("\uf2d6") : "",
    ord("\uf2d7") : "",
    ord("\uf2d8") : "",
    ord("\uf2d9") : "",
    ord("\uf2da") : "",
    ord("\uf2db") : "",
    ord("\uf2dc") : "",
    ord("\uf2dd") : "",
    ord("\uf2de") : "",
    ord("\uf2df") : "",
    ord("\uf2e0") : "",
    ord("\uf2e1") : "",
    ord("\uf2e2") : "",
    ord("\uf2e3") : "",
    ord("\uf2e4") : "",
    ord("\uf2e5") : "",
    ord("\uf2e6") : "",
    ord("\uf2e7") : "",
    ord("\uf2e8") : "",
    ord("\uf2e9") : "",
    ord("\uf2ea") : "",
    ord("\uf2eb") : "",
    ord("\uf2ec") : "",
    ord("\uf2ed") : "",
    ord("\uf2ee") : "",
    ord("\uf2ef") : "",
    ord("\uf2f0") : "",
    ord("\uf2f1") : "",
    ord("\uf2f2") : "",
    ord("\uf2f3") : "",
    ord("\uf2f4") : "",
    ord("\uf2f5") : "",
    ord("\uf2f6") : "",
    ord("\uf2f7") : "",
    ord("\uf2f8") : "",
    ord("\uf2f9") : "",
    ord("\uf2fa") : "",
    ord("\uf2fb") : "",
    ord("\uf2fc") : "",
    ord("\uf2fd") : "",
    ord("\uf2fe") : "",
    ord("\uf2ff") : "",
    ord("\uf300") : "",
    ord("\uf301") : "",
    ord("\uf302") : "",
    ord("\uf303") : "",
    ord("\uf304") : "",
    ord("\uf305") : "",
    ord("\uf306") : "",
    ord("\uf307") : "",
    ord("\uf308") : "",
    ord("\uf309") : "",
    ord("\uf30a") : "",
    ord("\uf30b") : "",
    ord("\uf30c") : "",
    ord("\uf30d") : "",
    ord("\uf30e") : "",
    ord("\uf30f") : "",
    ord("\uf310") : "",
    ord("\uf311") : "",
    ord("\uf312") : "",
    ord("\uf313") : "",
    ord("\uf314") : "",
    ord("\uf315") : "",
    ord("\uf316") : "",
    ord("\uf317") : "",
    ord("\uf318") : "",
    ord("\uf319") : "",
    ord("\uf31a") : "",
    ord("\uf31b") : "",
    ord("\uf31c") : "",
    ord("\uf31d") : "",
    ord("\uf31e") : "",
    ord("\uf31f") : "",
    ord("\uf320") : "",
    ord("\uf321") : "",
    ord("\uf322") : "",
    ord("\uf323") : "",
    ord("\uf324") : "",
    ord("\uf325") : "",
    ord("\uf326") : "",
    ord("\uf327") : "",
    ord("\uf328") : "",
    ord("\uf329") : "",
    ord("\uf32a") : "",
    ord("\uf32b") : "",
    ord("\uf32c") : "",
    ord("\uf32d") : "",
    ord("\uf32e") : "",
    ord("\uf32f") : "",
    ord("\uf330") : "",
    ord("\uf331") : "",
    ord("\uf332") : "",
    ord("\uf333") : "",
    ord("\uf334") : "",
    ord("\uf335") : "",
    ord("\uf336") : "",
    ord("\uf337") : "",
    ord("\uf338") : "",
    ord("\uf339") : "",
    ord("\uf33a") : "",
    ord("\uf33b") : "",
    ord("\uf33c") : "",
    ord("\uf33d") : "",
    ord("\uf33e") : "",
    ord("\uf33f") : "",
    ord("\uf340") : "",
    ord("\uf341") : "",
    ord("\uf342") : "",
    ord("\uf343") : "",
    ord("\uf344") : "",
    ord("\uf345") : "",
    ord("\uf346") : "",
    ord("\uf347") : "",
    ord("\uf348") : "",
    ord("\uf349") : "",
    ord("\uf34a") : "",
    ord("\uf34b") : "",
    ord("\uf34c") : "",
    ord("\uf34d") : "",
    ord("\uf34e") : "",
    ord("\uf34f") : "",
    ord("\uf350") : "",
    ord("\uf351") : "",
    ord("\uf352") : "",
    ord("\uf353") : "",
    ord("\uf354") : "",
    ord("\uf355") : "",
    ord("\uf356") : "",
    ord("\uf357") : "",
    ord("\uf358") : "",
    ord("\uf359") : "",
    ord("\uf35a") : "",
    ord("\uf35b") : "",
    ord("\uf35c") : "",
    ord("\uf35d") : "",
    ord("\uf35e") : "",
    ord("\uf35f") : "",
    ord("\uf360") : "",
    ord("\uf361") : "",
    ord("\uf362") : "",
    ord("\uf363") : "",
    ord("\uf364") : "",
    ord("\uf365") : "",
    ord("\uf366") : "",
    ord("\uf367") : "",
    ord("\uf368") : "",
    ord("\uf369") : "",
    ord("\uf36a") : "",
    ord("\uf36b") : "",
    ord("\uf36c") : "",
    ord("\uf36d") : "",
    ord("\uf36e") : "",
    ord("\uf36f") : "",
    ord("\uf370") : "",
    ord("\uf371") : "",
    ord("\uf372") : "",
    ord("\uf373") : "",
    ord("\uf374") : "",
    ord("\uf375") : "",
    ord("\uf376") : "",
    ord("\uf377") : "",
    ord("\uf378") : "",
    ord("\uf379") : "",
    ord("\uf37a") : "",
    ord("\uf37b") : "",
    ord("\uf37c") : "",
    ord("\uf37d") : "",
    ord("\uf37e") : "",
    ord("\uf37f") : "",
    ord("\uf380") : "",
    ord("\uf381") : "",
    ord("\uf382") : "",
    ord("\uf383") : "",
    ord("\uf384") : "",
    ord("\uf385") : "",
    ord("\uf386") : "",
    ord("\uf387") : "",
    ord("\uf388") : "",
    ord("\uf389") : "",
    ord("\uf38a") : "",
    ord("\uf38b") : "",
    ord("\uf38c") : "",
    ord("\uf38d") : "",
    ord("\uf38e") : "",
    ord("\uf38f") : "",
    ord("\uf390") : "",
    ord("\uf391") : "",
    ord("\uf392") : "",
    ord("\uf393") : "",
    ord("\uf394") : "",
    ord("\uf395") : "",
    ord("\uf396") : "",
    ord("\uf397") : "",
    ord("\uf398") : "",
    ord("\uf399") : "",
    ord("\uf39a") : "",
    ord("\uf39b") : "",
    ord("\uf39c") : "",
    ord("\uf39d") : "",
    ord("\uf39e") : "",
    ord("\uf39f") : "",
    ord("\uf3a0") : "",
    ord("\uf3a1") : "",
    ord("\uf3a2") : "",
    ord("\uf3a3") : "",
    ord("\uf3a4") : "",
    ord("\uf3a5") : "",
    ord("\uf3a6") : "",
    ord("\uf3a7") : "",
    ord("\uf3a8") : "",
    ord("\uf3a9") : "",
    ord("\uf3aa") : "",
    ord("\uf3ab") : "",
    ord("\uf3ac") : "",
    ord("\uf3ad") : "",
    ord("\uf3ae") : "",
    ord("\uf3af") : "",
    ord("\uf3b0") : "",
    ord("\uf3b1") : "",
    ord("\uf3b2") : "",
    ord("\uf3b3") : "",
    ord("\uf3b4") : "",
    ord("\uf3b5") : "",
    ord("\uf3b6") : "",
    ord("\uf3b7") : "",
    ord("\uf3b8") : "",
    ord("\uf3b9") : "",
    ord("\uf3ba") : "",
    ord("\uf3bb") : "",
    ord("\uf3bc") : "",
    ord("\uf3bd") : "",
    ord("\uf3be") : "",
    ord("\uf3bf") : "",
    ord("\uf3c0") : "",
    ord("\uf3c1") : "",
    ord("\uf3c2") : "",
    ord("\uf3c3") : "",
    ord("\uf3c4") : "",
    ord("\uf3c5") : "",
    ord("\uf3c6") : "",
    ord("\uf3c7") : "",
    ord("\uf3c8") : "",
    ord("\uf3c9") : "",
    ord("\uf3ca") : "",
    ord("\uf3cb") : "",
    ord("\uf3cc") : "",
    ord("\uf3cd") : "",
    ord("\uf3ce") : "",
    ord("\uf3cf") : "",
    ord("\uf3d0") : "",
    ord("\uf3d1") : "",
    ord("\uf3d2") : "",
    ord("\uf3d3") : "",
    ord("\uf3d4") : "",
    ord("\uf3d5") : "",
    ord("\uf3d6") : "",
    ord("\uf3d7") : "",
    ord("\uf3d8") : "",
    ord("\uf3d9") : "",
    ord("\uf3da") : "",
    ord("\uf3db") : "",
    ord("\uf3dc") : "",
    ord("\uf3dd") : "",
    ord("\uf3de") : "",
    ord("\uf3df") : "",
    ord("\uf3e0") : "",
    ord("\uf3e1") : "",
    ord("\uf3e2") : "",
    ord("\uf3e3") : "",
    ord("\uf3e4") : "",
    ord("\uf3e5") : "",
    ord("\uf3e6") : "",
    ord("\uf3e7") : "",
    ord("\uf3e8") : "",
    ord("\uf3e9") : "",
    ord("\uf3ea") : "",
    ord("\uf3eb") : "",
    ord("\uf3ec") : "",
    ord("\uf3ed") : "",
    ord("\uf3ee") : "",
    ord("\uf3ef") : "",
    ord("\uf3f0") : "",
    ord("\uf3f1") : "",
    ord("\uf3f2") : "",
    ord("\uf3f3") : "",
    ord("\uf3f4") : "",
    ord("\uf3f5") : "",
    ord("\uf3f6") : "",
    ord("\uf3f7") : "",
    ord("\uf3f8") : "",
    ord("\uf3f9") : "",
    ord("\uf3fa") : "",
    ord("\uf3fb") : "",
    ord("\uf3fc") : "",
    ord("\uf3fd") : "",
    ord("\uf3fe") : "",
    ord("\uf3ff") : "",
    ord("\uf400") : "",
    ord("\uf401") : "",
    ord("\uf402") : "",
    ord("\uf403") : "",
    ord("\uf404") : "",
    ord("\uf405") : "",
    ord("\uf406") : "",
    ord("\uf407") : "",
    ord("\uf408") : "",
    ord("\uf409") : "",
    ord("\uf40a") : "",
    ord("\uf40b") : "",
    ord("\uf40c") : "",
    ord("\uf40d") : "",
    ord("\uf40e") : "",
    ord("\uf40f") : "",
    ord("\uf410") : "",
    ord("\uf411") : "",
    ord("\uf412") : "",
    ord("\uf413") : "",
    ord("\uf414") : "",
    ord("\uf415") : "",
    ord("\uf416") : "",
    ord("\uf417") : "",
    ord("\uf418") : "",
    ord("\uf419") : "",
    ord("\uf41a") : "",
    ord("\uf41b") : "",
    ord("\uf41c") : "",
    ord("\uf41d") : "",
    ord("\uf41e") : "",
    ord("\uf41f") : "",
    ord("\uf420") : "",
    ord("\uf421") : "",
    ord("\uf422") : "",
    ord("\uf423") : "",
    ord("\uf424") : "",
    ord("\uf425") : "",
    ord("\uf426") : "",
    ord("\uf427") : "",
    ord("\uf428") : "",
    ord("\uf429") : "",
    ord("\uf42a") : "",
    ord("\uf42b") : "",
    ord("\uf42c") : "",
    ord("\uf42d") : "",
    ord("\uf42e") : "",
    ord("\uf42f") : "",
    ord("\uf430") : "",
    ord("\uf431") : "",
    ord("\uf432") : "",
    ord("\uf433") : "",
    ord("\uf434") : "",
    ord("\uf435") : "",
    ord("\uf436") : "",
    ord("\uf437") : "",
    ord("\uf438") : "",
    ord("\uf439") : "",
    ord("\uf43a") : "",
    ord("\uf43b") : "",
    ord("\uf43c") : "",
    ord("\uf43d") : "",
    ord("\uf43e") : "",
    ord("\uf43f") : "",
    ord("\uf440") : "",
    ord("\uf441") : "",
    ord("\uf442") : "",
    ord("\uf443") : "",
    ord("\uf444") : "",
    ord("\uf445") : "",
    ord("\uf446") : "",
    ord("\uf447") : "",
    ord("\uf448") : "",
    ord("\uf449") : "",
    ord("\uf44a") : "",
    ord("\uf44b") : "",
    ord("\uf44c") : "",
    ord("\uf44d") : "",
    ord("\uf44e") : "",
    ord("\uf44f") : "",
    ord("\uf450") : "",
    ord("\uf451") : "",
    ord("\uf452") : "",
    ord("\uf453") : "",
    ord("\uf454") : "",
    ord("\uf455") : "",
    ord("\uf456") : "",
    ord("\uf457") : "",
    ord("\uf458") : "",
    ord("\uf459") : "",
    ord("\uf45a") : "",
    ord("\uf45b") : "",
    ord("\uf45c") : "",
    ord("\uf45d") : "",
    ord("\uf45e") : "",
    ord("\uf45f") : "",
    ord("\uf460") : "",
    ord("\uf461") : "",
    ord("\uf462") : "",
    ord("\uf463") : "",
    ord("\uf464") : "",
    ord("\uf465") : "",
    ord("\uf466") : "",
    ord("\uf467") : "",
    ord("\uf468") : "",
    ord("\uf469") : "",
    ord("\uf46a") : "",
    ord("\uf46b") : "",
    ord("\uf46c") : "",
    ord("\uf46d") : "",
    ord("\uf46e") : "",
    ord("\uf46f") : "",
    ord("\uf470") : "",
    ord("\uf471") : "",
    ord("\uf472") : "",
    ord("\uf473") : "",
    ord("\uf474") : "",
    ord("\uf475") : "",
    ord("\uf476") : "",
    ord("\uf477") : "",
    ord("\uf478") : "",
    ord("\uf479") : "",
    ord("\uf47a") : "",
    ord("\uf47b") : "",
    ord("\uf47c") : "",
    ord("\uf47d") : "",
    ord("\uf47e") : "",
    ord("\uf47f") : "",
    ord("\uf480") : "",
    ord("\uf481") : "",
    ord("\uf482") : "",
    ord("\uf483") : "",
    ord("\uf484") : "",
    ord("\uf485") : "",
    ord("\uf486") : "",
    ord("\uf487") : "",
    ord("\uf488") : "",
    ord("\uf489") : "",
    ord("\uf48a") : "",
    ord("\uf48b") : "",
    ord("\uf48c") : "",
    ord("\uf48d") : "",
    ord("\uf48e") : "",
    ord("\uf48f") : "",
    ord("\uf490") : "",
    ord("\uf491") : "",
    ord("\uf492") : "",
    ord("\uf493") : "",
    ord("\uf494") : "",
    ord("\uf495") : "",
    ord("\uf496") : "",
    ord("\uf497") : "",
    ord("\uf498") : "",
    ord("\uf499") : "",
    ord("\uf49a") : "",
    ord("\uf49b") : "",
    ord("\uf49c") : "",
    ord("\uf49d") : "",
    ord("\uf49e") : "",
    ord("\uf49f") : "",
    ord("\uf4a0") : "",
    ord("\uf4a1") : "",
    ord("\uf4a2") : "",
    ord("\uf4a3") : "",
    ord("\uf4a4") : "",
    ord("\uf4a5") : "",
    ord("\uf4a6") : "",
    ord("\uf4a7") : "",
    ord("\uf4a8") : "",
    ord("\uf4a9") : "",
    ord("\uf4aa") : "",
    ord("\uf4ab") : "",
    ord("\uf4ac") : "",
    ord("\uf4ad") : "",
    ord("\uf4ae") : "",
    ord("\uf4af") : "",
    ord("\uf4b0") : "",
    ord("\uf4b1") : "",
    ord("\uf4b2") : "",
    ord("\uf4b3") : "",
    ord("\uf4b4") : "",
    ord("\uf4b5") : "",
    ord("\uf4b6") : "",
    ord("\uf4b7") : "",
    ord("\uf4b8") : "",
    ord("\uf4b9") : "",
    ord("\uf4ba") : "",
    ord("\uf4bb") : "",
    ord("\uf4bc") : "",
    ord("\uf4bd") : "",
    ord("\uf4be") : "",
    ord("\uf4bf") : "",
    ord("\uf4c0") : "",
    ord("\uf4c1") : "",
    ord("\uf4c2") : "",
    ord("\uf4c3") : "",
    ord("\uf4c4") : "",
    ord("\uf4c5") : "",
    ord("\uf4c6") : "",
    ord("\uf4c7") : "",
    ord("\uf4c8") : "",
    ord("\uf4c9") : "",
    ord("\uf4ca") : "",
    ord("\uf4cb") : "",
    ord("\uf4cc") : "",
    ord("\uf4cd") : "",
    ord("\uf4ce") : "",
    ord("\uf4cf") : "",
    ord("\uf4d0") : "",
    ord("\uf4d1") : "",
    ord("\uf4d2") : "",
    ord("\uf4d3") : "",
    ord("\uf4d4") : "",
    ord("\uf4d5") : "",
    ord("\uf4d6") : "",
    ord("\uf4d7") : "",
    ord("\uf4d8") : "",
    ord("\uf4d9") : "",
    ord("\uf4da") : "",
    ord("\uf4db") : "",
    ord("\uf4dc") : "",
    ord("\uf4dd") : "",
    ord("\uf4de") : "",
    ord("\uf4df") : "",
    ord("\uf4e0") : "",
    ord("\uf4e1") : "",
    ord("\uf4e2") : "",
    ord("\uf4e3") : "",
    ord("\uf4e4") : "",
    ord("\uf4e5") : "",
    ord("\uf4e6") : "",
    ord("\uf4e7") : "",
    ord("\uf4e8") : "",
    ord("\uf4e9") : "",
    ord("\uf4ea") : "",
    ord("\uf4eb") : "",
    ord("\uf4ec") : "",
    ord("\uf4ed") : "",
    ord("\uf4ee") : "",
    ord("\uf4ef") : "",
    ord("\uf4f0") : "",
    ord("\uf4f1") : "",
    ord("\uf4f2") : "",
    ord("\uf4f3") : "",
    ord("\uf4f4") : "",
    ord("\uf4f5") : "",
    ord("\uf4f6") : "",
    ord("\uf4f7") : "",
    ord("\uf4f8") : "",
    ord("\uf4f9") : "",
    ord("\uf4fa") : "",
    ord("\uf4fb") : "",
    ord("\uf4fc") : "",
    ord("\uf4fd") : "",
    ord("\uf4fe") : "",
    ord("\uf4ff") : "",
    ord("\uf500") : "",
    ord("\uf501") : "",
    ord("\uf502") : "",
    ord("\uf503") : "",
    ord("\uf504") : "",
    ord("\uf505") : "",
    ord("\uf506") : "",
    ord("\uf507") : "",
    ord("\uf508") : "",
    ord("\uf509") : "",
    ord("\uf50a") : "",
    ord("\uf50b") : "",
    ord("\uf50c") : "",
    ord("\uf50d") : "",
    ord("\uf50e") : "",
    ord("\uf50f") : "",
    ord("\uf510") : "",
    ord("\uf511") : "",
    ord("\uf512") : "",
    ord("\uf513") : "",
    ord("\uf514") : "",
    ord("\uf515") : "",
    ord("\uf516") : "",
    ord("\uf517") : "",
    ord("\uf518") : "",
    ord("\uf519") : "",
    ord("\uf51a") : "",
    ord("\uf51b") : "",
    ord("\uf51c") : "",
    ord("\uf51d") : "",
    ord("\uf51e") : "",
    ord("\uf51f") : "",
    ord("\uf520") : "",
    ord("\uf521") : "",
    ord("\uf522") : "",
    ord("\uf523") : "",
    ord("\uf524") : "",
    ord("\uf525") : "",
    ord("\uf526") : "",
    ord("\uf527") : "",
    ord("\uf528") : "",
    ord("\uf529") : "",
    ord("\uf52a") : "",
    ord("\uf52b") : "",
    ord("\uf52c") : "",
    ord("\uf52d") : "",
    ord("\uf52e") : "",
    ord("\uf52f") : "",
    ord("\uf530") : "",
    ord("\uf531") : "",
    ord("\uf532") : "",
    ord("\uf533") : "",
    ord("\uf534") : "",
    ord("\uf535") : "",
    ord("\uf536") : "",
    ord("\uf537") : "",
    ord("\uf538") : "",
    ord("\uf539") : "",
    ord("\uf53a") : "",
    ord("\uf53b") : "",
    ord("\uf53c") : "",
    ord("\uf53d") : "",
    ord("\uf53e") : "",
    ord("\uf53f") : "",
    ord("\uf540") : "",
    ord("\uf541") : "",
    ord("\uf542") : "",
    ord("\uf543") : "",
    ord("\uf544") : "",
    ord("\uf545") : "",
    ord("\uf546") : "",
    ord("\uf547") : "",
    ord("\uf548") : "",
    ord("\uf549") : "",
    ord("\uf54a") : "",
    ord("\uf54b") : "",
    ord("\uf54c") : "",
    ord("\uf54d") : "",
    ord("\uf54e") : "",
    ord("\uf54f") : "",
    ord("\uf550") : "",
    ord("\uf551") : "",
    ord("\uf552") : "",
    ord("\uf553") : "",
    ord("\uf554") : "",
    ord("\uf555") : "",
    ord("\uf556") : "",
    ord("\uf557") : "",
    ord("\uf558") : "",
    ord("\uf559") : "",
    ord("\uf55a") : "",
    ord("\uf55b") : "",
    ord("\uf55c") : "",
    ord("\uf55d") : "",
    ord("\uf55e") : "",
    ord("\uf55f") : "",
    ord("\uf560") : "",
    ord("\uf561") : "",
    ord("\uf562") : "",
    ord("\uf563") : "",
    ord("\uf564") : "",
    ord("\uf565") : "",
    ord("\uf566") : "",
    ord("\uf567") : "",
    ord("\uf568") : "",
    ord("\uf569") : "",
    ord("\uf56a") : "",
    ord("\uf56b") : "",
    ord("\uf56c") : "",
    ord("\uf56d") : "",
    ord("\uf56e") : "",
    ord("\uf56f") : "",
    ord("\uf570") : "",
    ord("\uf571") : "",
    ord("\uf572") : "",
    ord("\uf573") : "",
    ord("\uf574") : "",
    ord("\uf575") : "",
    ord("\uf576") : "",
    ord("\uf577") : "",
    ord("\uf578") : "",
    ord("\uf579") : "",
    ord("\uf57a") : "",
    ord("\uf57b") : "",
    ord("\uf57c") : "",
    ord("\uf57d") : "",
    ord("\uf57e") : "",
    ord("\uf57f") : "",
    ord("\uf580") : "",
    ord("\uf581") : "",
    ord("\uf582") : "",
    ord("\uf583") : "",
    ord("\uf584") : "",
    ord("\uf585") : "",
    ord("\uf586") : "",
    ord("\uf587") : "",
    ord("\uf588") : "",
    ord("\uf589") : "",
    ord("\uf58a") : "",
    ord("\uf58b") : "",
    ord("\uf58c") : "",
    ord("\uf58d") : "",
    ord("\uf58e") : "",
    ord("\uf58f") : "",
    ord("\uf590") : "",
    ord("\uf591") : "",
    ord("\uf592") : "",
    ord("\uf593") : "",
    ord("\uf594") : "",
    ord("\uf595") : "",
    ord("\uf596") : "",
    ord("\uf597") : "",
    ord("\uf598") : "",
    ord("\uf599") : "",
    ord("\uf59a") : "",
    ord("\uf59b") : "",
    ord("\uf59c") : "",
    ord("\uf59d") : "",
    ord("\uf59e") : "",
    ord("\uf59f") : "",
    ord("\uf5a0") : "",
    ord("\uf5a1") : "",
    ord("\uf5a2") : "",
    ord("\uf5a3") : "",
    ord("\uf5a4") : "",
    ord("\uf5a5") : "",
    ord("\uf5a6") : "",
    ord("\uf5a7") : "",
    ord("\uf5a8") : "",
    ord("\uf5a9") : "",
    ord("\uf5aa") : "",
    ord("\uf5ab") : "",
    ord("\uf5ac") : "",
    ord("\uf5ad") : "",
    ord("\uf5ae") : "",
    ord("\uf5af") : "",
    ord("\uf5b0") : "",
    ord("\uf5b1") : "",
    ord("\uf5b2") : "",
    ord("\uf5b3") : "",
    ord("\uf5b4") : "",
    ord("\uf5b5") : "",
    ord("\uf5b6") : "",
    ord("\uf5b7") : "",
    ord("\uf5b8") : "",
    ord("\uf5b9") : "",
    ord("\uf5ba") : "",
    ord("\uf5bb") : "",
    ord("\uf5bc") : "",
    ord("\uf5bd") : "",
    ord("\uf5be") : "",
    ord("\uf5bf") : "",
    ord("\uf5c0") : "",
    ord("\uf5c1") : "",
    ord("\uf5c2") : "",
    ord("\uf5c3") : "",
    ord("\uf5c4") : "",
    ord("\uf5c5") : "",
    ord("\uf5c6") : "",
    ord("\uf5c7") : "",
    ord("\uf5c8") : "",
    ord("\uf5c9") : "",
    ord("\uf5ca") : "",
    ord("\uf5cb") : "",
    ord("\uf5cc") : "",
    ord("\uf5cd") : "",
    ord("\uf5ce") : "",
    ord("\uf5cf") : "",
    ord("\uf5d0") : "",
    ord("\uf5d1") : "",
    ord("\uf5d2") : "",
    ord("\uf5d3") : "",
    ord("\uf5d4") : "",
    ord("\uf5d5") : "",
    ord("\uf5d6") : "",
    ord("\uf5d7") : "",
    ord("\uf5d8") : "",
    ord("\uf5d9") : "",
    ord("\uf5da") : "",
    ord("\uf5db") : "",
    ord("\uf5dc") : "",
    ord("\uf5dd") : "",
    ord("\uf5de") : "",
    ord("\uf5df") : "",
    ord("\uf5e0") : "",
    ord("\uf5e1") : "",
    ord("\uf5e2") : "",
    ord("\uf5e3") : "",
    ord("\uf5e4") : "",
    ord("\uf5e5") : "",
    ord("\uf5e6") : "",
    ord("\uf5e7") : "",
    ord("\uf5e8") : "",
    ord("\uf5e9") : "",
    ord("\uf5ea") : "",
    ord("\uf5eb") : "",
    ord("\uf5ec") : "",
    ord("\uf5ed") : "",
    ord("\uf5ee") : "",
    ord("\uf5ef") : "",
    ord("\uf5f0") : "",
    ord("\uf5f1") : "",
    ord("\uf5f2") : "",
    ord("\uf5f3") : "",
    ord("\uf5f4") : "",
    ord("\uf5f5") : "",
    ord("\uf5f6") : "",
    ord("\uf5f7") : "",
    ord("\uf5f8") : "",
    ord("\uf5f9") : "",
    ord("\uf5fa") : "",
    ord("\uf5fb") : "",
    ord("\uf5fc") : "",
    ord("\uf5fd") : "",
    ord("\uf5fe") : "",
    ord("\uf5ff") : "",
    ord("\uf600") : "",
    ord("\uf601") : "",
    ord("\uf602") : "",
    ord("\uf603") : "",
    ord("\uf604") : "",
    ord("\uf605") : "",
    ord("\uf606") : "",
    ord("\uf607") : "",
    ord("\uf608") : "",
    ord("\uf609") : "",
    ord("\uf60a") : "",
    ord("\uf60b") : "",
    ord("\uf60c") : "",
    ord("\uf60d") : "",
    ord("\uf60e") : "",
    ord("\uf60f") : "",
    ord("\uf610") : "",
    ord("\uf611") : "",
    ord("\uf612") : "",
    ord("\uf613") : "",
    ord("\uf614") : "",
    ord("\uf615") : "",
    ord("\uf616") : "",
    ord("\uf617") : "",
    ord("\uf618") : "",
    ord("\uf619") : "",
    ord("\uf61a") : "",
    ord("\uf61b") : "",
    ord("\uf61c") : "",
    ord("\uf61d") : "",
    ord("\uf61e") : "",
    ord("\uf61f") : "",
    ord("\uf620") : "",
    ord("\uf621") : "",
    ord("\uf622") : "",
    ord("\uf623") : "",
    ord("\uf624") : "",
    ord("\uf625") : "",
    ord("\uf626") : "",
    ord("\uf627") : "",
    ord("\uf628") : "",
    ord("\uf629") : "",
    ord("\uf62a") : "",
    ord("\uf62b") : "",
    ord("\uf62c") : "",
    ord("\uf62d") : "",
    ord("\uf62e") : "",
    ord("\uf62f") : "",
    ord("\uf630") : "",
    ord("\uf631") : "",
    ord("\uf632") : "",
    ord("\uf633") : "",
    ord("\uf634") : "",
    ord("\uf635") : "",
    ord("\uf636") : "",
    ord("\uf637") : "",
    ord("\uf638") : "",
    ord("\uf639") : "",
    ord("\uf63a") : "",
    ord("\uf63b") : "",
    ord("\uf63c") : "",
    ord("\uf63d") : "",
    ord("\uf63e") : "",
    ord("\uf63f") : "",
    ord("\uf640") : "",
    ord("\uf641") : "",
    ord("\uf642") : "",
    ord("\uf643") : "",
    ord("\uf644") : "",
    ord("\uf645") : "",
    ord("\uf646") : "",
    ord("\uf647") : "",
    ord("\uf648") : "",
    ord("\uf649") : "",
    ord("\uf64a") : "",
    ord("\uf64b") : "",
    ord("\uf64c") : "",
    ord("\uf64d") : "",
    ord("\uf64e") : "",
    ord("\uf64f") : "",
    ord("\uf650") : "",
    ord("\uf651") : "",
    ord("\uf652") : "",
    ord("\uf653") : "",
    ord("\uf654") : "",
    ord("\uf655") : "",
    ord("\uf656") : "",
    ord("\uf657") : "",
    ord("\uf658") : "",
    ord("\uf659") : "",
    ord("\uf65a") : "",
    ord("\uf65b") : "",
    ord("\uf65c") : "",
    ord("\uf65d") : "",
    ord("\uf65e") : "",
    ord("\uf65f") : "",
    ord("\uf660") : "",
    ord("\uf661") : "",
    ord("\uf662") : "",
    ord("\uf663") : "",
    ord("\uf664") : "",
    ord("\uf665") : "",
    ord("\uf666") : "",
    ord("\uf667") : "",
    ord("\uf668") : "",
    ord("\uf669") : "",
    ord("\uf66a") : "",
    ord("\uf66b") : "",
    ord("\uf66c") : "",
    ord("\uf66d") : "",
    ord("\uf66e") : "",
    ord("\uf66f") : "",
    ord("\uf670") : "",
    ord("\uf671") : "",
    ord("\uf672") : "",
    ord("\uf673") : "",
    ord("\uf674") : "",
    ord("\uf675") : "",
    ord("\uf676") : "",
    ord("\uf677") : "",
    ord("\uf678") : "",
    ord("\uf679") : "",
    ord("\uf67a") : "",
    ord("\uf67b") : "",
    ord("\uf67c") : "",
    ord("\uf67d") : "",
    ord("\uf67e") : "",
    ord("\uf67f") : "",
    ord("\uf680") : "",
    ord("\uf681") : "",
    ord("\uf682") : "",
    ord("\uf683") : "",
    ord("\uf684") : "",
    ord("\uf685") : "",
    ord("\uf686") : "",
    ord("\uf687") : "",
    ord("\uf688") : "",
    ord("\uf689") : "",
    ord("\uf68a") : "",
    ord("\uf68b") : "",
    ord("\uf68c") : "",
    ord("\uf68d") : "",
    ord("\uf68e") : "",
    ord("\uf68f") : "",
    ord("\uf690") : "",
    ord("\uf691") : "",
    ord("\uf692") : "",
    ord("\uf693") : "",
    ord("\uf694") : "",
    ord("\uf695") : "",
    ord("\uf696") : "",
    ord("\uf697") : "",
    ord("\uf698") : "",
    ord("\uf699") : "",
    ord("\uf69a") : "",
    ord("\uf69b") : "",
    ord("\uf69c") : "",
    ord("\uf69d") : "",
    ord("\uf69e") : "",
    ord("\uf69f") : "",
    ord("\uf6a0") : "",
    ord("\uf6a1") : "",
    ord("\uf6a2") : "",
    ord("\uf6a3") : "",
    ord("\uf6a4") : "",
    ord("\uf6a5") : "",
    ord("\uf6a6") : "",
    ord("\uf6a7") : "",
    ord("\uf6a8") : "",
    ord("\uf6a9") : "",
    ord("\uf6aa") : "",
    ord("\uf6ab") : "",
    ord("\uf6ac") : "",
    ord("\uf6ad") : "",
    ord("\uf6ae") : "",
    ord("\uf6af") : "",
    ord("\uf6b0") : "",
    ord("\uf6b1") : "",
    ord("\uf6b2") : "",
    ord("\uf6b3") : "",
    ord("\uf6b4") : "",
    ord("\uf6b5") : "",
    ord("\uf6b6") : "",
    ord("\uf6b7") : "",
    ord("\uf6b8") : "",
    ord("\uf6b9") : "",
    ord("\uf6ba") : "",
    ord("\uf6bb") : "",
    ord("\uf6bc") : "",
    ord("\uf6bd") : "",
    ord("\uf6be") : "",
    ord("\uf6bf") : "",
    ord("\uf6c0") : "",
    ord("\uf6c1") : "",
    ord("\uf6c2") : "",
    ord("\uf6c3") : "",
    ord("\uf6c4") : "",
    ord("\uf6c5") : "",
    ord("\uf6c6") : "",
    ord("\uf6c7") : "",
    ord("\uf6c8") : "",
    ord("\uf6c9") : "",
    ord("\uf6ca") : "",
    ord("\uf6cb") : "",
    ord("\uf6cc") : "",
    ord("\uf6cd") : "",
    ord("\uf6ce") : "",
    ord("\uf6cf") : "",
    ord("\uf6d0") : "",
    ord("\uf6d1") : "",
    ord("\uf6d2") : "",
    ord("\uf6d3") : "",
    ord("\uf6d4") : "",
    ord("\uf6d5") : "",
    ord("\uf6d6") : "",
    ord("\uf6d7") : "",
    ord("\uf6d8") : "",
    ord("\uf6d9") : "",
    ord("\uf6da") : "",
    ord("\uf6db") : "",
    ord("\uf6dc") : "",
    ord("\uf6dd") : "",
    ord("\uf6de") : "",
    ord("\uf6df") : "",
    ord("\uf6e0") : "",
    ord("\uf6e1") : "",
    ord("\uf6e2") : "",
    ord("\uf6e3") : "",
    ord("\uf6e4") : "",
    ord("\uf6e5") : "",
    ord("\uf6e6") : "",
    ord("\uf6e7") : "",
    ord("\uf6e8") : "",
    ord("\uf6e9") : "",
    ord("\uf6ea") : "",
    ord("\uf6eb") : "",
    ord("\uf6ec") : "",
    ord("\uf6ed") : "",
    ord("\uf6ee") : "",
    ord("\uf6ef") : "",
    ord("\uf6f0") : "",
    ord("\uf6f1") : "",
    ord("\uf6f2") : "",
    ord("\uf6f3") : "",
    ord("\uf6f4") : "",
    ord("\uf6f5") : "",
    ord("\uf6f6") : "",
    ord("\uf6f7") : "",
    ord("\uf6f8") : "",
    ord("\uf6f9") : "",
    ord("\uf6fa") : "",
    ord("\uf6fb") : "",
    ord("\uf6fc") : "",
    ord("\uf6fd") : "",
    ord("\uf6fe") : "",
    ord("\uf6ff") : "",
    ord("\uf700") : "",
    ord("\uf701") : "",
    ord("\uf702") : "",
    ord("\uf703") : "",
    ord("\uf704") : "",
    ord("\uf705") : "",
    ord("\uf706") : "",
    ord("\uf707") : "",
    ord("\uf708") : "",
    ord("\uf709") : "",
    ord("\uf70a") : "",
    ord("\uf70b") : "",
    ord("\uf70c") : "",
    ord("\uf70d") : "",
    ord("\uf70e") : "",
    ord("\uf70f") : "",
    ord("\uf710") : "",
    ord("\uf711") : "",
    ord("\uf712") : "",
    ord("\uf713") : "",
    ord("\uf714") : "",
    ord("\uf715") : "",
    ord("\uf716") : "",
    ord("\uf717") : "",
    ord("\uf718") : "",
    ord("\uf719") : "",
    ord("\uf71a") : "",
    ord("\uf71b") : "",
    ord("\uf71c") : "",
    ord("\uf71d") : "",
    ord("\uf71e") : "",
    ord("\uf71f") : "",
    ord("\uf720") : "",
    ord("\uf721") : "",
    ord("\uf722") : "",
    ord("\uf723") : "",
    ord("\uf724") : "",
    ord("\uf725") : "",
    ord("\uf726") : "",
    ord("\uf727") : "",
    ord("\uf728") : "",
    ord("\uf729") : "",
    ord("\uf72a") : "",
    ord("\uf72b") : "",
    ord("\uf72c") : "",
    ord("\uf72d") : "",
    ord("\uf72e") : "",
    ord("\uf72f") : "",
    ord("\uf730") : "",
    ord("\uf731") : "",
    ord("\uf732") : "",
    ord("\uf733") : "",
    ord("\uf734") : "",
    ord("\uf735") : "",
    ord("\uf736") : "",
    ord("\uf737") : "",
    ord("\uf738") : "",
    ord("\uf739") : "",
    ord("\uf73a") : "",
    ord("\uf73b") : "",
    ord("\uf73c") : "",
    ord("\uf73d") : "",
    ord("\uf73e") : "",
    ord("\uf73f") : "",
    ord("\uf740") : "",
    ord("\uf741") : "",
    ord("\uf742") : "",
    ord("\uf743") : "",
    ord("\uf744") : "",
    ord("\uf745") : "",
    ord("\uf746") : "",
    ord("\uf747") : "",
    ord("\uf748") : "",
    ord("\uf749") : "",
    ord("\uf74a") : "",
    ord("\uf74b") : "",
    ord("\uf74c") : "",
    ord("\uf74d") : "",
    ord("\uf74e") : "",
    ord("\uf74f") : "",
    ord("\uf750") : "",
    ord("\uf751") : "",
    ord("\uf752") : "",
    ord("\uf753") : "",
    ord("\uf754") : "",
    ord("\uf755") : "",
    ord("\uf756") : "",
    ord("\uf757") : "",
    ord("\uf758") : "",
    ord("\uf759") : "",
    ord("\uf75a") : "",
    ord("\uf75b") : "",
    ord("\uf75c") : "",
    ord("\uf75d") : "",
    ord("\uf75e") : "",
    ord("\uf75f") : "",
    ord("\uf760") : "",
    ord("\uf761") : "",
    ord("\uf762") : "",
    ord("\uf763") : "",
    ord("\uf764") : "",
    ord("\uf765") : "",
    ord("\uf766") : "",
    ord("\uf767") : "",
    ord("\uf768") : "",
    ord("\uf769") : "",
    ord("\uf76a") : "",
    ord("\uf76b") : "",
    ord("\uf76c") : "",
    ord("\uf76d") : "",
    ord("\uf76e") : "",
    ord("\uf76f") : "",
    ord("\uf770") : "",
    ord("\uf771") : "",
    ord("\uf772") : "",
    ord("\uf773") : "",
    ord("\uf774") : "",
    ord("\uf775") : "",
    ord("\uf776") : "",
    ord("\uf777") : "",
    ord("\uf778") : "",
    ord("\uf779") : "",
    ord("\uf77a") : "",
    ord("\uf77b") : "",
    ord("\uf77c") : "",
    ord("\uf77d") : "",
    ord("\uf77e") : "",
    ord("\uf77f") : "",
    ord("\uf780") : "",
    ord("\uf781") : "",
    ord("\uf782") : "",
    ord("\uf783") : "",
    ord("\uf784") : "",
    ord("\uf785") : "",
    ord("\uf786") : "",
    ord("\uf787") : "",
    ord("\uf788") : "",
    ord("\uf789") : "",
    ord("\uf78a") : "",
    ord("\uf78b") : "",
    ord("\uf78c") : "",
    ord("\uf78d") : "",
    ord("\uf78e") : "",
    ord("\uf78f") : "",
    ord("\uf790") : "",
    ord("\uf791") : "",
    ord("\uf792") : "",
    ord("\uf793") : "",
    ord("\uf794") : "",
    ord("\uf795") : "",
    ord("\uf796") : "",
    ord("\uf797") : "",
    ord("\uf798") : "",
    ord("\uf799") : "",
    ord("\uf79a") : "",
    ord("\uf79b") : "",
    ord("\uf79c") : "",
    ord("\uf79d") : "",
    ord("\uf79e") : "",
    ord("\uf79f") : "",
    ord("\uf7a0") : "",
    ord("\uf7a1") : "",
    ord("\uf7a2") : "",
    ord("\uf7a3") : "",
    ord("\uf7a4") : "",
    ord("\uf7a5") : "",
    ord("\uf7a6") : "",
    ord("\uf7a7") : "",
    ord("\uf7a8") : "",
    ord("\uf7a9") : "",
    ord("\uf7aa") : "",
    ord("\uf7ab") : "",
    ord("\uf7ac") : "",
    ord("\uf7ad") : "",
    ord("\uf7ae") : "",
    ord("\uf7af") : "",
    ord("\uf7b0") : "",
    ord("\uf7b1") : "",
    ord("\uf7b2") : "",
    ord("\uf7b3") : "",
    ord("\uf7b4") : "",
    ord("\uf7b5") : "",
    ord("\uf7b6") : "",
    ord("\uf7b7") : "",
    ord("\uf7b8") : "",
    ord("\uf7b9") : "",
    ord("\uf7ba") : "",
    ord("\uf7bb") : "",
    ord("\uf7bc") : "",
    ord("\uf7bd") : "",
    ord("\uf7be") : "",
    ord("\uf7bf") : "",
    ord("\uf7c0") : "",
    ord("\uf7c1") : "",
    ord("\uf7c2") : "",
    ord("\uf7c3") : "",
    ord("\uf7c4") : "",
    ord("\uf7c5") : "",
    ord("\uf7c6") : "",
    ord("\uf7c7") : "",
    ord("\uf7c8") : "",
    ord("\uf7c9") : "",
    ord("\uf7ca") : "",
    ord("\uf7cb") : "",
    ord("\uf7cc") : "",
    ord("\uf7cd") : "",
    ord("\uf7ce") : "",
    ord("\uf7cf") : "",
    ord("\uf7d0") : "",
    ord("\uf7d1") : "",
    ord("\uf7d2") : "",
    ord("\uf7d3") : "",
    ord("\uf7d4") : "",
    ord("\uf7d5") : "",
    ord("\uf7d6") : "",
    ord("\uf7d7") : "",
    ord("\uf7d8") : "",
    ord("\uf7d9") : "",
    ord("\uf7da") : "",
    ord("\uf7db") : "",
    ord("\uf7dc") : "",
    ord("\uf7dd") : "",
    ord("\uf7de") : "",
    ord("\uf7df") : "",
    ord("\uf7e0") : "",
    ord("\uf7e1") : "",
    ord("\uf7e2") : "",
    ord("\uf7e3") : "",
    ord("\uf7e4") : "",
    ord("\uf7e5") : "",
    ord("\uf7e6") : "",
    ord("\uf7e7") : "",
    ord("\uf7e8") : "",
    ord("\uf7e9") : "",
    ord("\uf7ea") : "",
    ord("\uf7eb") : "",
    ord("\uf7ec") : "",
    ord("\uf7ed") : "",
    ord("\uf7ee") : "",
    ord("\uf7ef") : "",
    ord("\uf7f0") : "",
    ord("\uf7f1") : "",
    ord("\uf7f2") : "",
    ord("\uf7f3") : "",
    ord("\uf7f4") : "",
    ord("\uf7f5") : "",
    ord("\uf7f6") : "",
    ord("\uf7f7") : "",
    ord("\uf7f8") : "",
    ord("\uf7f9") : "",
    ord("\uf7fa") : "",
    ord("\uf7fb") : "",
    ord("\uf7fc") : "",
    ord("\uf7fd") : "",
    ord("\uf7fe") : "",
    ord("\uf7ff") : "",
    ord("\uf800") : "",
    ord("\uf801") : "",
    ord("\uf802") : "",
    ord("\uf803") : "",
    ord("\uf804") : "",
    ord("\uf805") : "",
    ord("\uf806") : "",
    ord("\uf807") : "",
    ord("\uf808") : "",
    ord("\uf809") : "",
    ord("\uf80a") : "",
    ord("\uf80b") : "",
    ord("\uf80c") : "",
    ord("\uf80d") : "",
    ord("\uf80e") : "",
    ord("\uf80f") : "",
    ord("\uf810") : "",
    ord("\uf811") : "",
    ord("\uf812") : "",
    ord("\uf813") : "",
    ord("\uf814") : "",
    ord("\uf815") : "",
    ord("\uf816") : "",
    ord("\uf817") : "",
    ord("\uf818") : "",
    ord("\uf819") : "",
    ord("\uf81a") : "",
    ord("\uf81b") : "",
    ord("\uf81c") : "",
    ord("\uf81d") : "",
    ord("\uf81e") : "",
    ord("\uf81f") : "",
    ord("\uf820") : "",
    ord("\uf821") : "",
    ord("\uf822") : "",
    ord("\uf823") : "",
    ord("\uf824") : "",
    ord("\uf825") : "",
    ord("\uf826") : "",
    ord("\uf827") : "",
    ord("\uf828") : "",
    ord("\uf829") : "",
    ord("\uf82a") : "",
    ord("\uf82b") : "",
    ord("\uf82c") : "",
    ord("\uf82d") : "",
    ord("\uf82e") : "",
    ord("\uf82f") : "",
    ord("\uf830") : "",
    ord("\uf831") : "",
    ord("\uf832") : "",
    ord("\uf833") : "",
    ord("\uf834") : "",
    ord("\uf835") : "",
    ord("\uf836") : "",
    ord("\uf837") : "",
    ord("\uf838") : "",
    ord("\uf839") : "",
    ord("\uf83a") : "",
    ord("\uf83b") : "",
    ord("\uf83c") : "",
    ord("\uf83d") : "",
    ord("\uf83e") : "",
    ord("\uf83f") : "",
    ord("\uf840") : "",
    ord("\uf841") : "",
    ord("\uf842") : "",
    ord("\uf843") : "",
    ord("\uf844") : "",
    ord("\uf845") : "",
    ord("\uf846") : "",
    ord("\uf847") : "",
    ord("\uf848") : "",
    ord("\uf849") : "",
    ord("\uf84a") : "",
    ord("\uf84b") : "",
    ord("\uf84c") : "",
    ord("\uf84d") : "",
    ord("\uf84e") : "",
    ord("\uf84f") : "",
    ord("\uf850") : "",
    ord("\uf851") : "",
    ord("\uf852") : "",
    ord("\uf853") : "",
    ord("\uf854") : "",
    ord("\uf855") : "",
    ord("\uf856") : "",
    ord("\uf857") : "",
    ord("\uf858") : "",
    ord("\uf859") : "",
    ord("\uf85a") : "",
    ord("\uf85b") : "",
    ord("\uf85c") : "",
    ord("\uf85d") : "",
    ord("\uf85e") : "",
    ord("\uf85f") : "",
    ord("\uf860") : "",
    ord("\uf861") : "",
    ord("\uf862") : "",
    ord("\uf863") : "",
    ord("\uf864") : "",
    ord("\uf865") : "",
    ord("\uf866") : "",
    ord("\uf867") : "",
    ord("\uf868") : "",
    ord("\uf869") : "",
    ord("\uf86a") : "",
    ord("\uf86b") : "",
    ord("\uf86c") : "",
    ord("\uf86d") : "",
    ord("\uf86e") : "",
    ord("\uf86f") : "",
    ord("\uf870") : "",
    ord("\uf871") : "",
    ord("\uf872") : "",
    ord("\uf873") : "",
    ord("\uf874") : "",
    ord("\uf875") : "",
    ord("\uf876") : "",
    ord("\uf877") : "",
    ord("\uf878") : "",
    ord("\uf879") : "",
    ord("\uf87a") : "",
    ord("\uf87b") : "",
    ord("\uf87c") : "",
    ord("\uf87d") : "",
    ord("\uf87e") : "",
    ord("\uf87f") : "",
    ord("\uf880") : "",
    ord("\uf881") : "",
    ord("\uf882") : "",
    ord("\uf883") : "",
    ord("\uf884") : "",
    ord("\uf885") : "",
    ord("\uf886") : "",
    ord("\uf887") : "",
    ord("\uf888") : "",
    ord("\uf889") : "",
    ord("\uf88a") : "",
    ord("\uf88b") : "",
    ord("\uf88c") : "",
    ord("\uf88d") : "",
    ord("\uf88e") : "",
    ord("\uf88f") : "",
    ord("\uf890") : "",
    ord("\uf891") : "",
    ord("\uf892") : "",
    ord("\uf893") : "",
    ord("\uf894") : "",
    ord("\uf895") : "",
    ord("\uf896") : "",
    ord("\uf897") : "",
    ord("\uf898") : "",
    ord("\uf899") : "",
    ord("\uf89a") : "",
    ord("\uf89b") : "",
    ord("\uf89c") : "",
    ord("\uf89d") : "",
    ord("\uf89e") : "",
    ord("\uf89f") : "",
    ord("\uf8a0") : "",
    ord("\uf8a1") : "",
    ord("\uf8a2") : "",
    ord("\uf8a3") : "",
    ord("\uf8a4") : "",
    ord("\uf8a5") : "",
    ord("\uf8a6") : "",
    ord("\uf8a7") : "",
    ord("\uf8a8") : "",
    ord("\uf8a9") : "",
    ord("\uf8aa") : "",
    ord("\uf8ab") : "",
    ord("\uf8ac") : "",
    ord("\uf8ad") : "",
    ord("\uf8ae") : "",
    ord("\uf8af") : "",
    ord("\uf8b0") : "",
    ord("\uf8b1") : "",
    ord("\uf8b2") : "",
    ord("\uf8b3") : "",
    ord("\uf8b4") : "",
    ord("\uf8b5") : "",
    ord("\uf8b6") : "",
    ord("\uf8b7") : "",
    ord("\uf8b8") : "",
    ord("\uf8b9") : "",
    ord("\uf8ba") : "",
    ord("\uf8bb") : "",
    ord("\uf8bc") : "",
    ord("\uf8bd") : "",
    ord("\uf8be") : "",
    ord("\uf8bf") : "",
    ord("\uf8c0") : "",
    ord("\uf8c1") : "",
    ord("\uf8c2") : "",
    ord("\uf8c3") : "",
    ord("\uf8c4") : "",
    ord("\uf8c5") : "",
    ord("\uf8c6") : "",
    ord("\uf8c7") : "",
    ord("\uf8c8") : "",
    ord("\uf8c9") : "",
    ord("\uf8ca") : "",
    ord("\uf8cb") : "",
    ord("\uf8cc") : "",
    ord("\uf8cd") : "",
    ord("\uf8ce") : "",
    ord("\uf8cf") : "",
    ord("\uf8d0") : "",
    ord("\uf8d1") : "",
    ord("\uf8d2") : "",
    ord("\uf8d3") : "",
    ord("\uf8d4") : "",
    ord("\uf8d5") : "",
    ord("\uf8d6") : "",
    ord("\uf8d7") : "",
    ord("\uf8d8") : "",
    ord("\uf8d9") : "",
    ord("\uf8da") : "",
    ord("\uf8db") : "",
    ord("\uf8dc") : "",
    ord("\uf8dd") : "",
    ord("\uf8de") : "",
    ord("\uf8df") : "",
    ord("\uf8e0") : "",
    ord("\uf8e1") : "",
    ord("\uf8e2") : "",
    ord("\uf8e3") : "",
    ord("\uf8e4") : "",
    ord("\uf8e5") : "",
    ord("\uf8e6") : "",
    ord("\uf8e7") : "",
    ord("\uf8e8") : "",
    ord("\uf8e9") : "",
    ord("\uf8ea") : "",
    ord("\uf8eb") : "",
    ord("\uf8ec") : "",
    ord("\uf8ed") : "",
    ord("\uf8ee") : "",
    ord("\uf8ef") : "",
    ord("\uf8f0") : "",
    ord("\uf8f1") : "",
    ord("\uf8f2") : "",
    ord("\uf8f3") : "",
    ord("\uf8f4") : "",
    ord("\uf8f5") : "",
    ord("\uf8f6") : "",
    ord("\uf8f7") : "",
    ord("\uf8f8") : "",
    ord("\uf8f9") : "",
    ord("\uf8fa") : "",
    ord("\uf8fb") : "",
    ord("\uf8fc") : "",
    ord("\uf8fd") : "",
    ord("\uf8fe") : "",
    ord("\uf8ff") : ""  
#    ord("\u9c47") : "", # 鱇
#    ord("\u71d7") : "", # 燗 same as 烂 according to http://xh.5156edu.com/
    
}

def translateChar(df):
    # Do character translation for all text columns
    #text_column = ["SponsorTextStuntEng", "SponsorTextStuntChi", "BrandNameEng", "BrandNameChi", "EditionVersionEng", "EditionVersionChi", "SeasonNameEng", "SeasonNameChi", "EpisodeNameEng", "EpisodeNameChi", "SynopsisEng", "SynopsisChi", "ShortSynopsisEng", "ShortSynopsisChi", "DirectorProducerEng", "DirectorProducerChi", "CastEng", "CastChi", "FullTitleEng", "FullTitleChi"]
    text_column = ["BrandNameEng", "BrandNameChi", "FullTitleEng", "FullTitleChi"]
    charTranslateTable_tmp = charTranslateTable.copy()
    charTranslateTable_tmp[ord("\"")] = "'"
    #for column in text_column:
    for column in internalHeader:
        if df[column].dtype == object:
            df[column] = df[column].astype(str).where(df[column].notnull()).str.translate(charTranslateTable_tmp)
            if column in text_column:
                df[column] = df[column].replace(" {4,}", "", regex=True)
    del charTranslateTable_tmp

ownerChannelMapping = {"ViuTVsix": "96",
                       "ViuTV": "99"}

audioLangMapping = {
    # English
    "english" : "English",
    "eng" : "English",
    "engl" : "English",
    "engish e" : "English",
    "w" : "English",
    "e" : "English",
    "英" : "English",
    "英語" : "English",
    "英文" : "English",
    "englishã" : "English",

    # Cantonese
    "cantonese" : "Cantonese",
    "canto" : "Cantonese",
    "cantoese" : "Cantonese",
    "cant" : "Cantonese",
    "can" : "Cantonese",
    "chinese" : "Cantonese",
    "chn" : "Cantonese",
    "c" : "Cantonese",
    "粵語" : "Cantonese",
    "廣東話" : "Cantonese",
    "中" : "Cantonese",
    "中文" : "Cantonese",
    "粵" : "Cantonese",
    "cantonee" : "Cantonese",

    # Japanese
    "japanese" : "Japanese",
    "jap" : "Japanese",
    "日語" : "Japanese",
    "jpn" : "Japanese",
    "janpanese" : "Japanese",

    # Mandarin
    "mandarin" : "Mandarin",
    "m" : "Mandarin",
    "man" : "Mandarin",
    "mand" : "Mandarin",
    "mandrain" : "Mandarin",
    "國語" : "Mandarin",
    "普通話" : "Mandarin",
    "國" : "Mandarin",
    "普" : "Mandarin",
    "chi" : "Mandarin",
    "chinese traditional (taiwan)":"Mandarin",
    "madarin" : "Mandarin",
    "taiwanese" : "Mandarin",
    "mandarinã" : "Mandarin",
    
    # Korean
    "korean" : "Korean",
    "kor" : "Korean",
    "韓語" : "Korean",
    "韓文" : "Korean",

    # French
    "french" : "French",
    "法語" : "French",
    "法" : "French",

    # Swedish
    "swedish" : "Swedish",
    "sweden" : "Swedish",
    "瑞典語" : "Swedish",

    # Hindi
    "hindi" : "Hindi",
    "印度" : "Hindi",
    "hin" : "Hindi",
    "ind" : "Hindi",

    # Norwegian
    "norwegian" : "Norwegian",
    "挪威語" : "Norwegian",

    # Thai
    "thai" : "Thai",
    "tha" : "Thai",
    "泰語" : "Thai",
    "泰" : "Thai",
    "thi" : "Thai",

    # Spanish
    "spanish" : "Spanish",
    "西班牙語" : "Spanish",

    # German
    "german" : "German",
    "德語" : "German",

    # Hebrew
    "hebrew" : "Hebrew",
    "希伯來" : "Hebrew",

    # Danish
    "danish" : "Danish",
    "丹麥語" : "Danish",

    # Italian
    "italian" : "Italian",
    "意大利語" : "Italian",

    # Dutch
    "dutch" : "Dutch",
    "荷蘭語" : "Dutch",
    "dut" : "Dutch",

    # Turkish
    "turkish" : "Turkish",
    "turish" : "Turkish",
    "土耳其" : "Turkish",

    # Bahasa Indonesia
    "indonesian" : "Bahasa Indonesia",
    "印尼" : "Bahasa Indonesia",
    "bin" : "Bahasa Indonesia",
    "bi" : "Bahasa Indonesia",

    # Afrikaans
    "afrikaans" : "Afrikaans",
    "南非" : "Afrikaans",

    # Czech
    "czech" : "Czech",
    "捷克" : "Czech",

    # Romanian
    "romanian" : "Romanian",
    "羅馬尼亞" : "Romanian",

    # Persian
    "persian" : "Persian",
    "波斯語" : "Persian",

    # Portuguese
    "portuguese" : "Portuguese",
    "葡萄牙語" : "Portuguese",
    "por" : "Portuguese",

    # Kazakh
    "kazakh" : "Kazakh",
    "哈薩克" : "Kazakh",

    # Polish
    "polish" : "Polish",
    "波蘭" : "Polish",

    # Bahasa Malaysia
    "malaysian" : "Bahasa Malaysia",
    "malay" : "Bahasa Malaysia",
    "馬來語" : "Bahasa Malaysia",

    # Tagalog
    "tagalog" : "Tagalog",
    "菲律賓語" : "Tagalog",
    "tag" : "Tagalog",
    "filipino" : "Tagalog",

    # Mongolian
    "mongolian" : "Mongolian",
    "蒙古語" : "Mongolian",

    # Vietnamese
    "vietnamese" : "Vietnamese",
    "越南語" : "Vietnamese",
    "viet" : "Vietnamese",

    # Nepali
    "nepali" : "Nepali",
    "尼泊爾語" : "Nepali",

    # Cambodian
    "cambodian" : "Cambodian",
    "khmer" : "Cambodian",
    "柬埔寨語" : "Cambodian",
    "高棉語" : "Cambodian",
    "cam" : "Cambodian",

    # Hungarian
    "hungarian" : "Hungarian",
    "hungary" : "Hungarian",
    "匈牙利語" : "Hungarian",
    "匈牙利" : "Hungarian",

    # Finnish
    "finnish" : "Finnish",
    "finland" : "Finnish",
    "芬蘭語" : "Finnish",
    "芬蘭" : "Finnish",

    # Russian
    "russian" : "Russian",
    "russia" : "Russian",
    "俄語" : "Russian",
    "俄羅斯" : "Russian",
    "俄文" : "Russian",

    # Serbian
    "serbian" : "Serbian",
    "serbia" : "Serbian",
    "塞爾維亞語" : "Serbian",
    "塞爾維亞" : "Serbian",

    # N/A
    "no" : "N/A",
    "no dialogue" : "N/A",
    "und" : "N/A",
    "n/a" : "N/A",
    "na" : "N/A",
    "no" : "N/A",
    "nil" : "N/A",
    "--" : "N/A",

    # Arabic
    "arabic" : "Arabic",

    # Kikuyu
    "kikuyu" : "Kikuyu",
    "gikuyu" : "Kikuyu",

    # Greek
    "greek" : "Greek",

    # Hakka
    "hakka" : "Hakka",

    # Icelandic
    "icelandic" : "Icelandic",

    # Kurdish
    "kurdish" : "Kurdish",

    # Tamil
    "tamil" : "Tamil",
    "tam" : "Tamil",

    # Pashto
    "pashto" : "Pashto",
    "pashtu" : "Pashto",
    
    #Marathi
    "Marathi":"Marathi",

}


genreMapping = {
    "movies" : "Movies",
    "movie" : "Movies",
    "film" : "Movies",
    "films" : "Movies",
    "cinema" : "Movies",
    "theatre" : "Movies",
    "movie series" : "Movies",
    "movies series" : "Movies",
    "tv movie" : "Movies",
    "tv movies" : "Movies",
    "drama series" : "TV Series",
    "drama" : "TV Series",
    "tv series" : "TV Series",
    "drame series" : "TV Series",
    "reality drama series" : "TV Series",
    "scripted series" : "TV Series",
    "social drama" : "TV Series",
    "entertainment" : "Entertainment",
    "variety" : "Entertainment",
    "enterainment" : "Entertainment",
    "factual entertainment" : "Entertainment",
    "show" : "Entertainment",
    "entertain" : "Entertainment",
    "sport" : "Sports",
    "sports" : "Sports",
    "sports news" : "Sports",
    "kids" : "Kids",
    "children's program" : "Kids",
    "childrens program" : "Kids",
    "children" : "Kids",
    "youth program" : "Kids",
    "knowledge" : "Knowledge",
    "infotainment" : "Knowledge",
    "infortainment" : "Knowledge",
    "documentary" : "Knowledge",
    "news" : "News",
    "news/finance" : "News",
    "news & finance" : "News",
    "news/ finance" : "News",
    "business" : "News",
    "news magazine" : "News",
    "weather" : "News",
    "current affairs" : "News",
    "finance" : "News",
    "newscast" : "News",
    "public affairs" : "News",
    "adult" : "Adult",
    "adults" : "Adult",
    "av" : "Adult",
}

inputHeaderMapping = OrderedDict([
("Channel Code", "ownerChannel"),
("Planning Date", "txDate"), 
("Planner Date", "txDate1"), 
("Planner Time", "actualTime1"), 
("Programme Sponsorship Title", "sponsorTextStuntEng"), 
("Programme Sponsorship Alt Title", "sponsorTextStuntChi"), 
("Sponsorship Start Date", "sponsorshipStartDate"), 
("Sponsorship End Date", "sponsorshipEndDate"),
("Programme Title", "programmeTitle"),
("Programme Alt Title", "programmeAltTitle"),
("Series No", "seasonNo"),
("Episode#", "episodeNo"),
("Episode Title", "episodeNameEng"),
("EPISODEALTTITLE", "episodeNameChi"),
("Classification", "classification"),
("Programme Mini Synopsis", "synopsisChi1"),
("Episode Mini Synopsis", "synopsisChi"),
("GENRE", "genre"),
("SUBGENRE", "subGenre"),
("Planning Repeat", "planningRepeat"),
("PLANNINPREMIER", "premier"), 
("SOURCEDESCRIPTION", "sourceDescription"),
("PLANNINGSCHEDULEREMARK", "planningSchedulereMark"),
("Media No", "mediaID"), 
("Brand_Name_English", "brandNameEng"),
("Brand_Name_Chinese", "brandNameChi"), 
("Season_Name_English", "seasonNameEng"),
("Season_Name_Chinese", "seasonNameChi"),
("Edition_Version_English", "editionVersionEng"),
("Edition_Version_Chinese", "editionVersionChi"),
("Portrait_Image", "portraitImage"),
("VOD", "isVOD"),
("NPVR", "isNPVRProg"), 
("Episodic(Y/N)", "isEpisodic"),
("PLANNINGID", "cpInternalUniqueID"), 
("Media Duration", "mediaDuration"),
("Original Language", "originalLang"),
("Billingual", "bilingual"), 
("Subtitle", "subTitle"),
("Live Event", "isLive"),
("Clean Version ID", "hktamChannelId"),
("Clear Version Prog Title", "clearVersionProgTitle"),
("Programme ID", "hktamProgramId"),
("Episode ID", "hktamEpisodeId"),
("Unnamed: 44", "unnamed44"),
("Unnamed: 45", "unnamed45")
])

internalHeader = [
"PID",
"ChannelNo", 
"TXDate", 
"ActualTime", 
"FullTitleEng", 
"FullTitleChi", 
"SponsorTextStuntEng", 
"SponsorTextStuntChi",
"BrandNameEng",
"BrandNameChi",
"EditionVersionEng",
"EditionVersionChi",
"SeasonNo",
"SeasonNameEng",
"SeasonNameChi",
"EpisodeNo",
"EpisodeNameEng",
"EpisodeNameChi",
"SynopsisEng",
"SynopsisChi",
"ShortSynopsisEng", 
"ShortSynopsisChi",
"Premiere",
"IsLive", 
"Classification",
"Genre", 
"SubGenre",
"DirectorProducerEng",
"DirectorProducerChi",
"CastEng",
"CastChi",
"OriginalLang",
"Bilingual", 
"AudioLang",
"SubtitleLang", 
"RegionCode",
"FirstReleaseYear",
"IsEpisodic", 
"IsVOD",
"ImageWithTitle",
"PortraitImage",
"RecordableForCatchUp",
"CPInternalUniqueID",
"CPInternalSeriesID",
"Recordable",
"IsNPVRProg",
"IsRestartTV",
"EffectiveDate",
"ExpirationDate",
"MediaID",
"CID",
"SID",
"CreatedBy",
"Premier",
"HKTAMChannelID",
"HKTAMProgramID",
"HKTAMEpisodeID",
]

pwhHeaderMapping = OrderedDict([
("PID", "progId"),
("ChannelNo", "channelId"), 
("TXDate", "txDate"), 
("ActualTime", "actualTime"), 
("FullTitleEng", "engName"), 
("FullTitleChi", "chiName"), 
("SponsorTextStuntEng", "engSponsor"), 
("SponsorTextStuntChi", "chiSponsor"),
("BrandNameEng", "engSeries"),
("BrandNameChi", "chiSeries"),
("EditionVersionEng", "engVersion"),
("EditionVersionChi", "chiVersion"),
("SeasonNo", "seasonNum"),
("SeasonNameEng", "engSeasonName"),
("SeasonNameChi", "chiSeasonName"),
("EpisodeNo", "episodeNum"),
("EpisodeNameEng", "engEpisodeName"),
("EpisodeNameChi", "chiEpisodeName"),
("SynopsisEng", "engSynopsis"),
("SynopsisChi", "chiSynopsis"),
("ShortSynopsisEng", "engShortSynopsis"), 
("ShortSynopsisChi", "chiShortSynopsis"),
("Premiere", "premiere"),
("IsLive", "isLive"), 
("Classification", "classification"),
("Genre", "genre"), 
("SubGenre", "subGenre"),
("DirectorProducerEng", "engDirector"),
("DirectorProducerChi", "chiDirector"),
("CastEng", "engActor"),
("CastChi", "chiActor"),
("OriginalLang", "originalLanguage"),
("Bilingual", "bilingual"), 
("AudioLang", "audioLanguage"),
("SubtitleLang", "subtitleLanguage"), 
("RegionCode", "regionCode"),
("FirstReleaseYear", "firstReleaseYear"),
("IsEpisodic", "episodic"), 
("IsVOD", "isVod"),
("ImageWithTitle", "withImageTitle"),
("PortraitImage", "oriPortraitImage"),
("RecordableForCatchUp", "catchUpRecordable"),
("CPInternalUniqueID", "cpInternalId"),
("CPInternalSeriesID", "cpInternalSeriesId"),
("Recordable", "recordable"),
("IsNPVRProg", "isNpvrProg"),
("IsRestartTV", "isRestartTv"),
("EffectiveDate", "effectiveDay"),
("ExpirationDate", "expirationDay"),
("MediaID", "mediaId"),
("CID", "cid"), 
("SID", "sid"), 
("CreatedBy", "createdBy"),
("Premier", "premier"),
("HKTAMChannelID", "hktamChannelId"),
("HKTAMProgramID", "hktamProgramId"),
("HKTAMEpisodeID", "hktamEpisodeId")
])

injestHeader = [
"progId",
"channelId",
"txDate",
"actualTime",
"engName",
"chiName",
"engSponsor",
"chiSponsor",
"engSeries",
"chiSeries",
"engVersion",
"chiVersion",
"seasonNum",
"engSeasonName",
"chiSeasonName",
"episodeNum",
"engEpisodeName",
"chiEpisodeName",
"engSynopsis",
"chiSynopsis",
"engShortSynopsis",
"chiShortSynopsis",
"isLive",
"classification",
"genre",
"subGenre",
"engDirector",
"chiDirector",
"engActor",
"chiActor",
"originalLanguage",
"bilingual",
"audioLanguage",
"subtitleLanguage",
"regionCode",
"firstReleaseYear",
"episodic",
"isVod",
"withImageTitle",
"oriPortraitImage",
"catchUpRecordable",
"cpInternalId",
"cpInternalSeriesId",
"recordable",
"isNpvrProg",
"isRestartTv",
"effectiveDay",
"expirationDay",
"mediaId",
"hktamChannelId",
"hktamProgramId",
"hktamEpisodeId",
"createdBy",
"modifiedBy"
]


char_limit = {
    "BrandNameEng" : 200,
    "BrandNameChi" : 200,
    "SeasonNameEng" : 50,
    "SeasonNameChi" : 50,
    "EpisodeNameEng" : 75,
    "EpisodeNameChi" : 75,
    "SynopsisEng" : 990,
    "SynopsisChi" : 990,
    "ShortSynopsisEng" : 120,
    "ShortSynopsisChi" : 120,
    "SubGenre" : 100,
    "DirectorProducerEng" : 255,
    "DirectorProducerChi" : 255,
    "CastEng" : 255,
    "CastChi" : 255
}

def constructFullTitle(record):
    "This constructs English and Chinese Full Title"
    
    # English Full Title
    fte = ""
    
    if (notnull(record["SponsorTextStuntEng"]) and len(str(record["SponsorTextStuntEng"]).strip()) > 0):
        fte += str(record["SponsorTextStuntEng"]) + ": "

    if (notnull(record["BrandNameEng"]) and len(str(record["BrandNameEng"]).strip()) > 0) > 0 :
        fte += str(record["BrandNameEng"])
    
    if (notnull(record["EditionVersionEng"]) and len(str(record["EditionVersionEng"]).strip()) > 0) :
        fte += " " + "(" + str(record["EditionVersionEng"]) + ")"
        
    if (notnull(record["SeasonNameEng"]) and len(str(record["SeasonNameEng"]).strip()) > 0) :
        fte += ":" + str(record["SeasonNameEng"])
        
    if ((notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="" and str(record["SeasonNo"]).replace(".0","") !="0") or (notnull(record["EpisodeNo"]) and str(record["EpisodeNo"]).strip()!="" and str(record["EpisodeNo"]).replace(".0","") !="0")):
        fte += " "
        if (notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="" and str(record["SeasonNo"]).replace(".0","") !="0"):
            fte += "S" + str(record["SeasonNo"]).replace(".0","")
        
        if notnull(record["EpisodeNo"]) and str(record["EpisodeNo"]).strip()!="" and str(record["EpisodeNo"]).replace(".0","") !="0":
            fte += "E" + str(record["EpisodeNo"]).replace(".0","")
    
    if (notnull(record["EpisodeNameEng"]) and len(str(record["EpisodeNameEng"]).strip()) > 0) :
        fte += " -" + str(record["EpisodeNameEng"])
    
    if (notnull(record["IsLive"]) and (record["IsLive"] == "Y")):
        fte += " [Live]"
    
    # Chinese Full Title
    ftc = ""
    
    if (notnull(record["SponsorTextStuntChi"]) and len(str(record["SponsorTextStuntChi"]).strip()) > 0) :
        ftc += str(record["SponsorTextStuntChi"]) + ": "
    
    if (notnull(record["BrandNameChi"]) and len(str(record["BrandNameChi"]).strip()) > 0):
        ftc += str(record["BrandNameChi"])
    
    if (notnull(record["EditionVersionChi"]) and len(str(record["EditionVersionChi"]).strip()) > 0) :
        ftc += " " + "(" + str(record["EditionVersionChi"]) + ")"
        
    if (notnull(record["SeasonNameChi"]) and len(str(record["SeasonNameChi"]).strip()) > 0) :
        ftc += ":" + str(record["SeasonNameChi"])
        
    if ((notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="" and str(record["SeasonNo"]).replace(".0","") !="0") or (notnull(record["EpisodeNo"]) and str(record["EpisodeNo"]).strip()!="" and str(record["EpisodeNo"]).replace(".0","") !="0")):
        ftc += " "
        if (notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="" and str(record["SeasonNo"]).replace(".0","") !="0"):
            ftc += "第" + str(record["SeasonNo"]).replace(".0","") + "季"

        if notnull(record["EpisodeNo"]) and str(record["EpisodeNo"]).strip()!="" and str(record["EpisodeNo"]).replace(".0","") !="0":
            ftc += "第" + str(record["EpisodeNo"]).replace(".0","") + "集"
    
    if (notnull(record["EpisodeNameChi"]) and len(str(record["EpisodeNameChi"]).strip()) > 0) :
        ftc += " -" + str(record["EpisodeNameChi"])
    
    if (notnull(record["IsLive"]) and (record["IsLive"] == "Y")):
        ftc += " [直播]"
    
    return Series([fte, ftc])

def constructProgrammeName(record):
    "This constructs English and Chinese Programme Name"
    
    # English Programme Name
    pne = ""
    
    if notnull(record["BrandNameEng"]):
        pne += str(record["BrandNameEng"])
    
    if notnull(record["EditionVersionEng"]):
        pne += " " + "(" + str(record["EditionVersionEng"]) + ")"
        
    if notnull(record["SeasonNameEng"]):
        pne += ":" + str(record["SeasonNameEng"])
        
    if (notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="") and str(record["SeasonNo"]).replace(".0","") !="0":
        pne += " " + "S" + str(record["SeasonNo"]).replace(".0","")
    
    # Chinese Programme Name
    pnc = ""
    
    if notnull(record["BrandNameChi"]):
        pnc += str(record["BrandNameChi"])
    
    if notnull(record["EditionVersionChi"]):
        pnc += " " + "(" + str(record["EditionVersionChi"]) + ")"
        
    if notnull(record["SeasonNameChi"]):
        pnc += ":" + str(record["SeasonNameChi"])
        
    if (notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="") and str(record["SeasonNo"]).replace(".0","") !="0":
        pnc += " " + "S" + str(record["SeasonNo"]).replace(".0","")
    
    return Series([pne, pnc])

def chopCharacters(df):
    "Enforce character limits for each field"
    
    for column_name, char_limit1 in char_limit.items():
        temp_col = df[column_name][df[column_name].notnull()]
        if not temp_col.empty:
            if column_name == "ShortSynopsisEng" or column_name == "ShortSynopsisChi":
                df[column_name] = df[column_name].apply(lambda x: str(x)[0:char_limit1-3]+"..." if len(str(x)) > char_limit1 else x) 
            else:
                df[column_name] = df[column_name][df[column_name].notnull()].str.slice(0, char_limit1)

# Simplified Chinese to Traditional Chinese
sc_char = u"\u9515\u7691\u853c\u788d\u7231\u55f3\u5ad2\u7477\u66a7\u972d\u8c19\u94f5\u9e4c\u80ae\u8884\u5965\u5aaa\u9a9c\u9ccc\u575d\u7f62\u94af\u6446\u8d25\u5457\u9881\u529e\u7eca\u94a3\u5e2e\u7ed1\u9551\u8c24\u5265\u9971\u5b9d\u62a5\u9c8d\u9e28\u9f85\u8f88\u8d1d\u94a1\u72c8\u5907\u60eb\u9e4e\u8d32\u951b\u7ef7\u7b14\u6bd5\u6bd9\u5e01\u95ed\u835c\u54d4\u6ed7\u94cb\u7b5a\u8df8\u8fb9\u7f16\u8d2c\u53d8\u8fa9\u8fab\u82c4\u7f0f\u7b3e\u6807\u9aa0\u98d1\u98d9\u9556\u9573\u9cd4\u9cd6\u522b\u762a\u6fd2\u6ee8\u5bbe\u6448\u50a7\u7f24\u69df\u6ba1\u8191\u9554\u9acc\u9b13\u997c\u7980\u62e8\u94b5\u94c2\u9a73\u997d\u94b9\u9e41\u8865\u94b8\u8d22\u53c2\u8695\u6b8b\u60ed\u60e8\u707f\u9a96\u9eea\u82cd\u8231\u4ed3\u6ca7\u5395\u4fa7\u518c\u6d4b\u607b\u5c42\u8be7\u9538\u4faa\u9497\u6400\u63ba\u8749\u998b\u8c17\u7f20\u94f2\u4ea7\u9610\u98a4\u5181\u8c04\u8c36\u8487\u5fcf\u5a75\u9aa3\u89c7\u7985\u9561\u573a\u5c1d\u957f\u507f\u80a0\u5382\u7545\u4f25\u82cc\u6005\u960a\u9cb3\u949e\u8f66\u5f7b\u7817\u5c18\u9648\u886c\u4f27\u8c0c\u6987\u789c\u9f80\u6491\u79f0\u60e9\u8bda\u9a8b\u67a8\u67fd\u94d6\u94db\u75f4\u8fdf\u9a70\u803b\u9f7f\u70bd\u996c\u9e31\u51b2\u51b2\u866b\u5ba0\u94f3\u7574\u8e0c\u7b79\u7ef8\u4fe6\u5e31\u96e0\u6a71\u53a8\u9504\u96cf\u7840\u50a8\u89e6\u5904\u520d\u7ecc\u8e70\u4f20\u948f\u75ae\u95ef\u521b\u6006\u9524\u7f0d\u7eaf\u9e51\u7ef0\u8f8d\u9f8a\u8f9e\u8bcd\u8d50\u9e5a\u806a\u8471\u56f1\u4ece\u4e1b\u82c1\u9aa2\u679e\u51d1\u8f8f\u8e7f\u7a9c\u64ba\u9519\u9509\u9e7e\u8fbe\u54d2\u9791\u5e26\u8d37\u9a80\u7ed0\u62c5\u5355\u90f8\u63b8\u80c6\u60ee\u8bde\u5f39\u6b9a\u8d55\u7605\u7baa\u5f53\u6321\u515a\u8361\u6863\u8c20\u7800\u88c6\u6363\u5c9b\u7977\u5bfc\u76d7\u7118\u706f\u9093\u956b\u654c\u6da4\u9012\u7f14\u7c74\u8bcb\u8c1b\u7ee8\u89cc\u955d\u98a0\u70b9\u57ab\u7535\u5dc5\u94bf\u766b\u9493\u8c03\u94eb\u9cb7\u8c0d\u53e0\u9cbd\u9489\u9876\u952d\u8ba2\u94e4\u4e22\u94e5\u4e1c\u52a8\u680b\u51bb\u5cbd\u9e2b\u7aa6\u728a\u72ec\u8bfb\u8d4c\u9540\u6e0e\u691f\u724d\u7b03\u9ee9\u953b\u65ad\u7f0e\u7c16\u5151\u961f\u5bf9\u603c\u9566\u5428\u987f\u949d\u7096\u8db8\u593a\u5815\u94ce\u9e45\u989d\u8bb9\u6076\u997f\u8c14\u57a9\u960f\u8f6d\u9507\u9537\u9e57\u989a\u989b\u9cc4\u8bf6\u513f\u5c14\u9975\u8d30\u8fe9\u94d2\u9e38\u9c95\u53d1\u7f5a\u9600\u73d0\u77fe\u9492\u70e6\u8d29\u996d\u8bbf\u7eba\u94ab\u9c82\u98de\u8bfd\u5e9f\u8d39\u7eef\u9544\u9cb1\u7eb7\u575f\u594b\u6124\u7caa\u507e\u4e30\u67ab\u950b\u98ce\u75af\u51af\u7f1d\u8bbd\u51e4\u6ca3\u80a4\u8f90\u629a\u8f85\u8d4b\u590d\u8d1f\u8ba3\u5987\u7f1a\u51eb\u9a78\u7ec2\u7ecb\u8d59\u9eb8\u9c8b\u9cc6\u9486\u8be5\u9499\u76d6\u8d45\u6746\u8d76\u79c6\u8d63\u5c34\u64c0\u7ec0\u5188\u521a\u94a2\u7eb2\u5c97\u6206\u9550\u777e\u8bf0\u7f1f\u9506\u6401\u9e3d\u9601\u94ec\u4e2a\u7ea5\u9549\u988d\u7ed9\u4e98\u8d53\u7ee0\u9ca0\u9f9a\u5bab\u5de9\u8d21\u94a9\u6c9f\u82df\u6784\u8d2d\u591f\u8bdf\u7f11\u89cf\u86ca\u987e\u8bc2\u6bc2\u94b4\u9522\u9e2a\u9e44\u9e58\u5250\u6302\u9e39\u63b4\u5173\u89c2\u9986\u60ef\u8d2f\u8bd6\u63bc\u9e73\u9ccf\u5e7f\u72b7\u89c4\u5f52\u9f9f\u95fa\u8f68\u8be1\u8d35\u523d\u5326\u523f\u59ab\u6867\u9c91\u9cdc\u8f8a\u6eda\u886e\u7ef2\u9ca7\u9505\u56fd\u8fc7\u57da\u5459\u5e3c\u6901\u8748\u94ea\u9a87\u97e9\u6c49\u961a\u7ed7\u9889\u53f7\u704f\u98a2\u9602\u9e64\u8d3a\u8bc3\u9616\u86ce\u6a2a\u8f70\u9e3f\u7ea2\u9ec9\u8ba7\u836d\u95f3\u9c8e\u58f6\u62a4\u6caa\u6237\u6d52\u9e55\u54d7\u534e\u753b\u5212\u8bdd\u9a85\u6866\u94e7\u6000\u574f\u6b22\u73af\u8fd8\u7f13\u6362\u5524\u75ea\u7115\u6da3\u5942\u7f33\u953e\u9ca9\u9ec4\u8c0e\u9cc7\u6325\u8f89\u6bc1\u8d3f\u79fd\u4f1a\u70e9\u6c47\u8bb3\u8bf2\u7ed8\u8bd9\u835f\u54d5\u6d4d\u7f0b\u73f2\u6656\u8364\u6d51\u8be8\u9984\u960d\u83b7\u8d27\u7978\u94ac\u956c\u51fb\u673a\u79ef\u9965\u8ff9\u8ba5\u9e21\u7ee9\u7f09\u6781\u8f91\u7ea7\u6324\u51e0\u84df\u5242\u6d4e\u8ba1\u8bb0\u9645\u7ee7\u7eaa\u8ba6\u8bd8\u8360\u53fd\u54dc\u9aa5\u7391\u89ca\u9f51\u77f6\u7f81\u867f\u8dfb\u9701\u9c9a\u9cab\u5939\u835a\u988a\u8d3e\u94be\u4ef7\u9a7e\u90cf\u6d43\u94d7\u9553\u86f2\u6b7c\u76d1\u575a\u7b3a\u95f4\u8270\u7f04\u8327\u68c0\u78b1\u7877\u62e3\u6361\u7b80\u4fed\u51cf\u8350\u69db\u9274\u8df5\u8d31\u89c1\u952e\u8230\u5251\u996f\u6e10\u6e85\u6da7\u8c0f\u7f23\u620b\u622c\u7751\u9e63\u7b15\u9ca3\u97af\u5c06\u6d46\u848b\u6868\u5956\u8bb2\u9171\u7edb\u7f30\u80f6\u6d47\u9a84\u5a07\u6405\u94f0\u77eb\u4fa5\u811a\u997a\u7f34\u7ede\u8f7f\u8f83\u6322\u5ce4\u9e6a\u9c9b\u9636\u8282\u6d01\u7ed3\u8beb\u5c4a\u7596\u988c\u9c92\u7d27\u9526\u4ec5\u8c28\u8fdb\u664b\u70ec\u5c3d\u52b2\u8346\u830e\u537a\u8369\u9991\u7f19\u8d46\u89d0\u9cb8\u60ca\u7ecf\u9888\u9759\u955c\u5f84\u75c9\u7ade\u51c0\u522d\u6cfe\u8ff3\u5f2a\u80eb\u9753\u7ea0\u53a9\u65e7\u9604\u9e20\u9e6b\u9a79\u4e3e\u636e\u952f\u60e7\u5267\u8bb5\u5c66\u6989\u98d3\u949c\u9514\u7aad\u9f83\u9e43\u7ee2\u9529\u954c\u96bd\u89c9\u51b3\u7edd\u8c32\u73cf\u94a7\u519b\u9a8f\u76b2\u5f00\u51ef\u5240\u57b2\u5ffe\u607a\u94e0\u9534\u9f9b\u95f6\u94aa\u94d0\u9897\u58f3\u8bfe\u9a92\u7f02\u8f72\u94b6\u951e\u9894\u57a6\u6073\u9f88\u94ff\u62a0\u5e93\u88e4\u55be\u5757\u4fa9\u90d0\u54d9\u810d\u5bbd\u72ef\u9acb\u77ff\u65f7\u51b5\u8bd3\u8bf3\u909d\u5739\u7ea9\u8d36\u4e8f\u5cbf\u7aa5\u9988\u6e83\u532e\u8489\u6126\u8069\u7bd1\u9603\u951f\u9cb2\u6269\u9614\u86f4\u8721\u814a\u83b1\u6765\u8d56\u5d03\u5f95\u6d9e\u6fd1\u8d49\u7750\u94fc\u765e\u7c41\u84dd\u680f\u62e6\u7bee\u9611\u5170\u6f9c\u8c30\u63fd\u89c8\u61d2\u7f06\u70c2\u6ee5\u5c9a\u6984\u6593\u9567\u8934\u7405\u9606\u9512\u635e\u52b3\u6d9d\u5520\u5d02\u94d1\u94f9\u75e8\u4e50\u9cd3\u956d\u5792\u7c7b\u6cea\u8bd4\u7f27\u7bf1\u72f8\u79bb\u9ca4\u793c\u4e3d\u5389\u52b1\u783e\u5386\u6ca5\u96b6\u4fea\u90e6\u575c\u82c8\u8385\u84e0\u5456\u9026\u9a8a\u7f21\u67a5\u680e\u8f79\u783a\u9502\u9e42\u75a0\u7c9d\u8dde\u96f3\u9ca1\u9ce2\u4fe9\u8054\u83b2\u8fde\u9570\u601c\u6d9f\u5e18\u655b\u8138\u94fe\u604b\u70bc\u7ec3\u8539\u5941\u6f4b\u740f\u6b93\u88e2\u88e3\u9ca2\u7cae\u51c9\u4e24\u8f86\u8c05\u9b49\u7597\u8fbd\u9563\u7f2d\u948c\u9e69\u730e\u4e34\u90bb\u9cde\u51db\u8d41\u853a\u5eea\u6aa9\u8f9a\u8e8f\u9f84\u94c3\u7075\u5cad\u9886\u7eeb\u68c2\u86cf\u9cae\u998f\u5218\u6d4f\u9a9d\u7efa\u954f\u9e68\u9f99\u804b\u5499\u7b3c\u5784\u62e2\u9647\u830f\u6cf7\u73d1\u680a\u80e7\u783b\u697c\u5a04\u6402\u7bd3\u507b\u848c\u55bd\u5d5d\u9542\u7618\u8027\u877c\u9ac5\u82a6\u5362\u9885\u5e90\u7089\u63b3\u5364\u864f\u9c81\u8d42\u7984\u5f55\u9646\u5786\u64b8\u565c\u95fe\u6cf8\u6e0c\u680c\u6a79\u8f73\u8f82\u8f98\u6c07\u80ea\u9e2c\u9e6d\u823b\u9c88\u5ce6\u631b\u5b6a\u6ee6\u4e71\u8114\u5a08\u683e\u9e3e\u92ae\u62a1\u8f6e\u4f26\u4ed1\u6ca6\u7eb6\u8bba\u56f5\u841d\u7f57\u903b\u9523\u7ba9\u9aa1\u9a86\u7edc\u8366\u7321\u6cfa\u6924\u8136\u9559\u9a74\u5415\u94dd\u4fa3\u5c61\u7f15\u8651\u6ee4\u7eff\u6988\u891b\u950a\u5452\u5988\u739b\u7801\u8682\u9a6c\u9a82\u5417\u551b\u5b37\u6769\u4e70\u9ea6\u5356\u8fc8\u8109\u52a2\u7792\u9992\u86ee\u6ee1\u8c29\u7f26\u9558\u98a1\u9cd7\u732b\u951a\u94c6\u8d38\u9ebd\u6ca1\u9541\u95e8\u95f7\u4eec\u626a\u7116\u61d1\u9494\u9530\u68a6\u772f\u8c1c\u5f25\u89c5\u5e42\u8288\u8c27\u7315\u7962\u7ef5\u7f05\u6e11\u817c\u9efe\u5e99\u7f08\u7f2a\u706d\u60af\u95fd\u95f5\u7f17\u9e23\u94ed\u8c2c\u8c1f\u84e6\u998d\u6b81\u9546\u8c0b\u4ea9\u94bc\u5450\u94a0\u7eb3\u96be\u6320\u8111\u607c\u95f9\u94d9\u8bb7\u9981\u5185\u62df\u817b\u94cc\u9cb5\u64b5\u8f87\u9cb6\u917f\u9e1f\u8311\u8885\u8042\u556e\u954a\u954d\u9667\u8616\u55eb\u989f\u8e51\u67e0\u72de\u5b81\u62e7\u6cde\u82ce\u549b\u804d\u94ae\u7ebd\u8113\u6d53\u519c\u4fac\u54dd\u9a7d\u9495\u8bfa\u50a9\u759f\u6b27\u9e25\u6bb4\u5455\u6ca4\u8bb4\u6004\u74ef\u76d8\u8e52\u5e9e\u629b\u75b1\u8d54\u8f94\u55b7\u9e4f\u7eb0\u7f74\u94cd\u9a97\u8c1d\u9a88\u98d8\u7f25\u9891\u8d2b\u5ad4\u82f9\u51ed\u8bc4\u6cfc\u9887\u948b\u6251\u94fa\u6734\u8c31\u9564\u9568\u6816\u8110\u9f50\u9a91\u5c82\u542f\u6c14\u5f03\u8bab\u8572\u9a90\u7eee\u6864\u789b\u9880\u9883\u9ccd\u7275\u948e\u94c5\u8fc1\u7b7e\u8c26\u94b1\u94b3\u6f5c\u6d45\u8c34\u5811\u4f65\u8368\u60ad\u9a9e\u7f31\u6920\u94a4\u67aa\u545b\u5899\u8537\u5f3a\u62a2\u5af1\u6a2f\u6217\u709d\u9516\u9535\u956a\u7f9f\u8dc4\u9539\u6865\u4e54\u4fa8\u7fd8\u7a8d\u8bee\u8c2f\u835e\u7f32\u7857\u8df7\u7a83\u60ec\u9532\u7ba7\u94a6\u4eb2\u5bdd\u9513\u8f7b\u6c22\u503e\u9877\u8bf7\u5e86\u63ff\u9cad\u7a77\u8315\u86f1\u5def\u8d47\u866e\u9cc5\u8d8b\u533a\u8eaf\u9a71\u9f8b\u8bce\u5c96\u9612\u89d1\u9e32\u98a7\u6743\u529d\u8be0\u7efb\u8f81\u94e8\u5374\u9e4a\u786e\u9615\u9619\u60ab\u8ba9\u9976\u6270\u7ed5\u835b\u5a06\u6861\u70ed\u97e7\u8ba4\u7eab\u996a\u8f6b\u8363\u7ed2\u5d58\u877e\u7f1b\u94f7\u98a6\u8f6f\u9510\u86ac\u95f0\u6da6\u6d12\u8428\u98d2\u9cc3\u8d5b\u4f1e\u6bf5\u7cc1\u4e27\u9a9a\u626b\u7f2b\u6da9\u556c\u94ef\u7a51\u6740\u5239\u7eb1\u94e9\u9ca8\u7b5b\u917e\u5220\u95ea\u9655\u8d61\u7f2e\u8baa\u59d7\u9a9f\u9490\u9cdd\u5892\u4f24\u8d4f\u57a7\u6b87\u89de\u70e7\u7ecd\u8d4a\u6444\u6151\u8bbe\u538d\u6ee0\u7572\u7ec5\u5ba1\u5a76\u80be\u6e17\u8bdc\u8c02\u6e16\u58f0\u7ef3\u80dc\u5e08\u72ee\u6e7f\u8bd7\u65f6\u8680\u5b9e\u8bc6\u9a76\u52bf\u9002\u91ca\u9970\u89c6\u8bd5\u8c25\u57d8\u83b3\u5f11\u8f7c\u8d33\u94c8\u9ca5\u5bff\u517d\u7ef6\u67a2\u8f93\u4e66\u8d4e\u5c5e\u672f\u6811\u7ad6\u6570\u6445\u7ebe\u5e05\u95e9\u53cc\u8c01\u7a0e\u987a\u8bf4\u7855\u70c1\u94c4\u4e1d\u9972\u53ae\u9a77\u7f0c\u9536\u9e36\u8038\u6002\u9882\u8bbc\u8bf5\u64de\u85ae\u998a\u98d5\u953c\u82cf\u8bc9\u8083\u8c21\u7a23\u867d\u968f\u7ee5\u5c81\u8c07\u5b59\u635f\u7b0b\u836a\u72f2\u7f29\u7410\u9501\u5522\u7743\u736d\u631e\u95fc\u94ca\u9cce\u6001\u949b\u9c90\u644a\u8d2a\u762b\u6ee9\u575b\u8c2d\u8c08\u53f9\u6619\u94bd\u952c\u9878\u6c64\u70eb\u50a5\u9967\u94f4\u9557\u6d9b\u7ee6\u8ba8\u97ec\u94fd\u817e\u8a8a\u9511\u9898\u4f53\u5c49\u7f07\u9e48\u9617\u7c9c\u9f86\u9ca6\u8d34\u94c1\u5385\u542c\u70c3\u94dc\u7edf\u6078\u5934\u94ad\u79c3\u56fe\u948d\u56e2\u629f\u9893\u8715\u9968\u8131\u9e35\u9a6e\u9a7c\u692d\u7ba8\u9f0d\u889c\u5a32\u817d\u5f2f\u6e7e\u987d\u4e07\u7ea8\u7efe\u7f51\u8f8b\u97e6\u8fdd\u56f4\u4e3a\u6f4d\u7ef4\u82c7\u4f1f\u4f2a\u7eac\u8c13\u536b\u8bff\u5e0f\u95f1\u6ca9\u6da0\u73ae\u97ea\u709c\u9c94\u6e29\u95fb\u7eb9\u7a33\u95ee\u960c\u74ee\u631d\u8717\u6da1\u7a9d\u5367\u83b4\u9f8c\u545c\u94a8\u4e4c\u8bec\u65e0\u829c\u5434\u575e\u96fe\u52a1\u8bef\u90ac\u5e91\u6003\u59a9\u9a9b\u9e49\u9e5c\u9521\u727a\u88ad\u4e60\u94e3\u620f\u7ec6\u9969\u960b\u73ba\u89cb\u867e\u8f96\u5ce1\u4fa0\u72ed\u53a6\u5413\u7856\u9c9c\u7ea4\u8d24\u8854\u95f2\u663e\u9669\u73b0\u732e\u53bf\u9985\u7fa1\u5baa\u7ebf\u82cb\u83b6\u85d3\u5c98\u7303\u5a34\u9e47\u75eb\u869d\u7c7c\u8df9\u53a2\u9576\u4e61\u8be6\u54cd\u9879\u8297\u9977\u9aa7\u7f03\u98e8\u8427\u56a3\u9500\u6653\u5578\u54d3\u6f47\u9a81\u7ee1\u67ad\u7bab\u534f\u631f\u643a\u80c1\u8c10\u5199\u6cfb\u8c22\u4eb5\u64b7\u7ec1\u7f2c\u950c\u8845\u5174\u9649\u8365\u51f6\u6c79\u9508\u7ee3\u9990\u9e3a\u865a\u5618\u987b\u8bb8\u53d9\u7eea\u7eed\u8be9\u987c\u8f69\u60ac\u9009\u7663\u7eda\u8c16\u94c9\u955f\u5b66\u8c11\u6cf6\u9cd5\u52cb\u8be2\u5bfb\u9a6f\u8bad\u8baf\u900a\u57d9\u6d54\u9c9f\u538b\u9e26\u9e2d\u54d1\u4e9a\u8bb6\u57ad\u5a05\u6860\u6c29\u9609\u70df\u76d0\u4e25\u5ca9\u989c\u960e\u8273\u538c\u781a\u5f66\u8c1a\u9a8c\u53a3\u8d5d\u4fe8\u5156\u8c33\u6079\u95eb\u917d\u9b47\u990d\u9f39\u9e2f\u6768\u626c\u75a1\u9633\u75d2\u517b\u6837\u7080\u7476\u6447\u5c27\u9065\u7a91\u8c23\u836f\u8f7a\u9e5e\u9cd0\u7237\u9875\u4e1a\u53f6\u9765\u8c12\u90ba\u6654\u70e8\u533b\u94f1\u9890\u9057\u4eea\u8681\u827a\u4ebf\u5fc6\u4e49\u8be3\u8bae\u8c0a\u8bd1\u5f02\u7ece\u8bd2\u5453\u5cc4\u9974\u603f\u9a7f\u7f22\u8f76\u8d3b\u9487\u9552\u9571\u7617\u8223\u836b\u9634\u94f6\u996e\u9690\u94df\u763e\u6a31\u5a74\u9e70\u5e94\u7f28\u83b9\u8424\u8425\u8367\u8747\u8d62\u9896\u8314\u83ba\u8426\u84e5\u6484\u5624\u6ee2\u6f46\u748e\u9e66\u763f\u988f\u7f42\u54df\u62e5\u4f63\u75c8\u8e0a\u548f\u955b\u4f18\u5fe7\u90ae\u94c0\u72b9\u8bf1\u83b8\u94d5\u9c7f\u8206\u9c7c\u6e14\u5a31\u4e0e\u5c7f\u8bed\u72f1\u8a89\u9884\u9a6d\u4f1b\u4fe3\u8c00\u8c15\u84e3\u5d5b\u996b\u9608\u59aa\u7ea1\u89ce\u6b24\u94b0\u9e46\u9e6c\u9f89\u9e33\u6e0a\u8f95\u56ed\u5458\u5706\u7f18\u8fdc\u6a7c\u9e22\u9f0b\u7ea6\u8dc3\u94a5\u7ca4\u60a6\u9605\u94ba\u90e7\u5300\u9668\u8fd0\u8574\u915d\u6655\u97f5\u90d3\u82b8\u607d\u6120\u7ead\u97eb\u6b92\u6c32\u6742\u707e\u8f7d\u6512\u6682\u8d5e\u74d2\u8db1\u933e\u8d43\u810f\u9a75\u51ff\u67a3\u8d23\u62e9\u5219\u6cfd\u8d5c\u5567\u5e3b\u7ba6\u8d3c\u8c2e\u8d60\u7efc\u7f2f\u8f67\u94e1\u95f8\u6805\u8bc8\u658b\u503a\u6be1\u76cf\u65a9\u8f97\u5d2d\u6808\u6218\u7efd\u8c35\u5f20\u6da8\u5e10\u8d26\u80c0\u8d75\u8bcf\u948a\u86f0\u8f99\u9517\u8fd9\u8c2a\u8f84\u9e67\u8d1e\u9488\u4fa6\u8bca\u9547\u9635\u6d48\u7f1c\u6862\u8f78\u8d48\u796f\u9e29\u6323\u7741\u72f0\u4e89\u5e27\u90d1\u8bc1\u8be4\u5ce5\u94b2\u94ee\u7b5d\u7ec7\u804c\u6267\u7eb8\u631a\u63b7\u5e1c\u8d28\u6ede\u9a98\u6809\u6800\u8f75\u8f7e\u8d3d\u9e37\u86f3\u7d77\u8e2c\u8e2f\u89ef\u949f\u7ec8\u79cd\u80bf\u4f17\u953a\u8bcc\u8f74\u76b1\u663c\u9aa4\u7ea3\u7ec9\u732a\u8bf8\u8bdb\u70db\u77a9\u5631\u8d2e\u94f8\u9a7b\u4f2b\u69e0\u94e2\u4e13\u7816\u8f6c\u8d5a\u556d\u9994\u989e\u6869\u5e84\u88c5\u5986\u58ee\u72b6\u9525\u8d58\u5760\u7f00\u9a93\u7f12\u8c06\u7740\u6d4a\u8bfc\u956f\u5179\u8d44\u6e0d\u8c18\u7f01\u8f8e\u8d40\u7726\u9531\u9f87\u9cbb\u8e2a\u603b\u7eb5\u506c\u90b9\u8bf9\u9a7a\u9cb0\u8bc5\u7ec4\u955e\u94bb\u7f35\u8e9c\u9cdf\u7ff1\u5e76\u7845\u6770\u8bc0\u5938\u4e48\u637b\u51c4\u6266\u5723\u5c38\u6d82\u9528\u613f\u4e91\u7b51\u8ba0\u8c2b\u90c4\u52d0\u51fc\u5742\u5785\u57b4\u57ef\u57dd\u82d8\u836c\u836e\u839c\u83bc\u85c1\u549d\u5c99\u5d74\u72b8\u72cd\u9980\u9987\u9993\u9995\u6123\u61b7\u4e2c\u6e86\u6edf\u6f24\u752f\u7e9f\u7ed4\u7ef1\u73c9\u67a7\u684a\u69d4\u6a65\u8f71\u8f77\u8d4d\u80b7\u80e8\u98da\u7173\u7145\u7198\u610d\u781c\u78d9\u770d\u949a\u94b7\u94d8\u94de\u9503\u950d\u950e\u950f\u9518\u951d\u952a\u952b\u953f\u9545\u954e\u9562\u9565\u9569\u9572\u7a06\u9e4b\u9e5b\u9e71\u75ac\u75b4\u75d6\u766f\u88e5\u8941\u8022\u98a5\u87a8\u9c85\u9c86\u9c87\u9c9e\u9cb4\u9cba\u9cbc\u9cca\u9ccb\u9cd8\u9cd9\u9792\u97b4\u9f44"
tc_char = u"\u9312\u769a\u85f9\u7919\u611b\u566f\u5b21\u74a6\u66d6\u9744\u8af3\u92a8\u9d6a\u9aaf\u8956\u5967\u5abc\u9a41\u9c32\u58e9\u7f77\u9200\u64fa\u6557\u5504\u9812\u8fa6\u7d46\u9211\u5e6b\u7d81\u938a\u8b17\u525d\u98fd\u5bf6\u5831\u9b91\u9d07\u9f59\u8f29\u8c9d\u92c7\u72fd\u5099\u618a\u9d6f\u8cc1\u931b\u7e43\u7b46\u7562\u6583\u5e63\u9589\u84fd\u55f6\u6f77\u924d\u7bf3\u8e55\u908a\u7de8\u8cb6\u8b8a\u8faf\u8fae\u8290\u7df6\u7c69\u6a19\u9a43\u98ae\u98c6\u93e2\u9463\u9c3e\u9c49\u5225\u765f\u7015\u6ff1\u8cd3\u64ef\u5110\u7e7d\u6ab3\u6baf\u81cf\u944c\u9ad5\u9b22\u9905\u7a1f\u64a5\u7f3d\u9251\u99c1\u9911\u9238\u9d53\u88dc\u923d\u8ca1\u53c3\u8836\u6b98\u615a\u6158\u71e6\u9a42\u9ef2\u84bc\u8259\u5009\u6ec4\u5ec1\u5074\u518a\u6e2c\u60fb\u5c64\u8a6b\u9364\u5115\u91f5\u6519\u647b\u87ec\u995e\u8b92\u7e8f\u93df\u7522\u95e1\u986b\u56c5\u8ac2\u8b96\u8546\u61fa\u5b0b\u9a4f\u8998\u79aa\u9414\u5834\u5617\u9577\u511f\u8178\u5ee0\u66a2\u5000\u8407\u60b5\u95b6\u9be7\u9214\u8eca\u5fb9\u7868\u5875\u9673\u896f\u5096\u8af6\u6aec\u78e3\u9f54\u6490\u7a31\u61f2\u8aa0\u9a01\u68d6\u6a89\u92ee\u943a\u7661\u9072\u99b3\u6065\u9f52\u71be\u98ed\u9d1f\u6c96\u885d\u87f2\u5bf5\u9283\u7587\u8e8a\u7c4c\u7da2\u5114\u5e6c\u8b8e\u6ae5\u5eda\u92e4\u96db\u790e\u5132\u89f8\u8655\u82bb\u7d40\u8e95\u50b3\u91e7\u7621\u95d6\u5275\u6134\u9318\u7d9e\u7d14\u9d89\u7dbd\u8f1f\u9f6a\u8fad\u8a5e\u8cdc\u9dbf\u8070\u8525\u56ea\u5f9e\u53e2\u84ef\u9a44\u6a05\u6e4a\u8f33\u8ea5\u7ac4\u651b\u932f\u92bc\u9e7a\u9054\u5660\u97c3\u5e36\u8cb8\u99d8\u7d3f\u64d4\u55ae\u9132\u64a3\u81bd\u619a\u8a95\u5f48\u6bab\u8ce7\u7649\u7c1e\u7576\u64cb\u9ee8\u8569\u6a94\u8b9c\u78ad\u8960\u6417\u5cf6\u79b1\u5c0e\u76dc\u71fe\u71c8\u9127\u9419\u6575\u6ecc\u905e\u7de0\u7cf4\u8a46\u8ae6\u7d88\u89bf\u93d1\u985b\u9ede\u588a\u96fb\u5dd4\u923f\u7672\u91e3\u8abf\u929a\u9bdb\u8adc\u758a\u9c08\u91d8\u9802\u9320\u8a02\u92cc\u4e1f\u92a9\u6771\u52d5\u68df\u51cd\u5d20\u9d87\u7ac7\u72a2\u7368\u8b80\u8ced\u934d\u7006\u6add\u7258\u7be4\u9ef7\u935b\u65b7\u7dde\u7c6a\u514c\u968a\u5c0d\u61df\u9413\u5678\u9813\u920d\u71c9\u8e89\u596a\u58ae\u9438\u9d5d\u984d\u8a1b\u60e1\u9913\u8ae4\u580a\u95bc\u8edb\u92e8\u9354\u9d9a\u984e\u9853\u9c77\u8a92\u5152\u723e\u990c\u8cb3\u9087\u927a\u9d2f\u9b9e\u767c\u7f70\u95a5\u743a\u792c\u91e9\u7169\u8ca9\u98ef\u8a2a\u7d21\u9201\u9b74\u98db\u8ab9\u5ee2\u8cbb\u7dcb\u9428\u9be1\u7d1b\u58b3\u596e\u61a4\u7cde\u50e8\u8c50\u6953\u92d2\u98a8\u760b\u99ae\u7e2b\u8af7\u9cf3\u7043\u819a\u8f3b\u64ab\u8f14\u8ce6\u5fa9\u8ca0\u8a03\u5a66\u7e1b\u9ce7\u99d9\u7d31\u7d3c\u8cfb\u9ea9\u9b92\u9c12\u91d3\u8a72\u9223\u84cb\u8cc5\u687f\u8d95\u7a08\u8d1b\u5c37\u641f\u7d3a\u5ca1\u525b\u92fc\u7db1\u5d17\u6207\u93ac\u776a\u8aa5\u7e1e\u92ef\u64f1\u9d3f\u95a3\u927b\u500b\u7d07\u9398\u6f41\u7d66\u4e99\u8ce1\u7d86\u9bc1\u9f94\u5bae\u978f\u8ca2\u9264\u6e9d\u830d\u69cb\u8cfc\u5920\u8a6c\u7df1\u89af\u8831\u9867\u8a41\u8f42\u9237\u932e\u9d23\u9d60\u9dbb\u526e\u639b\u9d30\u6451\u95dc\u89c0\u9928\u6163\u8cab\u8a7f\u645c\u9e1b\u9c25\u5ee3\u7377\u898f\u6b78\u9f9c\u95a8\u8ecc\u8a6d\u8cb4\u528a\u532d\u528c\u5aaf\u6a9c\u9bad\u9c56\u8f25\u6efe\u889e\u7dc4\u9bc0\u934b\u570b\u904e\u581d\u54bc\u5e57\u69e8\u87c8\u927f\u99ed\u97d3\u6f22\u95de\u7d4e\u9821\u865f\u705d\u9865\u95a1\u9db4\u8cc0\u8a36\u95d4\u8823\u6a6b\u8f5f\u9d3b\u7d05\u9ecc\u8a0c\u8452\u958e\u9c5f\u58fa\u8b77\u6eec\u6236\u6ef8\u9d98\u5629\u83ef\u756b\u5283\u8a71\u9a4a\u6a3a\u93f5\u61f7\u58de\u6b61\u74b0\u9084\u7de9\u63db\u559a\u7613\u7165\u6e19\u5950\u7e6f\u9370\u9bc7\u9ec3\u8b0a\u9c09\u63ee\u8f1d\u6bc0\u8cc4\u7a62\u6703\u71f4\u532f\u8af1\u8aa8\u7e6a\u8a7c\u8588\u5666\u6fae\u7e62\u743f\u6689\u8477\u6e3e\u8ae2\u991b\u95bd\u7372\u8ca8\u798d\u9225\u944a\u64ca\u6a5f\u7a4d\u9951\u8de1\u8b4f\u96de\u7e3e\u7ddd\u6975\u8f2f\u7d1a\u64e0\u5e7e\u858a\u5291\u6fdf\u8a08\u8a18\u969b\u7e7c\u7d00\u8a10\u8a70\u85ba\u5630\u568c\u9a65\u74a3\u89ac\u9f4f\u78ef\u7f88\u8806\u8e8b\u973d\u9c6d\u9bfd\u593e\u83a2\u9830\u8cc8\u9240\u50f9\u99d5\u90df\u6d79\u92cf\u93b5\u87ef\u6bb2\u76e3\u5805\u7b8b\u9593\u8271\u7dd8\u7e6d\u6aa2\u583f\u9e7c\u63c0\u64bf\u7c21\u5109\u6e1b\u85a6\u6abb\u9452\u8e10\u8ce4\u898b\u9375\u8266\u528d\u991e\u6f38\u6ffa\u6f97\u8aeb\u7e11\u6214\u6229\u77bc\u9dbc\u7b67\u9c39\u97c9\u5c07\u6f3f\u8523\u69f3\u734e\u8b1b\u91ac\u7d73\u97c1\u81a0\u6f86\u9a55\u5b0c\u652a\u9278\u77ef\u50e5\u8173\u9903\u7e73\u7d5e\u8f4e\u8f03\u649f\u5da0\u9de6\u9bab\u968e\u7bc0\u6f54\u7d50\u8aa1\u5c46\u7664\u981c\u9b9a\u7dca\u9326\u50c5\u8b39\u9032\u6649\u71fc\u76e1\u52c1\u834a\u8396\u5df9\u85ce\u9949\u7e09\u8d10\u89b2\u9be8\u9a5a\u7d93\u9838\u975c\u93e1\u5f91\u75d9\u7af6\u51c8\u5244\u6d87\u9015\u5f33\u811b\u975a\u7cfe\u5ec4\u820a\u9b2e\u9ce9\u9df2\u99d2\u8209\u64da\u92f8\u61fc\u5287\u8a4e\u5c68\u6af8\u98b6\u9245\u92e6\u7ab6\u9f5f\u9d51\u7d79\u9308\u942b\u96cb\u89ba\u6c7a\u7d55\u8b4e\u73a8\u921e\u8ecd\u99ff\u76b8\u958b\u51f1\u5274\u584f\u613e\u6137\u93a7\u9347\u9f95\u958c\u9227\u92ac\u9846\u6bbc\u8ab2\u9a0d\u7dd9\u8efb\u9233\u9301\u9837\u58be\u61c7\u9f66\u93d7\u6473\u5eab\u8932\u56b3\u584a\u5108\u9136\u5672\u81be\u5bec\u736a\u9ad6\u7926\u66e0\u6cc1\u8a86\u8a91\u913a\u58d9\u7e8a\u8cba\u8667\u5dcb\u7aba\u994b\u6f70\u5331\u8562\u6192\u8075\u7c23\u95ab\u9315\u9be4\u64f4\u95ca\u8810\u881f\u81d8\u840a\u4f86\u8cf4\u5d0d\u5fa0\u6df6\u7028\u8cda\u775e\u9338\u7669\u7c5f\u85cd\u6b04\u6514\u7c43\u95cc\u862d\u703e\u8b95\u652c\u89bd\u61f6\u7e9c\u721b\u6feb\u5d50\u6b16\u6595\u946d\u8964\u746f\u95ac\u92c3\u6488\u52de\u6f87\u562e\u5d97\u92a0\u9412\u7646\u6a02\u9c33\u9433\u58d8\u985e\u6dda\u8a84\u7e32\u7c6c\u8c8d\u96e2\u9bc9\u79ae\u9e97\u53b2\u52f5\u792b\u6b77\u701d\u96b8\u5137\u9148\u58e2\u85f6\u849e\u863a\u56a6\u9090\u9a6a\u7e2d\u6aea\u6adf\u8f62\u792a\u92f0\u9e1d\u7658\u7cf2\u8e92\u9742\u9c7a\u9c67\u5006\u806f\u84ee\u9023\u942e\u6190\u6f23\u7c3e\u6582\u81c9\u93c8\u6200\u7149\u7df4\u861e\u5969\u7032\u7489\u6bae\u8933\u895d\u9c31\u7ce7\u6dbc\u5169\u8f1b\u8ad2\u9b4e\u7642\u907c\u9410\u7e5a\u91d5\u9def\u7375\u81e8\u9130\u9c57\u51dc\u8cc3\u85fa\u5ee9\u6a81\u8f54\u8eaa\u9f61\u9234\u9748\u5dba\u9818\u7dbe\u6b1e\u87f6\u9bea\u993e\u5289\u700f\u9a2e\u7db9\u93a6\u9dda\u9f8d\u807e\u56a8\u7c60\u58df\u650f\u96b4\u8622\u7027\u74cf\u6af3\u6727\u7931\u6a13\u5a41\u645f\u7c0d\u50c2\u851e\u560d\u5d81\u93e4\u763a\u802c\u87bb\u9acf\u8606\u76e7\u9871\u5eec\u7210\u64c4\u9e75\u865c\u9b6f\u8cc2\u797f\u9304\u9678\u58da\u64fc\u5695\u95ad\u7018\u6de5\u6ae8\u6ad3\u8f64\u8f05\u8f46\u6c0c\u81da\u9e15\u9dfa\u826b\u9c78\u5dd2\u6523\u5b7f\u7064\u4e82\u81e0\u5b4c\u6b12\u9e1e\u947e\u6384\u8f2a\u502b\u4f96\u6dea\u7db8\u8ad6\u5707\u863f\u7f85\u908f\u947c\u7c6e\u9a3e\u99f1\u7d61\u7296\u7380\u6ffc\u6b0f\u8161\u93cd\u9a62\u5442\u92c1\u4fb6\u5c62\u7e37\u616e\u6ffe\u7da0\u6ada\u8938\u92dd\u5638\u5abd\u746a\u78bc\u879e\u99ac\u7f75\u55ce\u561c\u5b24\u69aa\u8cb7\u9ea5\u8ce3\u9081\u8108\u52f1\u779e\u9945\u883b\u6eff\u8b3e\u7e35\u93dd\u9859\u9c3b\u8c93\u9328\u925a\u8cbf\u9ebc\u6c92\u9382\u9580\u60b6\u5011\u636b\u71dc\u61e3\u9346\u9333\u5922\u7787\u8b0e\u5f4c\u8993\u51aa\u7f8b\u8b10\u737c\u79b0\u7dbf\u7dec\u6fa0\u9766\u9efd\u5edf\u7df2\u7e46\u6ec5\u61ab\u95a9\u9594\u7de1\u9cf4\u9298\u8b2c\u8b28\u9a40\u9943\u6b7f\u93cc\u8b00\u755d\u926c\u5436\u9209\u7d0d\u96e3\u6493\u8166\u60f1\u9b27\u9403\u8a25\u9912\u5167\u64ec\u81a9\u922e\u9be2\u6506\u8f26\u9bf0\u91c0\u9ce5\u8526\u88ca\u8076\u5699\u9477\u93b3\u9689\u8617\u56c1\u9862\u8ea1\u6ab8\u7370\u5be7\u64f0\u6fd8\u82e7\u5680\u8079\u9215\u7d10\u81bf\u6fc3\u8fb2\u5102\u5665\u99d1\u91f9\u8afe\u513a\u7627\u6b50\u9dd7\u6bc6\u5614\u6f1a\u8b33\u616a\u750c\u76e4\u8e63\u9f90\u62cb\u76b0\u8ce0\u8f61\u5674\u9d6c\u7d15\u7f86\u9239\u9a19\u8ade\u99e2\u98c4\u7e39\u983b\u8ca7\u5b2a\u860b\u6191\u8a55\u6f51\u9817\u91d9\u64b2\u92ea\u6a38\u8b5c\u93f7\u9420\u68f2\u81cd\u9f4a\u9a0e\u8c48\u555f\u6c23\u68c4\u8a16\u8604\u9a0f\u7dba\u69bf\u78e7\u980e\u980f\u9c2d\u727d\u91ec\u925b\u9077\u7c3d\u8b19\u9322\u9257\u6f5b\u6dfa\u8b74\u5879\u50c9\u8541\u6173\u9a2b\u7e7e\u69e7\u9210\u69cd\u55c6\u58bb\u8594\u5f37\u6436\u5b19\u6aa3\u6227\u7197\u9306\u93d8\u93f9\u7fa5\u8e4c\u936c\u6a4b\u55ac\u50d1\u7ff9\u7ac5\u8a9a\u8b59\u854e\u7e70\u78fd\u8e7a\u7aca\u611c\u9365\u7bcb\u6b3d\u89aa\u5be2\u92df\u8f15\u6c2b\u50be\u9803\u8acb\u6176\u64b3\u9bd6\u7aae\u7162\u86fa\u5df0\u8cd5\u87e3\u9c0d\u8da8\u5340\u8ec0\u9a45\u9f72\u8a58\u5d87\u95c3\u89b7\u9d1d\u9874\u6b0a\u52f8\u8a6e\u7da3\u8f07\u9293\u537b\u9d72\u78ba\u95cb\u95d5\u6128\u8b93\u9952\u64fe\u7e5e\u8558\u5b08\u6a48\u71b1\u97cc\u8a8d\u7d09\u98ea\u8ed4\u69ae\u7d68\u5db8\u8811\u7e1f\u92a3\u9870\u8edf\u92b3\u8706\u958f\u6f64\u7051\u85a9\u98af\u9c13\u8cfd\u5098\u6bff\u7cdd\u55aa\u9a37\u6383\u7e45\u6f80\u55c7\u92ab\u7a61\u6bba\u524e\u7d17\u93a9\u9bca\u7be9\u91c3\u522a\u9583\u965c\u8d0d\u7e55\u8a15\u59cd\u9a38\u91e4\u9c54\u5891\u50b7\u8cde\u5770\u6ba4\u89f4\u71d2\u7d39\u8cd2\u651d\u61fe\u8a2d\u5399\u7044\u756c\u7d33\u5be9\u5b38\u814e\u6ef2\u8a75\u8ad7\u700b\u8072\u7e69\u52dd\u5e2b\u7345\u6fd5\u8a69\u6642\u8755\u5be6\u8b58\u99db\u52e2\u9069\u91cb\u98fe\u8996\u8a66\u8b1a\u5852\u8494\u5f12\u8efe\u8cb0\u9230\u9c23\u58fd\u7378\u7dac\u6a1e\u8f38\u66f8\u8d16\u5c6c\u8853\u6a39\u8c4e\u6578\u6504\u7d13\u5e25\u9582\u96d9\u8ab0\u7a05\u9806\u8aaa\u78a9\u720d\u9460\u7d72\u98fc\u5edd\u99df\u7de6\u9376\u9de5\u8073\u616b\u980c\u8a1f\u8aa6\u64fb\u85ea\u993f\u98bc\u93aa\u8607\u8a34\u8085\u8b16\u7a4c\u96d6\u96a8\u7d8f\u6b72\u8ab6\u5b6b\u640d\u7b4d\u84c0\u733b\u7e2e\u7463\u9396\u55e9\u8127\u737a\u64bb\u95e5\u9248\u9c28\u614b\u9226\u9b90\u6524\u8caa\u7671\u7058\u58c7\u8b5a\u8ac7\u5606\u66c7\u926d\u931f\u9807\u6e6f\u71d9\u513b\u9933\u940b\u93dc\u6fe4\u7d73\u8a0e\u97dc\u92f1\u9a30\u8b04\u92bb\u984c\u9ad4\u5c5c\u7df9\u9d5c\u95d0\u7cf6\u9f60\u9c37\u8cbc\u9435\u5ef3\u807d\u70f4\u9285\u7d71\u615f\u982d\u9204\u79bf\u5716\u91f7\u5718\u6476\u9839\u86fb\u98e9\u812b\u9d15\u99b1\u99dd\u6a62\u7c5c\u9f09\u896a\u5aa7\u8183\u5f4e\u7063\u9811\u842c\u7d08\u7db0\u7db2\u8f1e\u97cb\u9055\u570d\u70ba\u6ff0\u7dad\u8466\u5049\u507d\u7def\u8b02\u885b\u8ac9\u5e43\u95c8\u6e88\u6f7f\u744b\u97d9\u7152\u9baa\u6eab\u805e\u7d0b\u7a69\u554f\u95bf\u7515\u64be\u8778\u6e26\u7aa9\u81e5\u8435\u9f77\u55da\u93a2\u70cf\u8aa3\u7121\u856a\u5433\u5862\u9727\u52d9\u8aa4\u9114\u5ee1\u61ae\u5af5\u9a16\u9d61\u9da9\u932b\u72a7\u8972\u7fd2\u9291\u6232\u7d30\u993c\u9b29\u74bd\u89a1\u8766\u8f44\u5cfd\u4fe0\u72f9\u5ec8\u5687\u7864\u9bae\u7e96\u8ce2\u929c\u9591\u986f\u96aa\u73fe\u737b\u7e23\u9921\u7fa8\u61b2\u7dda\u83a7\u859f\u861a\u5cf4\u736b\u5afb\u9df4\u7647\u8814\u79c8\u8e9a\u5ec2\u9472\u9109\u8a73\u97ff\u9805\u858c\u9909\u9a64\u7dd7\u9957\u856d\u56c2\u92b7\u66c9\u562f\u5635\u701f\u9a4d\u7d83\u689f\u7c2b\u5354\u633e\u651c\u8105\u8ae7\u5beb\u7009\u8b1d\u893b\u64f7\u7d32\u7e88\u92c5\u91c1\u8208\u9658\u6ece\u5147\u6d36\u92b9\u7e61\u9948\u9d42\u865b\u5653\u9808\u8a31\u6558\u7dd2\u7e8c\u8a61\u980a\u8ed2\u61f8\u9078\u766c\u7d62\u8afc\u9249\u93c7\u5b78\u8b14\u6fa9\u9c48\u52db\u8a62\u5c0b\u99b4\u8a13\u8a0a\u905c\u5864\u6f6f\u9c58\u58d3\u9d09\u9d28\u555e\u4e9e\u8a1d\u57e1\u5a6d\u690f\u6c2c\u95b9\u7159\u9e7d\u56b4\u5dd6\u984f\u95bb\u8277\u53ad\u786f\u5f65\u8afa\u9a57\u53b4\u8d17\u513c\u5157\u8b9e\u61e8\u9586\u91c5\u9b58\u995c\u9f34\u9d26\u694a\u63da\u760d\u967d\u7662\u990a\u6a23\u716c\u7464\u6416\u582f\u9059\u7aaf\u8b20\u85e5\u8efa\u9dc2\u9c29\u723a\u9801\u696d\u8449\u9768\u8b01\u9134\u66c4\u71c1\u91ab\u92a5\u9824\u907a\u5100\u87fb\u85dd\u5104\u61b6\u7fa9\u8a63\u8b70\u8abc\u8b6f\u7570\u7e79\u8a52\u56c8\u5da7\u98f4\u61cc\u9a5b\u7e0a\u8efc\u8cbd\u91d4\u93b0\u943f\u761e\u8264\u852d\u9670\u9280\u98f2\u96b1\u92a6\u766e\u6afb\u5b30\u9df9\u61c9\u7e93\u7469\u87a2\u71df\u7192\u8805\u8d0f\u7a4e\u584b\u9daf\u7e08\u93a3\u6516\u56b6\u7005\u7020\u74d4\u9e1a\u766d\u9826\u7f4c\u55b2\u64c1\u50ad\u7670\u8e34\u8a60\u93de\u512a\u6182\u90f5\u923e\u7336\u8a98\u8555\u92aa\u9b77\u8f3f\u9b5a\u6f01\u5a1b\u8207\u5dbc\u8a9e\u7344\u8b7d\u9810\u99ad\u50b4\u4fc1\u8adb\u8aed\u8577\u5d33\u98eb\u95be\u5ad7\u7d06\u89a6\u6b5f\u923a\u9d52\u9df8\u9f6c\u9d1b\u6df5\u8f45\u5712\u54e1\u5713\u7de3\u9060\u6ade\u9cf6\u9eff\u7d04\u8e8d\u9470\u7cb5\u6085\u95b1\u925e\u9116\u52fb\u9695\u904b\u860a\u919e\u6688\u97fb\u9106\u8553\u60f2\u614d\u7d1c\u97de\u6b9e\u6c33\u96dc\u707d\u8f09\u6522\u66ab\u8d0a\u74da\u8db2\u93e8\u8d13\u81df\u99d4\u947f\u68d7\u8cac\u64c7\u5247\u6fa4\u8cfe\u5616\u5e58\u7c00\u8cca\u8b56\u8d08\u7d9c\u7e52\u8ecb\u9358\u9598\u67f5\u8a50\u9f4b\u50b5\u6c08\u76de\u65ac\u8f3e\u5d84\u68e7\u6230\u7dbb\u8b6b\u5f35\u6f32\u5e33\u8cec\u8139\u8d99\u8a54\u91d7\u87c4\u8f4d\u937a\u9019\u8b2b\u8f12\u9dd3\u8c9e\u91dd\u5075\u8a3a\u93ae\u9663\u6e5e\u7e1d\u6968\u8eeb\u8cd1\u798e\u9d06\u6399\u775c\u7319\u722d\u5e40\u912d\u8b49\u8acd\u5d22\u9266\u931a\u7b8f\u7e54\u8077\u57f7\u7d19\u646f\u64f2\u5e5f\u8cea\u6eef\u9a2d\u6adb\u6894\u8ef9\u8f0a\u8d04\u9dd9\u8784\u7e36\u8e93\u8e91\u89f6\u9418\u7d42\u7a2e\u816b\u773e\u937e\u8b05\u8ef8\u76ba\u665d\u9a5f\u7d02\u7e10\u8c6c\u8af8\u8a85\u71ed\u77da\u56d1\u8caf\u9444\u99d0\u4f47\u6ae7\u9296\u5c08\u78da\u8f49\u8cfa\u56c0\u994c\u9873\u6a01\u838a\u88dd\u599d\u58ef\u72c0\u9310\u8d05\u589c\u7db4\u9a05\u7e0b\u8ac4\u8457\u6fc1\u8ad1\u9432\u8332\u8cc7\u6f2c\u8aee\u7dc7\u8f1c\u8cb2\u7725\u9319\u9f5c\u9bd4\u8e64\u7e3d\u7e31\u50af\u9112\u8acf\u9a36\u9beb\u8a5b\u7d44\u93c3\u9246\u7e98\u8ea6\u9c52\u7ffa\u4e26\u77fd\u5091\u8a23\u8a87\u9ebd\u649a\u6dd2\u6261\u8056\u5c4d\u5857\u9341\u9858\u96f2\u7bc9\u8a01\u8b7e\u90e4\u731b\u6c39\u962a\u58df\u5816\u57b5\u588a\u6abe\u8552\u8464\u84e7\u8493\u69c1\u565d\u5db4\u810a\u7341\u9e85\u9918\u9937\u994a\u9962\u695e\u6035\u723f\u6f35\u7069\u6feb\u5be7\u7cf8\u7d5d\u7dd4\u7449\u6898\u68ec\u6a70\u6aeb\u8ef2\u8ee4\u8ceb\u8181\u8156\u98c8\u7cca\u7146\u6e9c\u6e63\u78b8\u6efe\u7798\u9208\u9255\u92e3\u92b1\u92e5\u92f6\u9426\u9427\u9369\u9340\u9343\u9307\u9384\u9387\u93bf\u941d\u9465\u9479\u9454\u7a6d\u9d93\u9da5\u9e0c\u7667\u5c59\u7602\u81d2\u8947\u7e48\u802e\u986c\u87ce\u9b81\u9b83\u9b8e\u9bd7\u9bdd\u9bf4\u9c5d\u9bff\u9c20\u9c35\u9c45\u97bd\u97dd\u9f47"
sc_to_tc = str.maketrans(sc_char, tc_char)
def jianfan(unistr):
    "This convert simplified Chinese characters to traditional Chinese characters"
    return unistr.translate(sc_to_tc)

def appendEOF(df, lastprog_duration=None, daily_starttime=None):
    "Append EOF entry to DataFrame"
    x = to_datetime(df["TXDate"].apply(lambda x: (str(x))) + " " + df["ActualTime"].apply(lambda x: (str(x))), format="%Y%m%d %H:%M")
    lastProgDuration = lastprog_duration
    dailyStartTime = daily_starttime

    lastProgStartTimestamp = x.max()
    eofTimestamp = None
    if notnull(lastProgDuration):
        eofTimestamp = lastProgStartTimestamp + lastProgDuration
    elif notnull(dailyStartTime):
        eofTimestamp = to_datetime(lastProgStartTimestamp.strftime("%Y%m%d") + " " + dailyStartTime.strftime("%H:%M"), format="%Y%m%d %H:%M")
        if eofTimestamp < lastProgStartTimestamp:
            eofTimestamp += Timedelta("1 days")
    else:
        oneDay = Timedelta(1,"D")
        oneWeek = Timedelta(1,"W")
        oneDayBefore = lastProgStartTimestamp - oneDay
        oneWeekBefore = lastProgStartTimestamp - oneWeek
        if x.min() <= oneWeekBefore:
            eofTimestamp = x[x > oneWeekBefore].min() + oneWeek
        elif x.min() <= oneDayBefore:
            eofTimestamp = x[x > oneDayBefore].min() + oneDay
        else:
            eofTimestamp = x.min() + oneDay
    # In order to avoid exception from VIM, round the eof timestamp to coming :00 or :30
    if eofTimestamp.minute > 30:
        eofTimestamp += Timedelta(minutes=60-eofTimestamp.minute)
    elif eofTimestamp.minute > 0:
        eofTimestamp += Timedelta(minutes=30-eofTimestamp.minute)
    df.loc[df.last_valid_index() + 1, ["TXDate", "ActualTime", "FullTitleEng", "FullTitleChi", "BrandNameEng", "BrandNameChi"]] = [eofTimestamp.strftime("%Y%m%d"), eofTimestamp.strftime("%H:%M"), "END OF FILE", "END OF FILE", "END OF FILE", "END OF FILE"]
    
def constructID(record):
    Cid = ''
    if (notnull(record["BrandNameEng"]) and len(str(record["BrandNameEng"]).strip()) > 0) > 0 :
        Cid += str(record["BrandNameEng"])
    if ((notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="" and str(record["SeasonNo"]).replace(".0","") !="0") or (notnull(record["EpisodeNo"]) and str(record["EpisodeNo"]).strip()!="" and str(record["EpisodeNo"]).replace(".0","") !="0")):
        if (notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="" and str(record["SeasonNo"]).replace(".0","") !="0"):
            Cid += "S" + str(record["SeasonNo"]).replace(".0","")
        if notnull(record["EpisodeNo"]) and str(record["EpisodeNo"]).strip()!="" and str(record["EpisodeNo"]).replace(".0","") !="0":
            Cid  += "E" + str(record["EpisodeNo"]).replace(".0","")
    if (notnull(record["EpisodeNameEng"]) and len(str(record["EpisodeNameEng"]).strip()) > 0) :
        Cid += str(record["EpisodeNameEng"])
    
    Cid = Cid.lower()
    
    Sid = ''
    if (notnull(record["BrandNameEng"]) and len(str(record["BrandNameEng"]).strip()) > 0) > 0 :
        Sid += str(record["BrandNameEng"])
    if (notnull(record["SeasonNo"]) and str(record["SeasonNo"]).strip()!="" and str(record["SeasonNo"]).replace(".0","") !="0"):
        Sid += "S" + str(record["SeasonNo"]).replace(".0","")

    Sid = Sid.lower()
    
    return Series([Cid, Sid])

def convert_linear(in_io):

    # Read input file to json
    if type(in_io) != str:
        in_io = str(in_io.read(), encoding="utf-8-sig")
    else:
        filename = re.split("/|\\\\", os.path.abspath(in_io))
        filename_dir = "/".join(filename[0:-1])
        out_filename, out_filename_ext = os.path.splitext(secure_filename(filename[-1]))
        if out_filename_ext.lower() == ".json":
            BOEinput = open(in_io, "r", encoding='utf-8-sig')
            in_io = BOEinput.read()
            BOEinput.close()

    # Read input file
    in_io = re.sub("{\s*\"input\":\s*","",in_io[:-1])
    indf = read_json(in_io).sort_index()
    
    if "ownerChannel" in indf.columns:
        owner_channel = list(indf["ownerChannel"])[0]
    elif "channelNo" in indf.columns:
        owner_channel = list(indf["channelNo"])[0]
    else:
        raise ValueError("Suppose the 'ownerChannel' or 'channelNo' column tells the channel name but does not exist!")
    
    if owner_channel != "":
        return dc.APISettings.cleanser.get("linear").get(owner_channel)(in_io, None, None, owner_channel=owner_channel).rename(columns=pwhHeaderMapping)
    else:
        return None

def ViuTV_convert_linear(in_io, out_io, out_format="preV1506", owner_channel="ViuTV"):
    "Convert linear schedule for ViuTV"
    
    # Read input file
    indf = read_json(in_io).sort_index() 
    indf.dropna(how="any", subset=["txDate"], inplace=True)
    
    # Create output DataFrame
    outdf = DataFrame(columns=internalHeader)

    # Extract data from full title


    # Fill output DataFrame with related info
    indf = indf[notnull(indf["txDate"])]
    cnt = 0
    for i in indf["txDate"]:
        try:
            test = to_datetime(str(i), format="%Y-%m-%d %H:%M:%S")
        except ValueError:
            raise ValueError("Planning Date line "+str(cnt)+" occured errors")
        finally:
            cnt += 1
    outdf['TXDate'] = indf["txDate"].apply(lambda x: to_datetime(str(x), format="%Y-%m-%d %H:%M:%S"))
    outdf["ActualTime"] = outdf["TXDate"].astype('str').str.slice(-8).str.slice(0, 5).str.zfill(5)
    outdf['TXDate'] = outdf['TXDate'].apply(lambda x: x.strftime("%Y%m%d"))
    outdf['SponsorTextStuntChi'] = indf['sponsorTextStuntChi'].replace('^-$',nan, regex=True)
    outdf['SponsorTextStuntEng'] = indf['sponsorTextStuntEng'].replace('^-$',nan, regex=True)
    outdf['BrandNameChi'] = indf['brandNameChi'].replace('^-$',nan, regex=True)
    outdf['BrandNameEng'] = indf['brandNameEng'].replace('^-$',nan, regex=True)
    outdf['EditionVersionChi'] = indf['editionVersionChi'].replace('^-$',nan, regex=True)
    outdf['EditionVersionEng'] = indf['editionVersionEng'].replace('^-$',nan, regex=True)
    outdf['SeasonNameChi'] = indf['seasonNameChi'].replace('^-$',nan, regex=True)
    outdf['SeasonNameEng'] = indf['seasonNameEng'].replace('^-$',nan, regex=True)
    outdf['EpisodeNameChi'] = indf['episodeNameChi'].replace('^-$',nan, regex=True)
    outdf['EpisodeNameEng'] = indf['episodeNameEng'].replace('^-$',nan, regex=True)
    outdf['EpisodeNameEng'] = outdf['EpisodeNameEng'].replace('Episode Number \d+', nan, regex=True)
    outdf['SynopsisChi'] = indf['synopsisChi'].replace('^-$',nan, regex=True)
    outdf['SynopsisChi'].fillna(indf['synopsisChi1'].replace('^-$',nan, regex=True), inplace=True)
    outdf['Classification'] = indf['classification'].replace('^-$',nan, regex=True)
    outdf["Premier"] = indf['premier'].replace('^-$',nan, regex=True)
    outdf["Premier"] = outdf["Premier"].apply(lambda x : 'Y' if x else 'N')
    outdf["Premiere"].fillna(outdf["Premier"], inplace=True)
    outdf["Genre"] = indf['genre'].replace('^-$',nan, regex=True)
    outdf["SubGenre"] = indf['subGenre'].replace('^-$',nan, regex=True)
    outdf["EpisodeNo"] = indf['episodeNo'].replace('^-$',nan, regex=True)
    outdf["SeasonNo"] = indf['seasonNo'].replace('^-$',nan, regex=True)
    for i in outdf["EpisodeNo"][outdf["EpisodeNo"].notnull()]:
        try:
            test = Series([i]).astype(int)
        except ValueError:
            temp = outdf["EpisodeNo"][outdf["EpisodeNo"].notnull()]
            cnt = temp[temp == i].index[0]
            raise ValueError("Episode# line "+str(cnt)+" occured error!")
    for i in outdf["SeasonNo"][outdf["SeasonNo"].notnull()]:
        try:
            test = Series([i]).astype(int)
        except ValueError:
            temp = outdf["SeasonNo"][outdf["SeasonNo"].notnull()]
            cnt = temp[temp == i].index[0]
            raise ValueError("Series No line "+str(cnt)+" occured error!")
    outdf["OriginalLang"] = indf['originalLang'].replace('^-$',nan, regex=True)
    if 'bilingual' in indf.columns:
        outdf["Bilingual"] = indf['bilingual']
    outdf["PortraitImage"] = indf["portraitImage"].replace('^-$',nan, regex=True)
    outdf["IsEpisodic"] = indf['isEpisodic']
    outdf["IsEpisodic"] = outdf[["IsEpisodic", "BrandNameEng"]].apply(lambda x: "Y" if x["BrandNameEng"] == "Midday Market Wrap" or x["BrandNameEng"] == "Smart Investor" else x["IsEpisodic"], axis=1)
    if 'isVOD' in indf.columns:
        outdf["IsVOD"] = indf['isVOD']
    outdf["CPInternalUniqueID"] = indf['cpInternalUniqueID'][indf['cpInternalUniqueID'].notnull()].astype(int).astype(str)
    outdf["MediaID"] = indf['mediaID']
    if 'hktamChannelId' in indf.columns:
        outdf['HKTAMChannelID'] = indf['hktamChannelId'].replace('^-$',nan, regex=True).apply(lambda x: str(int(re.match("^([0-9]+)(\.0*)?$", str(x)).groups()[0])) if re.match("^[0-9]+(\.0*)?$", str(x)) else None)
    if 'hktamProgramId' in indf.columns:
        outdf['HKTAMProgramID'] = indf['hktamProgramId'].replace('^-$',nan, regex=True).apply(lambda x: str(int(re.match("^([0-9]+)(\.0*)?$", str(x)).groups()[0])) if re.match("^[0-9]+(\.0*)?$", str(x)) else None)
    if 'hktamEpisodeId' in indf.columns:
        outdf['HKTAMEpisodeID'] = indf['hktamEpisodeId'].replace('^-$',nan, regex=True).apply(lambda x: str(int(re.match("^([0-9]+)(\.0*)?$", str(x)).groups()[0])) if re.match("^[0-9]+(\.0*)?$", str(x)) else None)
    if 'isLive' in indf.columns:
        outdf["IsLive"]=(indf['isLive'] == "T").map({True:"Y", False:"N"})
    outdf["IsNPVRProg"] = indf['isNPVRProg'].replace('^-$',nan, regex=True)
    txDate = outdf[['TXDate', 'ActualTime']].apply(lambda x: ' '.join(x), axis=1).apply(lambda x: to_datetime(str(x), format="%Y%m%d %H:%M"))
    txDate = txDate.apply(lambda x: x - timedelta(days=1) if x.hour < 6 else x).apply(lambda x: x.strftime("%Y%m%d"))
    outdf["EpisodeNameChi"].fillna(txDate[outdf['BrandNameEng'] == "About Sports"], inplace=True)
    outdf["EpisodeNameChi"].fillna(txDate[outdf['BrandNameEng'] == "15 mins Enews"], inplace=True)
    outdf["EpisodeNameEng"] = outdf[["TXDate", "ActualTime","BrandNameEng","EpisodeNameEng"]].apply(lambda x: x["TXDate"]+" "+x["ActualTime"] if x["BrandNameEng"] == "Smart Investor" else x["TXDate"] if x["BrandNameEng"] == "Midday Market Wrap" else x["EpisodeNameEng"], axis=1)                                  
    outdf["EpisodeNameChi"] = outdf[["TXDate", "ActualTime","BrandNameEng","EpisodeNameChi"]].apply(lambda x: x["TXDate"]+" "+x["ActualTime"] if x["BrandNameEng"] == "Smart Investor" else x["TXDate"] if x["BrandNameEng"] == "Midday Market Wrap" else x["EpisodeNameChi"], axis=1)                                  
    outdf["SponsorTextStuntChi"].fillna(outdf["SponsorTextStuntEng"], inplace=True)
    outdf["SponsorTextStuntEng"].fillna(outdf["SponsorTextStuntChi"], inplace=True)
    outdf["BrandNameChi"].fillna(outdf["BrandNameEng"], inplace=True)
    outdf["BrandNameEng"].fillna(outdf["BrandNameChi"], inplace=True)
    outdf["SeasonNameChi"].fillna(outdf["SeasonNameEng"], inplace=True)
    outdf["SeasonNameEng"].fillna(outdf["SeasonNameChi"], inplace=True)
    outdf["EpisodeNameChi"].fillna(outdf["EpisodeNameEng"], inplace=True)
    outdf["EpisodeNameEng"].fillna(outdf["EpisodeNameChi"], inplace=True)
    outdf["SynopsisChi"].fillna(outdf["SynopsisEng"], inplace=True)
    outdf["SynopsisEng"].fillna(outdf["SynopsisChi"], inplace=True)
    outdf["ShortSynopsisEng"] = outdf["SynopsisEng"][outdf["SynopsisEng"].notnull()].apply(lambda x: x[0:char_limit.get("ShortSynopsisEng")])
    outdf["ShortSynopsisChi"] = outdf["SynopsisChi"][outdf["SynopsisChi"].notnull()].apply(lambda x: x[0:char_limit.get("ShortSynopsisChi")])
    outdf["ShortSynopsisChi"].fillna(outdf["ShortSynopsisEng"], inplace=True)
    outdf["ShortSynopsisEng"].fillna(outdf["ShortSynopsisChi"], inplace=True)
    outdf["Genre"] = outdf["Genre"][outdf["Genre"].notnull()].str.lower().map(genreMapping).fillna(outdf["Genre"])
    outdf["SubGenre"] = outdf["SubGenre"][outdf["SubGenre"].notnull()].str.lower().map(genreMapping).fillna(outdf["SubGenre"])
    outdf["OriginalLang"] = outdf["OriginalLang"][outdf["OriginalLang"].notnull()].str.lower().map(audioLangMapping).fillna(outdf["OriginalLang"])
    outdf["SeasonNo"] = outdf["SeasonNo"][outdf["SeasonNo"].notnull()].astype(int).astype(str)
    outdf["EpisodeNo"] = outdf["EpisodeNo"][outdf["EpisodeNo"].notnull()].astype(int).astype(str)
    text_column = ["SponsorTextStuntEng", "SponsorTextStuntChi", "BrandNameEng", "BrandNameChi", "EditionVersionEng", "EditionVersionChi", "SeasonNameEng", "SeasonNameChi", "EpisodeNameEng", "EpisodeNameChi", "SynopsisEng", "SynopsisChi", "ShortSynopsisEng", "ShortSynopsisChi", "DirectorProducerEng", "DirectorProducerChi", "CastEng", "CastChi"]
    for column in text_column:
        outdf[column] = outdf[column].astype(str).where(outdf[column].notnull()).apply(lambda x: jianfan(x) if isinstance(x, str) else x)
        outdf[column] = outdf[column].astype(str).where(outdf[column].notnull()).str.translate(charTranslateTable)
    outdf[["FullTitleEng", "FullTitleChi"]] = outdf.apply(constructFullTitle, axis=1)
    outdf[["CID", "SID"]] = outdf.apply(constructID, axis=1)
    translateChar(outdf)
    chopCharacters(outdf)


    # Append EOF
    appendEOF(outdf)


    # Fill Channel #
    #outdf['OwnerChannel'] = owner_channel
    #outdf['ChannelNo'] = outdf['OwnerChannel'].replace(ownerChannelMapping) 
    outdf['ChannelNo'] = ownerChannelMapping.get(owner_channel, owner_channel)

    # Write output file
    return outdf.rename(columns=pwhHeaderMapping)

def formatOut(outdf):
    contents = []

    outdf_T = outdf.T

    for col in outdf_T.columns:
        content = OrderedDict([(i, j) for i, j in zip(outdf_T[col].index, outdf_T[col].apply(lambda x: None if isnull(x) else x))])
        contents.append(content)

    return contents

def injestOut1(outdf):
    #injest mode	
    outdf['modifiedBy'] = None

    outdf = outdf[[
    "engSeries",
    "chiSeries",
    "engName",
    "chiName",
    "isNpvrProg",
    "isRestartTv",
    "recordable",
    "createdBy",
    "modifiedBy",
    "episodic",
    "withImageTitle",
    "cid",
    "sid",
    "channelId",
    "txDate",
    "actualTime",
    "premier",
    "effectiveDay",
    "expirationDay"
    ]]

    out_contents = formatOut(outdf)

    # extract injest json dict
    injestion_contents = OrderedDict()

    injestion_contents["applyCorrection"] = "Y"
    injestion_contents["importDb"] = "Y"
    injestion_contents["mode"] = "ingest"	
    injestion_contents["input"] = out_contents	

    return injestion_contents


def injestOut2(outdf):
    #injest mode	
    outdf['modifiedBy'] = "pccw-boesystem@pccw.com"
    outdf['createdBy'] = "pccw-boesystem@pccw.com"

    tmp = outdf[["createdBy", 'modifiedBy']]
    outdf = outdf.drop(['cid','sid','premiere','premier',"createdBy", 'modifiedBy'], axis=1).join(tmp)

    out_contents = formatOut(outdf)

    # extract injest json dict
    injestion_contents = OrderedDict()

    injestion_contents["applyCorrection"] = "Y"
    injestion_contents["importDb"] = "Y"
    injestion_contents["mode"] = "ingest"	
    injestion_contents["channelId"] = str(outdf['channelId'][0])	
    injestion_contents["input"] = out_contents	

    return injestion_contents

def injestOut(outdf):
    #injest mode	
    outdf['modifiedBy'] = "pccw-boesystem@pccw.com"
    outdf['createdBy'] = "pccw-boesystem@pccw.com"

    outdf = outdf[[
"progId",
"channelId",
"txDate",
"actualTime",
"engName",
"chiName",
"engSponsor",
"chiSponsor",
"engSeries",
"chiSeries",
"engVersion",
"chiVersion",
"seasonNum",
"engSeasonName",
"chiSeasonName",
"episodeNum",
"engEpisodeName",
"chiEpisodeName",
"engSynopsis",
"chiSynopsis",
"engShortSynopsis",
"chiShortSynopsis",
"isLive",
"classification",
"genre",
"subGenre",
"engDirector",
"chiDirector",
"engActor",
"chiActor",
"originalLanguage",
"bilingual",
"audioLanguage",
"subtitleLanguage",
"regionCode",
"firstReleaseYear",
"episodic",
"isVod",
"withImageTitle",
"oriPortraitImage",
"catchUpRecordable",
"cpInternalId",
"cpInternalSeriesId",
"recordable",
"isNpvrProg",
"isRestartTv",
"effectiveDay",
"expirationDay",
"mediaId",
"hktamChannelId",
"hktamProgramId",
"hktamEpisodeId",
"createdBy",
"modifiedBy"
]]

    out_contents = formatOut(outdf)

    # extract injest json dict
    injestion_contents = OrderedDict()

    injestion_contents["applyCorrection"] = "Y"
    injestion_contents["importDb"] = "Y"
    injestion_contents["mode"] = "ingest"	
    injestion_contents["channelId"] = str(outdf['channelId'][0])	
    injestion_contents["input"] = out_contents	

    return injestion_contents

def to_json(out):
    json = ""
    space = "    "
    if type(out) == list:
        json += "[\n"
        i = 0
        for item in out:
            json += space+"{\n"
            j = 0 
            for index, value in item.items():
                if notnull(value):
                    #json += space*2+"\""+str(index)+"\":\""+"".join(re.split('([ ]+)',str(value)))+"\""
                    #json += space*2+"\""+str(index)+"\":\""+" ".join(str(value).split())+"\""
                    json += space*2+"\""+str(index)+"\":\""+re.sub(" +"," ",str(value))+"\""
                else:
                    json += space*2+"\""+str(index)+"\":"+"null"
                if j < len(item) -1 :
                    json += ",\n"
                else:
                    json += "\n"+space+"}"
                j +=1
            if i < len(out) -1 :
                json += ",\n"
            else:
                json += "\n]"
            i += 1

    else:
        json += """{\n"""
        #header = """{\n\t"applyCorrection":"Y",\n\t"importDb":"Y",\n\t"mode":"ingest",\n\t"input":[\n"""#1117
        #tail = """\n}""" #1117
        for key, value in out.items():
            if key != "input":
                json += space + """\"""" + key + """\":\"""" + value + """\",\n"""
            else:
                json += space + """"input":[\n"""
                i = 0
                for content in value:
                    json += space*2 + "{\n"
                    j = 0
                    for row, col in content.items():
                        if notnull(col):
                            #json += space*3+"\""+str(row)+"\":\""+"".join(re.split('([ ]+)',str(col)))+"\""
                            #json += space*3+"\""+str(row)+"\":\""+" ".join(str(col).split())+"\""
                            json += space*3+"\""+str(row)+"\":\""+re.sub(" +"," ",str(col))+"\""
                        else:
                            json += space*3+"\""+str(row)+"\":"+"null"
                        if j < len(content) -1 :
                            json += ",\n"
                        else:
                            json += "\n"+space*2+"}"
                        j +=1
                    if i < len(value) -1:
                        json += ",\n"
                    else:
                        json += "\n"+ space +"]"
                    i += 1
        json += """\n}"""

    return json

def convert_nonlinear(in_io, out_io, format="preV1506", owner_channel="ViuTV"):
    "Convert nonlinear for ViuTV"
    return None

def exception_handling(e):
    extype = type(e).__name__
    exinfo = str(e)
    if extype == 'FileNotFoundError':
        exinfo = ("E1001-File Not Found Error: " + str(e))
    elif extype in ('ValueError', 'KeyError', 'TypeError', 'AttributeError', 'NameError', 'IndexError', 'ArithmeticError', 'EOFError'):
        if str(e) == "Expected object or value" or str(e) == "Expected String or Unicode" or str(e) == "Unexpected character found when decoding 'false'" or str(e) == "Trailing data":
            exinfo = ("E1002-Cleansing Error: input is neither a json file like nor json string")
        elif str(e).startswith("'NoneType' object"):
            exinfo = ("E1002-Cleansing Error: unsupport ForeTV channel")
        else:
            exinfo = ("E1002-Cleansing Error: " + str(e))
    elif extype == 'RuntimeError':
        exinfo = ("E1003-Runtime Error: " + str(e))
    elif extype == 'IOError':
        exinfo = ("E1004-IO Error: " + str(e))
    elif extype == 'WindowsError':
        exinfo = ("E1005-Windows Error: " + str(e))
    elif extype == 'OSError':
        exinfo = ("E1006-OS Error: " + str(e))
    elif extype == 'GetoptError':
        exinfo = ("E1007-Command Option Error: " + str(e))
    elif extype in ('IndentationError', 'ImportError', 'ModuleNotFoundError', 'SyntaxError'):
        exinfo = ("E1008-Python Error: " + str(e))
    elif extype == 'KeyboardInterrupt':
        exinfo = ("E1009-Keyboard Interrupt: " + str(e))
    elif extype == 'SystemError':
        exinfo = ("E1010-System Error: " + str(e))
    else:
        exinfo = ("E1000-Unexpected Error: " + str(e))
    return exinfo

def to_io(output, isPrint, isJson, isInjest, filePath, out_format="post"):
    if isPrint:
        if isJson:
            if isInjest:
                out = injestOut(output)
            else:
                out = formatOut(output)
            if out_format == "post":
                print(json.dumps(out,ensure_ascii=False,indent=4))
                #print(json.dumps(out,ensure_ascii=False,indent=4).encode('utf-8',errors='ignore').decode('gbk',errors='ignore')) #.decode('gbk',errors='ignore')
            else:
                print(to_json(out))
        else:
            print(output.to_html())
    else:  
        filename = re.split("/|\\\\", os.path.abspath(filePath)) 
        out_filename, out_filename_ext = os.path.splitext(filename[-1])
        if isJson:
            if out_filename_ext != ".json":
                raise GetoptError("The output file type is not match the --output param!") 
            if isInjest:
                out = injestOut(output)
            else:
                out = formatOut(output)
            if out_format == "post":
                result = json.dumps(out,ensure_ascii=False,indent=4)
            else:
                result = to_json(out)
        else:
            if out_filename_ext != ".html":
                raise GetoptError("The output file type is not match the --output param!")
            result = output.to_html()
        try:
            f = open(filePath,"w",encoding='utf-8')	
            print(result, file=f)
        #raise IOError("Error occured during output file.")
        except Exception as e:
            raise IOError("Error occured during output file.")
        finally:
            f.close()
            print(f.closed)
            
if __name__ == "__main__":
    from sys import argv
    from sys import exit
    from getopt import getopt, gnu_getopt, GetoptError
    from werkzeug import secure_filename
    from werkzeug import exceptions
    import os
    import re
    import json
    from shutil import copy
    from random import random
    helptxt = "\nUsage:\n  APIWrapper <command> [options] file\n\nCommands:\n  help                        Show help for commands.\n\nGeneral Options:\n  -h, --help                  Show help.\n  -o <format>                 give output in format: (html)html, (json)json, \n                              other format will throw exception \"--output param\n                              is unsupported output format!\".\n  --output <format>           give output to a formatted file in current path \n                              if no outputfile param: (html)html, (json)json, \n                              if succeed, then give value True, other format  \n                              will throw exception \"--output param is unsuppor\n                              ted output format!\".\n  --outputfile <src>          give output to a specific file. The output file \n                              type should be match to --output param, or will \n                              throw exception \"the output file type is not mat\n                              ch the --output param!\".\n  --injest <src>              \"--injest=Y\" means output the data using injest \n                              format, or output the data originally."
    helptxt1 = "\nUsage:\n  APIWrapper <command> [options]\n\n"
    try:
        if len(argv) == 1:
            raise GetoptError("The syntax of the command is incorrect.Try \"APIWrapper help\" for more information.")
        elif argv[1] == 'help' or argv[1] == '--help' or argv[1] == '-h':
            print(helptxt)
            exit(0)
        output = convert_linear(argv[1])
        opts, args = gnu_getopt(argv, 'ho:', ["output=","outputfile=","injest=","help"])       #any input "output" starts with will be changed into "output"
        filename = argv[1]
        #print(str(opts))
        #print(str(argv))
        out_filename, out_filename_ext = os.path.splitext(re.split("/|\\\\", filename)[-1]) 		
        isPrint = True
        isInjest = False
        isJson = True
        isFile = False
        if len(opts) > 0:
            if "--help" in OrderedDict(opts) or "-h" in OrderedDict(opts):
                print(helptxt)
                exit(0)
            for opt, arg in opts:
                if opt == "--output":
                    isPrint = False
                    if arg == "json":
                        isJson = True
                        if out_filename +".json"  in os.listdir("."):
                            out_filename = out_filename + str(random())[2:] 
                        filename = os.path.abspath(".")+"/"+out_filename +".json"
                    elif arg == "html":
                        isJson = False
                        if out_filename +".html"  in os.listdir("."):
                            out_filename = out_filename + str(random())[2:]
                        filename = os.path.abspath(".")+"/"+out_filename +".html"
                    else:
                        raise GetoptError("--output param is unsupported output format!")
                elif opt == "--outputfile":
                    isPrint = False
                    if arg.strip() == "":
                        raise GetoptError("Please enter output file name!")
                    filename = arg
                    filename_dir = os.path.dirname(os.path.abspath(arg))
                    if not os.path.exists(filename_dir):
                        raise GetoptError("The direcory does not exist!")
                elif opt == "-o": 
                    isPrint = True
                    if arg == "json":
                        isJson = True
                    elif arg == "html":
                        isJson = False
                    else:
                        raise GetoptError("-o param is unsupported output format!")
                else:
                    if arg == "Y":
                        isInjest = True
                    else:
                        isInjest = False
        else:
            isInjest = True

        to_io(output, isPrint, isJson, isInjest, filename)
        #print(argv)
        #print(opts)
        #print(args)
        #print(output.to_html())
        exit(0)
    except Exception as e:
        print(exception_handling(e))
        exit(1)